{"meta":{"title":"空谷小屋","subtitle":"空山新雨后，天气晚来秋","description":"一步步记录自己走过的路罢了","author":"lanxuewei","url":"http://yoursite.com","root":"/"},"pages":[{"title":"","date":"2019-09-09T10:56:43.876Z","updated":"2019-05-28T15:58:00.000Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"","date":"2019-09-09T10:56:43.876Z","updated":"2019-05-28T15:56:56.000Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"23年-心路历程","slug":"37-23年-心路历程","date":"2024-03-17T14:53:07.633Z","updated":"2024-03-17T14:57:48.427Z","comments":true,"path":"2024/03/17/37-23年-心路历程/","link":"","permalink":"http://yoursite.com/2024/03/17/37-23年-心路历程/","excerpt":"2023年以新冠自我隔离从22年跨过来，没想到在22年最后几天感染新冠，只能说，命途多舛。","text":"2023年以新冠自我隔离从22年跨过来，没想到在22年最后几天感染新冠，只能说，命途多舛。 2023-01-18 小雨-寒 经历了一周升温舒服天气之后，最近几天又是寒潮来袭，温度骤降，甚至周末飘起了大雪，出门随处可见一层层薄雪覆盖在车表和路面，让人猝不及防，只能紧紧裹住羽绒大衣。 2023-04-01 晴 昨天三点多从杭州奔赴至龙岩，再一脚踩着老爸留在动车站的车回了上杭，刚一上车时，车的高度，中控以及扶手箱非常不习惯，一两个月的自动挡直接让我这个老司机直接将多年来习惯的手动挡都快忘了，一脚油门下去想要超车发现没有反应。 早早地爬起来开车去了民政局，签字盖章领证，好像没花多少时间，我就步入人生新阶段，未婚到已婚，其实内心是有些感触的，有那么一瞬间竟然有些错愕，我这就结婚了？甚至自己有些都还没反应过来，等到晚上想着如此大事总得发个朋友圈吧，不过虽然计划许久，但一直没认真想过文案，楠楠子率先有了文案——“智者不智，愚者非愚”，我一听大概意思来源于着智者不入爱河之意吧，突然脑子一闪而过，立马有了下联——“智者不入爱河，不智者掉河里两次”，既呼应了她的文案，又表明了时隔七年后再一次栽在她手上，多少有一些文采在这的，她闺蜜和她看到之后直接笑出声，看得出来，除了文采外，美式幽默也是多多少少有一些的。 2023-04-16 阳光明媚 好像从几年前冯仔还在杭州的时候，大家就一直吵嚷着一定要去徽杭古道徒步旅行，但疫情困住了我们两三年，直到冯仔回贵阳已经半年了，我又旧事重提，只不过这一次大家说走就走，看攻略，买票之后就只剩下对周末的各种期待，但我好像被工作缠住，还没来得及开心，周六就来临了，快乐总是这么猝不及防。 周五下班后和老婆一起骑着小电驴去阿峰烧烤吃饭，口味实在是像极了老家的大排档口味，得到我们一致肯定后，已经反复来过好几次了，炭烤牛蛙、炭烤鱼以及爆炒螺丝，嚯嚯啤酒，很巴适。吃着饭聊着天，外面突然开始哗啦啦下起雨来，春天里的温度已经回升，下着雨并太不冷而是一股凉飕飕的感觉，位置又刚好靠近门口，转头就可以看见雨水滴滴答答落在地上汇成一股小流淌在马路上，江南雨乡大抵如此，温柔且浪漫。 由于徒步翻山越岭，开车不便，只能在周六五点多醒来的早晨，穿衣洗漱，骑着小电驴到地铁口，从五号线换乘十九号线，一个多小时到达临安，眼看着小灰灰三人坐着满员大巴车从我们面前开走，我们真想问问司机能不能把我们三塞后备箱也行啊，溜上西站二楼排上队后也就十来分钟就坐上大巴，司机大哥，冲啊，给我追上小灰灰他们！ 又是一个多小时，从临安坐着大巴车总算到了昌化镇，六人小分队总算顺利会师，路边一人一碗面下肚之后包上商务小面包车出发，目标徽杭古道杭州入口，良心司机一路送到售票处，门口处几个团的徒步人员把我吓懵了，你们这是来参加马拉松比赛的嘛，一个个都在疯狂热身，一身装备齐全跃跃欲试的样子，再回头看看我们业余小团，对比之下胜负已分。 五点多起来到检票，已经是十点四十五了，开启旅行之后，只觉一身轻松，前一天下过雨之后，温度刚好，凉快又不燥热，一路上随处可见红色紫色的杜鹃花，还有一些白色小花，错乱生长着。 一路上走走停停拍了许多照片，十七八九公里的路程把众人都走得有些许疲惫，小灰灰继武功山眼镜丢了之后，又一次膝盖走疼慢悠悠落在队伍最后，被一路过的大叔嘲笑这什么下山姿势，满怪异的，我看着他那不争气的样子，只能向他对象吐槽，抓紧给他把小母鸡安排上，好好补补身体，下次可不许这样了。 靠近绩溪北入口处的景色大抵是整条路上风景最好的一段路了，小红书的宣传照就是在此处拍的吸引我几年来念念不忘，他们是懂宣传的，山间清凉的风，谷底清澈见底的一条溪流贯穿了整个古道，沿着各种大石夹缝流淌着，细看可见各种小鱼皆若空游无所依，山水相间，山脉又是黄山余脉，颇有黄山影子，有时温柔似水，有时洒脱大气。 回杭州已经是晚上八点多了，本想着去临近西站的老纪蚝宅旁的阳光烧烤吃点烤串嚯点啤酒来给愉快的一整天徒步旅行画上圆满句号，结果满心愉悦带着众人过去之后，哎卧槽，我记忆中的阳光烧烤两三年没来怎么变成幼托了，直接懵逼众人。所幸，老纪蚝宅也是不错的替代品，让我没想到的是，这家店几年不见，直接将一条街的四五个店都盘下来了，一路过去到处满员，直到最后一家才在门口找到一张桌子坐在，嗯，这样就有夜生活的感觉了。 感觉再过一两年，这条街大概都要姓老纪了，只不过菜品味道虽然不错，量却偏少，价格稍贵，喝酒干杯。就这样从大早上玩到午夜，满满当当的周六在最后一杯酒抹尽之后结束了，众人散去，各回各家，躺在床上，任由乳酸刺激着神经，在劳累和酸爽中睡去。 徒步确实是费身体不花钱的好活动，众人一趟下来，似乎根本没花多少钱， 四舍五入约等于白玩，我想，大概率没几天后，我又要开始计划下一步出行计划了。 2023-05-16 小雨 工作工作不顺心，生活生活不如意，每天忙里忙外，感觉还是迷迷糊糊，近期迭代完成度总是很低，被各种问题困扰抽不出身来，还要受白眼，每次想到目前总遇到挑战似乎好像一直往上走，可以成长不少，归属一半的期权，模凌两可的上市计划，总让人住摸不透。 2023-05-26 小雨 终于，在儿子不是儿子，弟弟不是弟弟之后，哥哥也难当了。 2023-05-30 阴 真是受够了无休止的内耗，工作上忙的晕头转向，绞尽脑汁，回到家还要各种争吵不休，感觉生活毫无盼头，无趣，我是一个认死理的人，有些时候一件小事，在我认为却是原则性问题，不是不想低头，而是无法忍受。 2023-06-11 晴 有时候我觉得自己是个窝囊的废物，有时候也想过一了百了，有时候也想过撒手人寰什么都不再管，你们愿意如何就如何去吧，别在我面前装出一副和谐和睦和平的样子，我只会透过这些看到各种虚伪，感到恶心，对于深爱的人宽容退步却总是被扎刀子，慢慢意识过来才觉得，大都不配，只会内耗内斗的劣根性展露无遗，近些年家庭所传递的都是消极负面能量，可笑我爸将家和万事兴挂在客厅没几年，兄弟决裂，还要牵扯上我们，微信也能被婶婶拉黑，最重视大家庭和谐的老爸却因为各种小事与伯母、婶婶、小叔各种争吵，即使退让也是委屈受尽，不计较没做错又如何，还是受尽冷落遭受白眼。 2023-06-12 晴 一切与他人无关，大概就是太累了，似乎该说的也都说完了，也没什么还可以补充的，那就这样吧。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"24年-心路历程","slug":"39-24年-心路历程","date":"2024-03-17T14:20:41.259Z","updated":"2024-04-15T05:10:29.523Z","comments":true,"path":"2024/03/17/39-24年-心路历程/","link":"","permalink":"http://yoursite.com/2024/03/17/39-24年-心路历程/","excerpt":"2024来得比想象中快，我还没准备好，已然投入新年，要说24年关键词大概就是 —— “挑战与期望共存”。","text":"2024来得比想象中快，我还没准备好，已然投入新年，要说24年关键词大概就是 —— “挑战与期望共存”。 2024-03-17 阴 今年的主旋律是主打一个办大事，考虑买房、生娃、跳槽等事情集中在一起了，加上公积金总资产其实也就70w不到，可以考虑先借些钱买房上车，之后大概率就考虑孩子的事了。 回忆一下年初至今，两人逐渐磨合，除了一月份几次争吵之外，一直相安无事，春节开着小5就一路狂飙回家了，说起来，这还是第一次带小5回家过年，未买车之前对于车子无限喜欢，总觉得，要是自己以后能够有一辆喜欢的车子，大概是件非常非常美好的事了，不管刮风下雨，都可以带自己去任何想去的地方，就像那句听起来很没内涵但却蛮有意思的话 —— “男人可以没有家，单不能没有战马”。 无论几次下到车库看到披着松霜绿的小5，总觉得很帅，喜欢到不行，最开始店里看到的时候我是get不到它的颜值的，但它似乎属于耐看型，越看越是欢喜。快一年的时间，它带着我走过了太多地方了。 昨天周六，惠风和畅，天朗气清，春日里的阳光让我们起了个大早，平时工作日都还在睡觉的时间点却收拾完毕，穿戴整齐，推着自行车出车了，行驶在城市道路里，穿梭在行人电动车中，一路赏着花儿朝着上城区，钱塘江边骑去，大概因为起源于自然，所以当亲近自然时，总觉得像是投入了母亲怀抱，那股舒适与自由感总萦绕在心头。 上周去了中河片区附近吃了极好吃的小林刺身日料，所以在骑车回来经过浙大门口看到同款连锁店时便埋下了晚上吃日料的小心思，浙大玉泉门口的小林刺身菜单少了些烧烤，老婆的点评是不如中河片区的店，但味道还是不错。 晚上在郑远元洗脚，旁边进来了个小兄弟，说是脚上长了个肉刺想看看顺便问问价格，技师帮忙看之后开出400的价格，大概和他说了些疗程的事，最后小兄弟回复说自己大概了解了，回去考虑考虑。技师不解便询问他还主要是考虑什么原因，小兄弟挠挠头说因为自己刚参加工作，400对于他来说还是挺多的，暂时拿不出。听到这些对话，我也是偷偷用眼角瞥了一眼旁边的小兄弟，看着他脸色略带羞涩尴尬的表情，心里有种说不出的滋味，突然想起那句 —— “众生皆苦”，网络让我们见识到各种富有生活，或是城市里灯红酒绿，让我们忽略了其实许多的人还依旧艰难生活着，也替他的父母感到心疼，技师给出了项目分批次的方案，但最后小兄弟还是因囊中羞涩忍着痛踩着拖鞋离开了店里，依他所说现状就是已经影响到正常生活了，穿着板鞋或皮鞋时走路脚生疼，我猜测大概是个销售或是中介之类的吧，疫情这些年大家赚钱也不容易，走时加了技师微信，不确定他什么时候可以凑够这钱治好肉刺，希望不会太久。 我不是上帝，大多时候只能照顾自己以及身边人，对于眼见的苦难，有时候能伸手给予帮助，有时候却又只能做个旁观者，虽然感触良多，但大概这就是每个人自己独有的人生吧，需要经历苦痛挣扎，拨云见日。 2024-04-08 雨 “母弱出商贾，父强做侍郎，族望留原籍，家贫走他乡。” 最近总是飘着春雨，骑着小电驴，即使穿着雨衣，雨水也像春风般飘来拂面，到公司时跟洗了把脸似的，有时也拿出头盔扣住，任凭雨水打湿模糊挡风罩。偶发间歇性情绪低落，垂头丧气，个人感受不被关心。 最近刷题有些心累，top100 进度仅 30+，阿里蚂蚁面试一面全挂，工作内容又被拆分，小组长离职，没有了方向。 无法理解，说着不痛不痒的话，轻松且随意，无法感同身受，一心只顾自我感受。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"23年-书","slug":"38-23年-书","date":"2023-08-09T22:49:54.640Z","updated":"2024-03-17T15:39:41.160Z","comments":true,"path":"2023/08/10/38-23年-书/","link":"","permalink":"http://yoursite.com/2023/08/10/38-23年-书/","excerpt":"今年的阅读量其实还算可以，大概是基于对去年的反思，所以开始重新捡起来，但是对于读后感却是落下了，不清楚是因为工作太忙还是怎么说，也是要改改。","text":"今年的阅读量其实还算可以，大概是基于对去年的反思，所以开始重新捡起来，但是对于读后感却是落下了，不清楚是因为工作太忙还是怎么说，也是要改改。 布鲁特斯的心脏——东野圭吾 —— 如果为了一切都不择手段，好像这世界也没有什么宝贵的东西了。 主人公因为家庭不幸，导致成长后心智不够健全，为达目的不择手段，自负目空一切，将聪明才智用在歧途，为了前途即使被星子呼来喝去也装出一脸无所谓的样子，心里却想着待到自己掌权如何如何。对比仁科家族，阶级之间的差距却是巨大无比，有时候也会感叹世道不公，有人从出生就是罗马，有些人出生就是牛马，很可惜，我便是牛马，感觉每日工作不说幸苦，只觉得似乎对于未来有些迷茫，高房价高消费好像令人举步维艰，但我不是末也，也找不到星子，更不会隐忍蛰伏供人呼来喝去，只想守的一亩三分地，过好安稳小日子，希望初心不变，心常热枕。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"书籍","slug":"书籍","permalink":"http://yoursite.com/tags/书籍/"}]},{"title":"22年-心路历程","slug":"35-22年-心路历程","date":"2022-10-17T16:07:02.949Z","updated":"2024-05-22T16:43:13.297Z","comments":true,"path":"2022/10/18/35-22年-心路历程/","link":"","permalink":"http://yoursite.com/2022/10/18/35-22年-心路历程/","excerpt":"我以为2022开局就是王炸，但总是跌宕起伏，犹未可知。","text":"我以为2022开局就是王炸，但总是跌宕起伏，犹未可知。 2022-01-12 小雨-寒 挂了电话后她说，还是别这么着急结婚了，缓缓吧。 这一次，真不觉得自己做错什么，既没说什么，也没做什么，但这话听起来是那么刺耳，一时间之间不知道回答什么。 关于结婚的事，一方面不希望老爸压力大，自己甩手掌柜，想着帮忙承担一些，另一方面也不想因为这些事影响到她的心情，所以许多事没有没有和她提起过，却不曾想到头来还闹成如此这般，倍感无奈，明明很简单的事却似乎也像个敏感话题，凡提及必然要闹出不快，这样的状态突然让我有些担心，我想，以后生活应该会有更多困难吧，这种处理解决方式确实让我很担心。 突然想起平凡的世界中的宋钢，很心酸，人间不值得，解脱也挺好。 一个人喝酒总是不过瘾，昏昏沉沉倒头就睡，似乎远没有当初众人狂欢，然后再慢悠悠一路跌跌撞撞走回去，偶尔躺在马路睡着来的痛苦，阮籍猖狂，岂效穷途之哭大概也就如此罢。 2022-01-15 阴似乎过年回老家到现在回杭上班，整个人一直处在雨雪天气的笼罩下浑浑噩噩。 大概率汉堡加咖啡又遇上换季，慢性咽炎又继续严重起来，难受到想把喉咙割开，开瓶水将手指划破，一急躁又将杯子摔坏，诸事不顺，似乎好几年了，一直都这么倒霉，琐碎小事总是惹人心烦。 她不是温顺的小绵羊，很多事感觉还是少多嘴，毕竟大家都是成年人，毕竟所谓的关心很多时候在对方看来都变成啰嗦和教训，虽然大概也许以后这样两人相处会更加融洽，却又让自己感觉到疏远，一旦人理性起来后总容易丢掉感性，不会再去做那些看似幼稚却又真正触人心扉的感动，其实自己理性起来时实在太过于可怕，可以任何事都无所谓，在感情上，实在是不想让自己变成这样。 明知道喝酒又会继续加重慢性咽炎，但总在烦躁时想着，人生得意须尽欢，就活一辈子，及时行乐大概才是人生真谛。 晚安，倒霉的阿伟。 2022-04-05 大晴 清明小假期就这样结束了，坐在回杭的高铁上，望着窗外湛蓝的天空与成片的房子向着车尾跑去，思绪万千。总是在坐高铁的时候戴着耳机听歌，感触良多，似乎只有在那些时刻，心才会真正安静下来好好欣赏沿途的风景。看着窗外变化万千的建筑物，经常感觉人生短暂，时间就像这辆列车，窗外的风景也在不断变化，时而山丘，时而稻田，也有河流城市，人生不外如是，谁又能预料到片刻之间会看到怎样的风景，车上旅客上上下下，谁都是彼此的过客。 要是假期没有结束，要是没有疫情，要是我楠楠子在旁边，要是我们一起开拔萍乡武功山，那该多好。 回龙岩的这几天感觉就是一晃而过，突然就没了，今年清明难得一见的没有下雨，朋友圈都是踏青出游的照片和欢乐。我们自然也不例外到处走了走，躺在草地上吃着总重四斤却有三斤壳一斤核的榴莲，不过所幸味道浓郁，香气扑鼻，香甜可口。坐在体育中心篮球外场边，顶着还有些灼人的夕阳，看着场上各人随意挥洒汗水，倍感羡慕，球场四周围种了许多棕榈树，给人一种海边的错觉，这一切简直与我梦中理想天堂一模一样，不燥的夕阳伴随着大海的浪声夹杂着咸咸的海风，带走夏天的一股股热气，取而代之的是一阵阵的凉爽，与三五好友在球场上奔跑追逐竞技。 看看新闻报道，上海疫情越发严重起来，总感染人数已破万，骇人听闻，并且总有零零散散的人员外流导致各地零散爆发，算起来疫情从19年底至今已经是第四年了，很怀念不带口罩的日子，现如今出行总要裹着口罩，有时又热又晕，还呼吸不畅，不知几时才能彻底结束。 希望生活越来越好吧，灾难别再继续下去了。 2022-04-05 大晴 周末两天时间过得真快，每次感觉什么都还没做就已过去，今天已是周日，吃饭拖地洗完床单已经三点半了，在家听着周董的歌，突然有些嘴馋，打开美团却又不知道点些什么，看到绝味鸭脖突然想起大学时小鸡巴每次去约会，总喜欢从东门带些凉菜回来，莲藕腐竹等既辣又可口，再加一两瓶冰可乐总能得到满足口腹之欲，不过我后面想不通的一点，这他吗怎么翻来覆去全是菜，就没一块肉，草，终究是基友不配了。 回想起大学时光真是开心快乐无比，如今毕业赚点钱真是不容易，幸苦累死不说，买个房都买不起，见鬼，完了，我又要开始焦虑了。 2022-04-29 小雨 刚过凌晨，外面下着小雨，明明前几天还热到需要开空调，现在洗完澡穿着短裤坐在这已经感觉进入冬季，脚下发冷。在家办公不太习惯，又Wifi故障、Idea闪退各种问题导致工作进度延缓，本次迭代进度落后，单测任务又因为领到代码量最多的项目而呕心沥血写了三天还是只提升了3%的覆盖率，在家办公工作时长反而比正常上班还长的多，每天搞到十一二点，心态奔溃。 数不清楚因订婚结婚的事吵过多少次了，她觉得不重视，考虑过于简单。以前我总以为如果两个人相互喜欢，甚至结婚也不过九块九的一件事罢了，却没想到光是订婚都一堆幺蛾子。临近五一，突然又觉得我们家不够重视，回想起之前见家长，也是如此，每天工作工作做不完，也没有任何人可以商量，爸妈不管，女朋友又总觉得这是男方家自己该考虑的事，不应该去问她，这种孤零零的无助感似乎一直就存在着，只不过以前自己一个人，习惯了独来独往，不需要考虑别人，凡事只要迎合自己就好，喝酒熬夜，加班撸码想做什么就做什么。现在却行不通了，既要在父母放养情况下好好赚钱，又要考虑各种乱七八糟的杂事，甚至于买什么礼物也没人商量，身边仅剩的基友也是没有丝毫经验，无数个深夜我总喜欢喝酒想事，我不想去感叹不公，我也无需别人关心，只是总在想，我活着的意义，其实最后我也渐渐明白，我生活的意义无他，及时行乐，纵使某天觉得过不下去了，那也无所畏惧，至少一直都是取悦自己，活得开心便可。 也许从小到大就这样习惯了吧，一开始还很珍惜所谓的友情，总是怀念和不舍，到后面大学，经历了自己一个人熬过那段无助和痛苦之后，感觉自己已经冷血了不少，没有以前矫情，也不需要找人诉说难受，喝酒做点自己喜欢的事便可过去所有事，所有一切让以前的我觉得奔溃到根本无法承担，现在却好像都可一笑了之。我不知道该不该庆幸自己这种转变，不过似乎确实日子比以前好过多了。 春节她爸爸的一句话让我真的以为订婚只是重要的亲戚认识一下而已，一直以为订婚也只是如此便可，所以没有过多考虑，加之之前一直没提，所以也没引起重视，结果在五一回家前几天，不知为何，她突然觉得我欠考虑，将所有事考虑得过于简单，既没有提前准备衣服，也没有提醒她，好像订婚这件事没有遵从像她朋友那样便是我们家不重视。提到三金五金的事又闹的不快，其实之前我一直以为这些是结婚前准备的，原本计划今年国庆结婚，所以去年年底还没领到年终就打算将其拿来用在此处，一方面不想父母压力过大，也想自己出一部分，另一方面也考虑对于以后我们小家庭的事在父母面前也可以更有话语权。但此刻突然提出订婚需要，确实让我有点不知所措，手上没有现金，也不好意思向父母开口，一时间左右为难，而且时间又临近没有多少，考虑过先找姐姐借个几万，但又觉得回家后再买会不会来不及，明明之前总说不急，我便搁置，现如今又突然急起来真是头大到不行。 昨晚针对这件事两人进行了复盘，说出自己心里所想之后，她好像理解了，问我为什么一开始不说，其实之前每次提起订婚的时候她已经开始情绪激动，同样的话，大概之前说出口也还是会吵起来吧，所以就一直也没有说了。明明说好先不管这些事了，这些也不是最重要的，两人安心睡去。但今天莫名其妙从七点失踪到十点多，消息不回电话不接，担心不行，坐在这也没心思工作，几分钟看看手机一直也没有消息，想着大概也许是不是累了睡着了，十点十一点应该会醒吧，就这样傻傻的等着。却没想到回来后开始正经聊天第一句话就是又突然觉得我们家不够重视她，说和她同事聊了一晚上，她同事订婚甚至请假一周准备。突然间，心里好像被一根针刺痛，好像所谓的重视只有仪式才能表达，以前的细节，态度都抛之脑后。听到这句话心里真的要气炸，究竟怎么样算重视，所谓的仪式，还是胜过别人。 我带着生气的口吻反问道，要我也请假一周回去准备是吗？有些生气，真的感觉没必要解释了，翻开日历，翻开车票记录可以很清楚看到，平均每个月就会在杭州龙岩跑个来回，花在这上面的时间和精力又有多少，相比较而言，爷爷病的有些严重了，我也只是想着五一回去看看，这样想起来，真的有些心寒，凭一时喜好决定我的重视。基本上把所有的年假病假都拿来陪她，就因为订婚这件事，说什么我们全家不够重视她，不然就不会没人提前回去和她父母商量，难不成要她父母自己决定就好？ 我爸一直以来基本上不管我，从小到大，除了要求我考前几之外似乎也没有别的要求了，对于高考也只觉得输给了成绩一直不如自己的发小丢了他的脸，最难受的我却还要挨了顿骂。甚至于高考志愿也是我自己一个人在最后半天决定报考工大计算机，明明那时候自己也才十八岁，却只能独自摸爬滚打。我妈在这帮忙照顾小外甥，甚至也不会单独坐车，她说出我们家没人提前回去的时候，我又是一愣神，反问了一句，你觉得我们家应该谁提前回去？她顿时有点生气，你不要又来问我，突然之间，我真的不知道说什么了，她真的站在我的角度替我考虑过吗？除了我自己，我还应该指望谁呢？为什么把所有问题都抛给我一个人，如人饮水，冷暖自知。 她甚至于工作都可以亲戚家人帮忙找好，在外租房也是父母帮衬着找，又怎么会想象到事事躬亲，什么事都只有自己一个人的那种无助，实习时寄宿在我姐家，打着地铺，每天通勤两个多小时，早九晚九，周六还要加班的时候那种幸苦。毕业后，也是自己趁着中午吃饭时间去找了房子，与房东谈好，自己搬家，开启了996的生活，甚至有时候累到周六请假在家只为睡觉休息，经常累到想哭，也就只有晚上回家后，自己喝点小酒能够缓解释怀，安慰自己人生得意须尽欢。在我爸眼中，坐在办公室吹着空调能有什么累的，确实，既然这样，我也无需解释，那就当轻松罢。 其实去年刚在一起的时候，我总觉得自己好像又可以有所依赖寄托，但最近这些事却让我又开始疑惑起来，有时候两人是否真的适合，为什么很多事我还是感觉只有自己一个人，她向我提出问题后，希望我解决，转身望了一眼身边，好像无人可寻求帮助，大多时候不知所措，有时候感觉自己好像还是比较适合一个人，一个人上下班，一个人吃饭，喝酒睡觉，熬夜通宵，使劲作死，无需顾虑过多。 自己也曾有过很不负责任的想法，如果不结婚的话，及时行乐，做一切想做的事，工作时尽心尽力，放假时随处漂泊，偶然心血来潮也可以立马购买机票飞去青岛，即使只为了喝上一匝新鲜的啤酒，任性人生。给父母存一笔钱，等到年龄渐长如若觉得人生无趣或是玩的差不多了，也就此罢了便也不虚此行，想来应该也是快意人生。 其实，从好久以前开始，我就从不惧怕一个人，见过黑暗，受过苦难，人生，不过如此。 三点多了，没想到刚好线上机器有问题告警，顺手解决，吐槽完毕，明天继续，洗漱休息。 2022-05-06 晴 明明前两天订婚了，但似乎距离好像更远了，当来杭日期定下来似乎她又开始焦虑，我不记得这是多少次了，渐渐我也开始思考两个人在一起的合理性。当初是为什么会突然在一起，是为了以前分开的遗憾，还是真的想在一起。其实当初知晓她计划在龙岩考公务员的决定后，我尽量让自己仅抱着祝愿心态不再干预她的生活，因为自己的职业也不会回老家去，所以两人最好不要再有所交集，但没想到，最后还是莫名其妙就在一起了，但在一起后，她经常纠结两人必定有一人需要牺牲，杭州陌生的城市，人生地不熟，开始焦虑，很多时候我都思考，感觉自己没有给她足够的安全感，这次回去她也好几次提起，甚至以后因为自己工作的缘故，可能都没有时间陪她一起吃饭，突然开始感到很纠结，以前和她在一起的时候可以好好陪着她，带她一起好好学习，一起努力，感觉自己对她来说很不可或缺。现如今，似乎倒成了一种累赘和必须在家人朋友之间做出选择的两难。 我不喜欢让人选择，成为别人焦虑和负担，提出可以继续待在龙岩的法子，甚至于以后如果可以遇到更好的，也可以和他在一起，如果我没办法好好照顾你，也许别人可以，那这样，我想，我也可以接受吧。以前其实没有我的日子，你也过得很开心，我并不是什么不可或缺的存在，大学至今这些年，感觉自己成长了很多，以前似乎总把自己看得太重，甚至于好像地球都绕着自己转，经历多了，也就这样罢了。其实自己这些年一个人早就习惯了，上班下班吃饭睡觉，病了就自己拿点药，心情烦闷就喝两杯，没什么大不了的，生活不就如此而已。 即使真的被放弃，只要她能过得好，我便也毫无怨言了。深究内心，确实很爱很爱她，如果换成以前的自己，似乎一定要得到才能够感觉拥有，但现在好像即使真的她不在我身边，有别人陪着好好对她，她能真正开心，自己也就满足了，至于自己如何，按照以往的生活过着，自己一个人摆烂，似乎真的无所谓了，好像很久之前已经学会如何取悦自己，所以就算再多不顺，也能坦然释怀，人生不过如此。 2022-05-14 小雨 傍晚时又因工作的事错过点饭时机，反应过来时已经快七点，想着手头有些事未做完，虽然周五，但回去似乎也没有什么事，干脆还是点个外卖送来公司吃着，处理掉事情后再回去吧。想着简单吃点便点了个汉堡，把周报以及一些数据整理为文档，毕竟周五，虽然七点多但周围已然没什么人了，挺好的。 处理完手上事后外卖也才到不久，干脆提着外卖下班回家，谁能想到五月份的天气居然如此之冷，早上穿个短袖出门实在过于欠考虑，饿急了便拿出汉堡一路吃着回去，想起这样吃饭好像也就学生时代，早上总抓着几个包子边走边吃，想着今晚周五可以奖励自己，等会要是饿了，时间还早还能再吃个夜宵。 回来后也不知道做什么，楠楠子和学姐出去玩耍，每次出去玩总也要十点十一点才能回来，想着那就自己看会电视剧好了，又因为富途扣了部分费用导致欠费，发出账户危险警告，才发现自己只能卖掉几股瑞幸来抵扣欠的十几美元，原来自己这么穷了。一直以来瑞幸都是慢慢囤起来，第一次卖掉居然是因为账户欠款没有余额还款了，想来也是有些许悲哀。 期间与老姐聊天，从她和老妈聊天中得知老爸担心自己要下岗了，应该是这些年煤矿行情也并不好，各行各业都备受打击，不过也考虑到老爸年龄也大了，下岗退休回家养老也挺好。只是想到这些，又觉得自己身上担子重了不少，感觉明明自己刚毕业才四年不到，爸妈都突然就老去了，自己也要结婚，放眼望去到处都是花销，可是收入来源却只有工资一个途径，但凡每个月有点大额支出就基本上存不下来钱，大学时还觉得上有老下有小应该是中年人才该有的烦恼，突然间，自己好像三十岁不到，突然就开始愁起来，很焦虑。 真的一刻也不能松懈，不然时间一下子就过去了，不管是持续学习还是多去思考其他赚钱的法子都是好的，就是千万别把时间浪费在焦虑上，后续还是要多花点时间做一些规划更加努力，只是最近几天想起这些事总有些睡不着，熬到一两点才缓缓睡去，正如网上所说，我们无比坚信中国会越来越好，但我们对于自己的生活似乎却根本无所期待，甚至看不到未来，有人评价，长城很壮观，但修长城的人的很累。 有时候真想感叹世道不公，凭什么上一两代人可以享受那么多红利福利，我们这代人却受尽苦楚，奔波一生只为一个鸟笼，囚禁众生。 2022-05-20 晴 大概是为了纪念这个被认为浪漫的日子吧，腾讯弄了个周董13年演唱会重映，这些歌除了记录着周董的辉煌，似乎也记录着我们的青春，听着久听不厌的各种曲调，看着那时候的周董还拥有着好几块腹肌，13年的自己还在念高二，好像一切还充满着希望，真是让人不禁怀念起来。 至今还没体验过演唱会的狂欢，不知道以后是否还有机会能参加周董的演唱会，能够带着喜欢的她，一起大声欢呼，应该会很过瘾吧。重映上的各种弹幕都是表白，也许欢快的歌声能够让本已死去的90后突然醒来，好像拉扯回到美好的青春校园里，尽情热恋。 听周董的歌没有酒大概就没有味道了吧，特意叫了些外卖，一个人的狂欢。 2022-05-30 雨过天晴 很久之前就决定了端午拍婚纱照的安排，所以很早就做好了计划，去厦门的车票机票住宿等，却没想到爷爷病情加重，情况越来越不乐观，大小便失禁，周末才把老妈送上车回去，来电说是情况越来越糟。 今早航班莫名其妙被取消，突然心里好像有一种预感有事要发生，和老妈通了电话，说是爷爷已经吃不下饭了，可能撑不了太久了，吃完饭回来便和楠楠子商量将端午计划全部取消，改成回家。下午看到堂姐发的视频，老妈一直抚着爷爷胸前，对他轻轻说着大家都在呢，有什么想说的就说，大家都在听着，爷爷嘴巴一直张着却说不出话来，整个人变得皮包骨头，好像只剩下一副架子，突然一阵心酸，不知道说什么。 大概傍晚快六点左右在公司排查一些线上问题，突然收到堂姐发了句，爷爷不在了。虽然早就做好了心理准备，从去年就知道了爷爷肝癌晚期的消息，春节回家的时候看着爷爷瘦骨嶙峋的样子，突然有些心疼，好像以前身体一直很健朗，干活也是很利索，总喜欢自己开荒种点菜或树，怎么突然就变这样了，虽然总说生老病死是人之常情，且好像早已做好心理准备，但这一刻真正降临的时候，好像还是很心痛，眼里的泪水不听话的一直流，避开人群，上厕所洗了把脸便上了顶楼，想起小时候至今的点点滴滴，和爷爷的一些事，突然意识到，从今天开始，我再也没有爷爷了，眼泪就完全忍不住了。对着顶楼的墙壁总想让自己冷静下来，可自己确实是个感性的人，很容易影响到情绪，很难快速冷静下来。 爷爷从很久很久以前就一直住在我家，以前每次回家院子里杂草总是被除的干干净净，但上次春节回去时院子里却还有很多杂草，那时候的我突然意识到，爷爷老了，老到甚至除草的力气都没有了，有一天，他会离开，这个院子会荒芜，会长满杂草，当我从外面回来时，它不再开满花朵，结满柿子，而是一地杂草。 想起寻梦环游记，那些离开的人其实只是去了另一个世界，死亡不是生命的终点，遗忘才是，我想，只要我还活着，您就永远活在我心里，爷爷，您走好。 2022-06-07 晴 前几天到家的第一件事便是老妈带我去给爷爷烧香，老爸和叔叔坐在院子里给爷爷守夜，因为丧礼的日子是几天后，所以爷爷便一直停棺在房间里，老妈对着装着爷爷遗体的冰柜说，学伟回来了，现在给你上香来了，看着冰柜，远比当初消息来的震撼，这一刻，我确信爷爷已经离开了，离开了这个世界，摆在我面前的只有冷冰冰的遗体。扪心自问从小到大对于爷爷一直孝顺，初高中上学时，每次放假总会骑车去看他，因他年轻时是老师，总喜欢看点书，所以必会带一两本闲书和一些牛奶水果，陪着他话些家常聊聊天，只不过在他生命的最后几年，一直在忙着自己结婚的事忽略了他，回家也只是匆匆几句话而已。 烧香完，叔叔进来和我一起烧纸，虽然老爸和叔叔没有说什么话，但能感觉出他们心里还是很难受。一时间我也不知道说什么，他们问我一些闲话，我也是有一句没一句的回答着，老妈端出热好的饭菜，一口一口吃着，心里不知什么滋味，晚上独自一人在阳台上隐在久违的农村黑夜里，内心杂乱，思绪各种乱飞。 晚上的时间有几次都是和涛哥熊哥他们一起喝茶喝酒到半夜，聊着鸡毛蒜皮和国家大事，从国到家，把能聊的话题基本上都扯了一遍，应该很久了，大家这样一起坐着好好聊聊天，真好。 昨天是爷爷的葬礼，生肖相冲外加明年需要结婚，所以老妈让我尽量避开了一些仪式，没有披麻戴孝，送爷爷去火化的时候也是跟在队伍的最后，一天的行程让大家都劳累不堪，从一本书中看过一种说法，丧礼把活人搞的精疲力尽大概有一部分原因是为了让他们没有时间悲伤吧，我想也许是吧。 2022-07-02 天很蓝 本来我为今天拍到了来杭州四年最好看的天气而高兴的手舞足蹈，也为了今天周五即将迎来周末而欢呼，可不幸，在蓝素素家吃完饭游泳到家十一点后又和女朋友吵架毁了一天心情。害怕回来晚挨骂还在路上就说自己到公司写周报引起的导火索，道歉之后也不管用，各种上升，他们让你吃屎你也去吗，当初是你求着我嫁给你，求着和我结婚，你去游泳我同意了吗，我让你早点回去，你说好却没有做到……我不知道为什么，每次一件小事，她都可以不管不顾，想说什么就说什么，即使这些话能让我心凉透，仗着我的喜欢，盛气凌人，一副高高在上的样子，甚至于不惜说让我明天就和我爸说可以不用结婚了，听到这些话的时候，我真觉得她并不是真的爱我，只不过想要一个听话的狗罢了，行，既然如此，如你所愿吧那就，我不想任何人随意践踏我的自尊。 相处过程中实在太过于失衡，很多时候感觉有些难受，如果你觉得和我在一起实在委屈，放弃了太多，那就罢了吧，大可不必了，是我配不上，你去找配得上你的吧，我不想自己以那么低姿态的形式和任何人相处。 晚安，阿伟，没有人可以踩在你头上骂你。nobody，任何人都不行。 2022-07-14 晒到怀疑人生 最近的新闻真是让人匪夷所思，河南储户赋红码，存款被转移银行不担责，江西业主房子烂尾集体断供，多地建大型核酸试剂生产厂，寒门学子被赋予小镇做题家的污名，好像，这世界突然变了个样，不是我认识的那般了，虽然活在底层，对于这些事什么也做不了，但总觉得，位卑未敢忘忧国，但似乎纵使再过热爱，也会被这么多事寒了心，到底哪里出了问题？天气也是持续高温，总是维持在四十多度，每天走在路上都感觉热浪一阵阵，即使是晚上九点多下班回家也依旧不改，唯有空调冷气才能不断续命。 虽然自己也过得不尽人意，但却总在操心着乱七八糟的事，上周三去姐姐家吃饭，她突然对我说，奶奶被车撞了，我真想回去把那人打一顿！一脸困惑与难以置信，倍感震惊，没想到爷爷才走刚好一个月，奶奶又出事，心里无比愤怒，深感老天不公，奶奶一生幸苦，却在老来应该享受的年纪总是备受折磨。家里传来消息是左腿骨骨裂，嘴角擦伤缝针，头上几个大包，所幸没有内伤，想着女朋友也是发烧感冒一直不适，周末回去看看她们，最后又因月底她要来，需要回去接她，外加奶奶没有想象中严重，便暂且搁置，准备月底再回去。 上周末看到伯母发的视频，看到奶奶坐起来和别人聊天了，感觉状态还可以，便渐渐放下心来，但却无心上班，心里总想着这样那样的事，回想起刚看完不久大刘的超新星纪元一书，讲到孩子们失去大人之后，按部就班在各岗位每天做着工作，由于孩子的能力和身体都不如成年人，所以针对于相同工作需要花费更多的时间和精力，导致高压过后整个社会只剩颓废与摆烂，慢慢开始像解除禁锢进入欢呼美梦时代，长久的狂欢丧失期待与理想，昏昏欲睡便进入沉睡时期，最后小领导人只好找出各种其他玩法唤醒众人，突然醒悟，现在的我们是不是也是如此，什么都变得无所谓，也就没有所谓的动力，行尸走肉，漫无目的。 近期自己似乎也是有些颓废，并且许久未阅读，只好铆足了劲几口气看完了大刘的几本书，最近又在看王小波的黄金时代，假如有人突然看到我所看到的某一章节，定要大声出声来，你竟然在看小黄书，没错，比余华的部分作品还要漏骨，看起来好像充斥着大量的粗话与低俗行为，以至于我光顾着关注这些乱七八糟而忽略了此书真正意义，或许是我功力不够，看完大半本书，却还是没理解透彻此书内容。王小波：其实我没想那么多，就是把日常写出来了，不知道你们在思考什么更深度的东西，反正我没有，别瞎说。 说起来，月底女朋友就要来了，或许称呼未婚妻更为恰当合适，想一想，认识至今已有十一年了，11年的七月底初识，没想22年七月底可以开始一起生活，说起来坎坷不断，高中在一起两年多，隔着一条河的两所学校，谈着学生时代的异地恋，只有周日下午可以一起出去公园散散步聊聊天，青涩和懵懂一起跌跌撞撞两年，最后因为自己鬼迷心窍，误入歧途，就此分手别过，后悔不已。七年间两人都经历很多，人和事，都让彼此成长不少，能够重新再来过，像极了一场浪漫电影故事，青春里本该有所遗憾，但我们好像就偏要将此遗憾误会解开，重续旧梦。 以后两个人的日子应该会过得很舒心吧，从大学开始至今，已然八年，总觉得时常一种莫名孤独萦绕着，唯有夜深人静，提着酒，听着歌，写着日记像是对一个交心好友秉烛夜谈才能轻扫一整个坏情绪，内心欢欣雀跃，脑子异常活跃，可以飞出房间，飞向天空，飞出时间线，飞回到任意让我快乐的时光片段里，总闭着眼睛感慨，所幸，以前还有那么多快乐的时光可以随时调阅翻看，独享这一刻，但曾几何时我无比慌张，因为发现这些精灵在我脑海里渐渐模糊，我快要无法再度钻入其中获取快乐，好像只剩一片茫然与花白，信号丢失，好像从那时候开始意识到，我的年龄不再是个孩子，记忆力开始下降，即使时常翻出来复习的仅剩也开始模糊，还算幸运，最后是个喜剧，总算拨开人海重新见面。 2022-09-08 秋风渐凉 打开电脑发现许久没有写日记了，一转眼又已经过去快两个月，回想起来，这两个月似乎发生了很多事，又好像没什么记忆深刻，总之现在诸多不快与欢乐都随风而去，在长久的人生长河中根本留不下多少东西，最后都要回归自然。 回想起上次回老家看到奶奶躺在床上没办法起身，说不出的一种感受，爷爷刚走，奶奶又意外卧床，就觉得好像时间流逝非常快，命运的轮子开始把身边的东西逐渐夺走，任谁也拦不住。 无休止的内耗真的好累，有些厌倦这样的生活。 2022-10-19 微冷 钱难赚，屎难吃。 有时候真的觉得好难，已经将绝大多数的时间拿去赚钱，上班或是学习，一年算下来只有少许闲暇，但似乎还是赚钱不足，想做的事做不了，还要被冷言冷语，有时候真想就这样算了，活着这么痛苦意义在哪。 起点很低，什么都要靠自己，老妈当初的一句话，让我在饭桌上差点忍不住眼泪，“爸妈没什么能力，什么事都只能靠你自己，你还年轻，我们当时像你这么大的时候什么都没有，你已经比我们当时好多了，你以后什么都会有的。”，我曾发誓，一定要证明自己，一定要靠自己让周围的人都过上更好的生活，但请给我时间，但望着爸妈日渐苍白的头发，有时候越发焦虑，我该怎么办。 日渐老去的父母，一起吃苦的老婆，无能废物的自己，似乎有时候总觉得，没了自己，一切都迎刃而解。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"22年-书","slug":"36-22年-书","date":"2022-10-17T16:06:16.972Z","updated":"2024-03-17T14:25:11.458Z","comments":true,"path":"2022/10/18/36-22年-书/","link":"","permalink":"http://yoursite.com/2022/10/18/36-22年-书/","excerpt":"仔细想一想，似乎读书这件事坚持好些年了，总会在闲来无事时翻看几本书，一来打发闲暇时光，二来填补内心修补灵魂，否则时间一久，内心总觉孤独空虚，翻看老旧照片时总能发现不少书的照片，虽然过去挺久了，但看到那些照片似乎总觉得心安，因为那时候的自己应该内心很满足吧。","text":"仔细想一想，似乎读书这件事坚持好些年了，总会在闲来无事时翻看几本书，一来打发闲暇时光，二来填补内心修补灵魂，否则时间一久，内心总觉孤独空虚，翻看老旧照片时总能发现不少书的照片，虽然过去挺久了，但看到那些照片似乎总觉得心安，因为那时候的自己应该内心很满足吧。 变身——东野圭吾 —— 如果我的意识渐渐消散，那我还是我吗？ 主人公为了救一个小女孩，被歹徒用枪击中头部，随后被进行半实验半学术的手术将一部分脑器官换成了别人的得以幸存下来，但他却在恢复后似乎渐渐丧失自己的意识，被移植的脑控制，性格也是一改如前，从一个温顺的小猫变成了凶猛带攻击的猎狗。不止自己，周边人都感受到这种变化，彷佛自己的善良渐渐消失，开始朝着一个凶残暴戾的影子演化，内心感到恐惧和害怕，但似乎又控制不住，自身意识渐渐落败，身体好像要慢慢被控制。 如果自己是男主，是否最后也会像他一样用一颗子弹结束生命，还是任由自己完全变化为另一个人，被脑子中的另一人格支配，细思极恐，我想，如果有一天我的意识消散死亡，那就当我也死了罢。 圣女的救济——东野圭吾 —— 我那么爱你，所以，如果当你选择离开的时候，那请你去死吧。 我不清楚女主是否爱男主到无可救药还是只是享受这种把控自己所爱之人生命的感觉，开场几分钟男主就因出轨中毒身亡，书中所有描写都将嫌疑朝女主身上引，但即使一直读下去，却也找不到任何证据证明女主的作案手段，读者也是各种猜想，百思不得其解，甚至觉得作者只是故意诱导读者偏离。 女主漂亮贤惠，无可挑剔，身亡的男主对女性的见解与认知却很独树一帜，因原生家庭缺失的他渴望拥有自己的孩子，但却不想要妻子，因为他认为只有孩子才与他有血缘关系，但妻子只是个生育工具，所以，与谁结婚并不重要，重要的是谁可以很快帮自己剩下一孩子。每当与其他女性在一起的时候，总是给定期限，如未怀孕便会作罢，对于彼此的相处只是当成了一笔交易，诚然，他的物质条件优秀，各方面无所挑剔，但却对于爱情和婚姻过于儿戏和极端。 大概所有女生和男生在一起时总会觉得自己是个特例，所以即使男主在抛弃自己的好友，使其自杀身亡后，女主也宁愿自欺欺人和他结婚，却不想男主向他提出结婚一年半如果没有孩子就离婚的约定，女主一瞬间是惊讶且愤怒的，但聪明的她立马便冷静下来且答应了他的条件，从那时起就设计了如果一年半后男主敢背叛就杀了他的计划，将毒药藏在净水器中，一年多来，小心翼翼守护着丈夫，防止他使用过程中引发中毒，文中描述女主享受这种将丈夫生命握在手上的感觉，就像把两人的命运都握在一起。 当男主和女主摊牌因一年半到期没有孩子要离婚时，他其实便将自己推向深渊，女主离开家几天，男主使用净水器使自己中毒身亡，很是完美的犯罪，别人的犯罪是做了什么将自己隐藏起来，女主却是什么都没做，只是离开丈夫就好。 最可怕的当属人心，看完之后唏嘘不已，如果自己被一个很爱的人丢下，现在的自己大概会及时行乐，只要不伤天害理就把一切丢掉，潇洒自在，把以前一切想做却又没做的事都去做了，待到玩够便安心收场。 #####白鹿原——陈忠实 —— 历史就像一股洪流，不管好坏，最终大家都要被其携带着奔向远方，滚滚而来，淹没一切，任由你如何反抗逃避都无法逃脱。 对于这本书其实应该早有耳闻，但电视剧和短视频更先进入到我的世界，一大片高粱地，田小娥骑着驴走在路上，一脸骄傲。 此书前半部分充斥着大量让人面红耳赤的场景，对于那个年代庄稼汉的描写简直深入到骨子里，任一片段流传出来都容易被人鉴别成从哪个不正经网站扒下来的小黄文，生活确实如此，无限贴近写进书里初识容易让人觉得粗鄙，但我却一直奉行，大俗即大雅的观念，余华的《活着》、《许三观卖血记》等亦是如此。 也许有人会觉得，许多小说中充斥着大量的暴力、粗鄙之言亦或欲望和不堪简直侮辱了文学，许久以前，我在写东西的时候也总是避免使用一些不雅的词语，尽量采用优雅文艺的风格，但有时候却过于飘渺和虚无，因为优雅不适用于生活在底层的各色人民，并不是所有的人都有诗和远方，其实我们大多为俗人，生气发怒时张嘴便是粗话，也为一日三餐奔波劳碌，只不过我们忘记了罢了。 白鹿原的时间线从清朝开始到新中国建立，讲述了白鹿两家几代人的纷争，但在历史的洪流中，其实就像是一颗小石头砸进水中，除了溅起一点小水花之外，毫无波澜。感触最深的大概要属每个角色波澜起伏的人生，整书充斥着人性和欲望，左右一直印证一句话——“乾坤未定，你我皆是黑马”。原上不是秋风压倒东风就是东风压倒秋风，没有人一直占着势。 白嘉轩一直活着良心无愧，腰板挺得很直，但却被人打断腰身最后驼背，引以为傲的大儿子孝文彬彬有礼又博学多才得以继任族长却不料因一女子自甘堕落，沦为烟鬼变卖家产流落街头成了乞丐，最后又摇身一变成了滋水县县长。黑娃也是从庄稼汉变身革命者，再到土匪保卫团多重角色中来回切换，本以为最后终于能落个好下场，却不曾想功劳被夺，秋后算账后丢了性命，其他人的命运也是如此，就像夏天的天气一般，难以说定，谁也不知道明天醒来谁走了运当了官，谁又丢了脑袋。 上天似乎喜欢玩弄世人，夺走你所爱，在你伤心落魄时又突然赐予厚恩，看着你喜怒之间来回切换好像是一种乐趣，这大概就是——“祸兮福之所倚，福兮祸之所伏“。这些年自己与身边人的经历也确有所感触，没人可以一直笑，也没人会一直哭，似乎每个人生都是喜忧参半，没有必要为了不顺的事怨天尤人，也许下个转角就轮到你走运了。 麒麟之翼——东野圭吾 —— 也许只有问心无愧地活着才算是真正活着，坦然面对一切便是对自己这辈子最大的负责任。 故事起源于一名中年男子被刺伤后靠卧死在带翼的麒麟像下，警察调查抓住了另一名可疑无业的男子，从其身上也搜出受害人的东西，并且牵扯出无业男子曾就业与受害者部门，因受伤无法继续工作导致被开除，男子也因为丢失工作导致生活困难，快要无法生活。一切看起来作案动机，物证都齐全，案情简单到好像就可以直接下定论，单纯的仇杀抢劫。但既然是东野圭吾的小说就不可能会有如此乏味的剧情，层层抽丝剥茧，牵扯出受害人遇害前一直徘徊在各种神像前，折着千纸鹤似是在祈求什么。 剧情总要转折，调查慢慢指向了受害人儿子三年前学校一学弟溺水导致其变成植物人事件，原来父亲在偶然之间知道了儿子与此事有所关联，一边联系儿子学弟家属，并且默默为其祈求保佑，另一边也约出其他人了解事实真相，想要他们自己承认当年的错误，但却被不想暴露罪行的另一人捅中要害，父亲就连最后中刀后第一时间想的也是去那个带翼的麒麟像下，为的便是告诉儿子悠人，不要因为害怕而逃避，要像带翼的麒麟一样重新出发为自己的错误而赎罪，最后悠人在了解到父亲的良苦用心之后，决定与朋友一起承认当年的错误罪行，至此，故事结束。 是人总会犯错，也许一时可以逃避现实，但良心总在做祟，没有放下便会像心中悬着一颗石头，时刻惦记。 告诫自己，勇于承担自己做错的一切事。 球状闪电——刘慈欣 —— 人总要有一件一生为其奋斗追求的事，不然该多无趣。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"书籍","slug":"书籍","permalink":"http://yoursite.com/tags/书籍/"}]},{"title":"21年-书","slug":"34-21年-书","date":"2021-03-15T15:02:57.734Z","updated":"2024-03-17T14:25:23.417Z","comments":true,"path":"2021/03/15/34-21年-书/","link":"","permalink":"http://yoursite.com/2021/03/15/34-21年-书/","excerpt":"翻看历史，2020年居然没有记录一本书的读后感，深感惭愧，忙于赚钱，疲于奔命，丢了初心，现还是将其拾起来。","text":"翻看历史，2020年居然没有记录一本书的读后感，深感惭愧，忙于赚钱，疲于奔命，丢了初心，现还是将其拾起来。 从你的全世界路过——张嘉佳 —— 人生如旅，你我皆过往，从你的全世界路过大概是我一辈子的遗憾。 看完云边有个小卖铺，爱上了张嘉佳，转身就将这本书加入了书架，说起来这本书早已被演绎成了电影，之前偶然一次打开电影，只是看了前几分钟就关掉没有继续看，大概原因或许是感同身受，瞧见了当初一样自暴自弃的自己，自甘堕落，好像把自己弄得一塌糊涂就可以让别人回心转意，其实只会让别人更加瞧不上自己，可怜兮兮，像一条没有人要的流浪狗一般。 因为提前看了书的部分内容，所以感觉电影也应该不至于太烂，评分也还不错，便就继续看完了，和小说有些许不同，但整体风格一致，总觉得张嘉佳和大冰写作风格相似，洒脱不羁，风风火火，文字中总是大大咧咧却又藏着细腻的感情，悄悄触动人心最敏感部分，惹人眼泪。 云边有个小卖铺赚了不少我的眼泪，从你的全世界路过，书名值得回味，是啊，人生似旅，要么你从我全世界路过，要么我从你全世界路过，就算驻足，也只不过是时间问题，最后的结局无非还是自己一人。在张嘉佳的故事中，总有一方一往情深，即使分开，也是念念不忘，或是有所回响，或是就此终了，深情的故事总是让人嘘唏不已，分开似乎并没有那么和平，总有一方算是被迫答应，表面上满嘴答应我很好，我没事，你要好好照顾自己，但很多却只是为了不耽误，你要走，我又怎敢强留。 说起来，小说总是源于生活更高于生活，回想起一优秀到极致的发小曾也被多年异地女朋友在某年生日那天丢在喧闹的街市，留下一句分手便招呼出租绝尘而去，任由扬起的一大片灰尘落在他心上也难盖住那颗受伤的心。分手时，他只问了一句话，你离开后会过得更开心吗？是啊，如果你离开我可以过得更加开心，那我又该如何强留，大概是铁了心要离开，我想象不出当时对方以何种决绝的口气说出会后就立马转身离开。那个生日，那个深夜，本该是狂欢到天亮，却不曾众人都寻他不见，只将自己偷偷藏在空无一人的教室喝着酒，弹奏吉他到鸡鸣日升。 从那之后，总感觉他的少年气不复存在，眼中的光也没有了，曾经那个无所畏惧仗剑天下的少年眼神开始暗淡，我不清楚那个深夜他到底经历了怎样的蜕变，虽然之后也还是可以看到他嬉笑玩乐，但似乎总缺了一些东西，说不上来，但总能感觉到。 自那之后他也换掉所有联系方式，仅留几个挚友，在其他人世界中消失，让许多人都寻他不见，大概这就是他的治愈自我方式，关起门来，静静安养。他曾和我谈及，当初生日那天初见时有多么惊喜，听到分手消息时就有多么惊吓，我确实不知该如何安慰，只能半天缓缓吐出一句，没事儿，会过去的，也许时间久了就好了，他反问，时间久了真的就好了吗？我一时语塞，心里暗暗道，应该可以吧。 别人说再多也是无用，终究还是要自己想通走出，从那之后，他似乎更加投身于学业，那年夏天很热，蝉声依旧如十七岁那年一般响个不停，他似乎也只悄悄回来几天便又悄悄遁去。我想，那种感觉应该很难受的吧，很想找他一醉方休，一起替他骂骂这混蛋世道和捉弄人的感情，但却又没机会，那时候突然觉得，这世界，原来也没有那么值得让人深情以待。 一年后，某天他的朋友圈，类似爱情的字眼重现，询问之，他说她回来了，就和当初突然出现在他校门口一样出人意料地突然出现在他的家门口，依旧是简短的一句问话，和好以后，你会比以前开心吗？他似乎一直都是这么一两句简短的话来转折人生关键节点，大概是情绪突然上来，所有的话都汇聚成了一句，总之，无谓自己，只要她能够真正开心便行了。 深感不值，但还没来得及说什么，他便拿话堵住我的嘴，我知道的，如果是你，你也一定会答应的。是这样吗，心里一时竟也想不出答语，行吧，你作什么决定我都会支持你，只要你真正开心就好，也希望这次她不会再轻易把你弄丢在人海。其实从那之后，对于他们的爱情，我总觉得没有当初那么纯粹了，我知道他一直在原地等候，但却不清楚她是权衡之后的择优录取还是依旧情深难忘怀，也许以后我会再续写他的故事，但那时候我想应该会以他的风光和洒脱为主，而不是在爱情里的深情，因为本在我心上闪着光的他，在那段时间因此暗淡了不少，当初我也更希望当初他会骄傲地昂起头，不转身地朝前一直走下去，既然曾经路过了她的世界，就不要再驻足了。也许人缺什么就羡慕什么吧，既然如此，我希望他后面只会最后问她一次，那时候的他应该在众人欢呼起哄声中，单膝跪地，深情问她，和我结婚，你会比以前更开心吗？ 会。 白先勇细说红楼梦——白先勇 —— 人生皆空 讲起来初读红楼至今已经七年了，七年，一转眼，高中将要毕业时红楼爱不释手，每日课间也不与同学打闹，也不趴桌子睡觉，只捧着红楼细细阅读，我也说不上来吸引我的到底是什么，众人的狂欢是否像极了当初自己与朋友，离散离合又与当初我们的结果出奇一致。 先来谈谈初读红楼的感觉吧，最开始大家初识，都说人生若只如初见，初见总是最美好的，彼此之间不够熟悉，所以有距离感，透过距离又产生了各种想要探究的美好。刚开始觉得宝玉确实是个很幸福的人，被众人捧在手心，总是被所有人围在中心，即使灵魂也有黛玉陪伴，总不孤单。但似乎人生或者故事总是如此，人这一生的运气总是有一定的量在那里，如果提前花光了，那后续就只能接受各种逆境了，以前自己也是个很幸福的人，至少现在看来，算是巅峰了，发小曾在一次我生日时对众人说，真的很羡慕阿伟，不管何时何地，身边总有一群好兄弟会陪在他身边，那时候自己内心也确实很满足，各种友谊完全充满了我的内心，丝毫不觉得孤单和寂寞，不管是做什么傻事，总有人会陪在我身边，所以即使我经常穿过乱葬岗边上的马路，也丝毫没有一点畏惧，因为我内心还有太多太多在支持着自己了，不管何时我总觉得自己不会是孤独一人。 总说越长大越孤单，我不清楚别人是否如此，但我确实，眼看着身边许多人渐渐消失在我的世界中，当我伸出手去挽留，才发现抓住的是一些长长的影子了，任凭我在混沌中如何追逐都赶不上他们的脚步，他们也对我不再热情，语气冷淡到好像就从不认识我一般，许多时刻我总在怀疑自己是否做错了什么，导致自己后面境地至于此，几年之后才在一朋友的回答中找到了一些答案，如今这社会，维系关系确实难，而且一旦疏远了，也就懒得再重新培养了吧。是啊，人生匆匆，谁也不会在谁身边一辈子，其实回想起来高考前那些日子，身边还是围绕着很多人，每日总有人去空间留言打气，想来那时候的自己已经很幸福了，但大概总觉得他们总会离去，就像红楼的结局，最后都是飞鸟散去，一片白茫茫大地真干净。所以那时候就开始伤感，总觉得后面的自己大概也会像宝玉一样，跟着一僧一道飘然而去。 其实如果没有经历过聚合，就不必担心离散，如果曾经没有拥有过，就不会那么害怕失去，但当初的自己实在是拥有太多了，总觉得这一切，上天给予的总有一天要夺走，所以患得患失，忧心忡忡，记得当初因为一些事崩溃，狠狠抱住某人，哭泣着说，我现在只有你一个了，你以后要是也离开我，那我就真的什么都没有了。答案很肯定，我永远都不会离开你的，但最后终究还是食言了，丢下我一人，将所有一切都绝情带走，我不清楚自己是不是真的一无所有，但内心，当初应该是了。 当初对于红楼的感觉还只是停留在情感上，无非纠结就是应该选灵魂伴侣林黛玉，还是为人处事、从各方面都适合做妻子的薛宝钗，那时候的自己还是以感觉为主，总觉得如果是娶妻子过一辈子的话，必然要找一个自己喜欢的，宝钗固然无可挑剔，但似乎相处过程太过于持重理性，总是压抑自己的情感，唯有黛玉才是心中理想。 总说红楼梦过一段时间读起来，总会有不一样感受，随着阅历的增加，看完之后感觉又不一样了，大概原因就是关注点不一样了吧，这次将赏析看了一遍也等同于重读红楼了，感觉很不一样，似乎没有当初的感情波动那么大，对于贾府的衰败和众人的离散好像也没有太过伤感，好像已经将其归咎于天命，总觉得人生总要经历这种过程，从开始的孤单到众人的狂欢，再到最后谢幕，众人分散离去，必然是所有故事或者人生的结局。我还是搞不清楚到底是因为好聚好散，珍惜每一段相遇相识，还是从一开就避免这一切会更好，就像顾城的诗，你不愿意种花，因为你不想看到花儿一片片凋谢，因为害怕结束，所以避免了开始。 以前的自己似乎比较洒脱，不害怕离别，大概是觉得自己能一直很好，身边的人总有替代品，但后面突然发现，好像不再有了，回过头时发现周边除了一片漆黑之外再无一人影，那时候我才知道，原来，只是我以为。 盛夏方程式——东野圭吾 —— 如果这世界没有让你奋不顾身的人或者事，那可真是太悲哀了，但如果有，我想，也许献出一生也会觉得值得吧。 你有没有为谁奋不顾身过？细细回想，我也曾拥有过让自己奋不顾身的人，只不过最后被我弄丢在人海。东野圭吾的书似乎总是跳脱不出为了所爱献出自己一生的故事影子，跟他自己的经历或许有所关系吧，所以在故事中总是可以看到类似的剧情，盛夏方程式也是一样，父亲对于自己的女儿，宁愿顶罪在牢狱之中度过自己一生。但想来，现在的自己却变得无比自私，不想再为谁拿出自己真心，更别提什么所谓的献出自己一生了，或许是发现很多时候所谓的真诚并没有得到反馈，或许还会对别人造成困扰，我想，其实别人也不希望你为她献出太多，毕竟没有人愿意亏欠别人，很多时候或许你只是感动了自己。 既然如此，那便自己好好过好自己的生活，我想就可以了，相处保持距离，彼此互不相欠。 我不知道该说什么，关于死亡还是爱情 —— 来自切尔诺贝利的声音 —— 我不惧死亡，又害怕死亡，我渴望爱情，却又害怕爱情，我想人生总是处于这样的矛盾状态中。 我一直觉得日本遭受核攻击是罪有应得，所以并不会可怜同情什么，那个丧心病狂的民族在中国犯下的滔天罪行远不是两颗核弹可以赎罪的，但对于切尔诺贝利的意外，由于之前接触的资料过少，所以也没有过多的感触，但读完这本书之后，感触颇深，说来惭愧，这本书历时许久才算完整看完，断断续续，这本书通过从各个职业、年龄的人民对于切尔诺贝利事件看法自述整理而成，小朋友疑惑为什么父母会带自己逃离家乡，他们舍不得家乡的花草树木，小猫小狗，甚至是那个丢在院子里的洋娃娃也想一并塞进箱子带走，但似乎所有东西都被抛下，看着自己的房子被拆除，掩埋，任凭他们如何哭闹似乎都无济于事，依旧发生了，新村子，新学校里的小伙伴们听说他们是切尔诺贝利来的都避而远之，说他们是亮闪闪的人，到了晚上会发出诡异的绿光，视其为怪兽，我无法用言语去形容孩子所受到的伤害，他们明明什么都没有做错，但似乎世界就是如此不公。 突感前苏联还是很强大的，不管是个人信仰还是整体民族力，即使发生核泄漏，所有军人依旧奔赴战场，其中包含了几个军人的自述，从其文章中可以看出他们深爱自己的国家和人民，虽然不清楚具体情况，但即使最后受尽辐射折磨也依旧无悔，对于使命和责任的看法似乎已经重于自己性命，每日接受着远超安全系数的辐射量，唯一乐趣大概就是伏特加为伴。 许多老人觉得奇怪，明明一切如旧，但总有军人在劝他们离开这里，他们不懂什么是辐射，不清楚这里到底发生了什么，花还是依旧开着，树木也是常绿，根本没有意识到灾难的降临，所以不愿离去，即使真的发生什么，他们也不想再离开这里了，似乎要与自己的破房子相依为命。难以想象，本可以安享晚年，落叶归根，却看着大家都背井离乡，视鸟语花香的故乡为洪水猛兽。 故事最后讲述了一个军人被应征去打扫切尔诺贝利，最后整个小队无人幸存，归来时就像什么都没发生一样，似乎只是以往那样出行一样简单，但不久辐射的危害开始在身上显现，身体内细胞开始癌变，队友们一个接着一个死去，而他也开始身体出现问题，由内而外，由内至脸部，脸部开始坍塌，身体开始变形，当医生和护士听闻他去过切尔诺贝利，没有一人敢靠近他。扁桃体肿大，变硬，最后手术切除，喉部用管子代替，没办法进食，妻子只好通过注射器将食物注射到他胃里，妻子的自述中所有的细节，点点滴滴都是对于他的爱，不管你变得怎么样，我也会一直陪在你身边，只要你活着就好。虽然很艰难很艰难，但我似乎看到了爱情最美好的样子，两个人相互依靠，缺一不可，虽然最后他还是离开了，但彼此至少曾爱得轰轰烈烈。 死亡，所有人都会面临和经历，只不过似乎现在与我们还是很遥远，但近些年来，似乎很多时候意外总在身边上演，所以，每一天才应该倍加珍惜，活的精彩。爱情，我本想着这世界哪有什么爱情，对于很多情侣或是夫妻都不羡慕和期待，因为诸多事情，其实在我看来，彼此不过是相互择优或是没有更好的选择的妥协罢了，当然，我也不敢高看自己，因为自己也不配，但确实很羡慕牧马人与山楂树之恋中的感情，纯粹，简单，彼此见面眼里都是光，我想，那才是真正的爱情吧，我以前不敢奢望自己可以拥有，但现在，也许真的可以有。 所以，如果拥有，我想用一辈子去好好守护，一定不弄丢了。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"书籍","slug":"书籍","permalink":"http://yoursite.com/tags/书籍/"}]},{"title":"21年-心路历程","slug":"33-21年-心路历程","date":"2021-01-01T04:07:27.473Z","updated":"2024-03-17T14:22:11.110Z","comments":true,"path":"2021/01/01/33-21年-心路历程/","link":"","permalink":"http://yoursite.com/2021/01/01/33-21年-心路历程/","excerpt":"莫名其妙就跨年，来到了2021","text":"莫名其妙就跨年，来到了2021 2021-01-06 晴-冷 今晚似乎又要开始降温了，元旦回来周围好多人都已经感冒，开始戴上口罩，流着鼻涕身残志坚地上着班，所幸我当初有些咳嗽的时候，立马多喝烫水，就着999颗粒早早把感冒扼杀在了摇篮里。21年的开局算起来应该很不错了，基金一路飙升，12月底和1月初莫名其妙就赚了一万多，看着存款一天天水涨船高，有时候很是激动，但竟然不知道与谁分享，突然觉得很惨。前两天站会时，同事参加完上层会议回来透漏，公司在明年应该会上市，纳斯达克，心想，这要是真的，以后沙县小吃鸡腿套餐饭就能卤蛋自由了。 总算在今晚把技术分享做了，为了这次分享，特地把Dubbo的书二刷，记了一些笔记之后又三刷做了ppt，总算整体来讲，自我感觉良好，不过感觉自己对于技术还是知之甚少，很多方面深入太少，似乎都只停留在皮毛，还是得多花点功夫下去。很值得高兴大概就是组内能有浩哥大佬，时不时提点提点，提出的建议总是一针见血，受益颇深。但也压力颇大，还是要持续学习不能荒废。 2021-01-21 晴 卫健委又发详细政策，大概意思就是尽量留在工作地过年，不然就是核酸等一系列流程，高情商官方通知。记得小时候从没考虑过有一天会在外面过年，但这次为了避免麻烦，感觉也想留在杭州过年了。家里除了几个亲戚，似乎同学、发小、朋友好像联系也很少了，大概早就忘得差不多了，其实挺可笑的，一开始也是自己率先逃离，最后又惋惜起来，真是可怜人必有可恨之处。总之不管是我先走还是他们先走，最终结果一致，那就是大家渐渐还是疏远了。感情这东西，大概最难的就是旧情复燃，明明当初上厕所都要拉着一起的人，却不曾想几年后，迎面走来都只能尴尬地当作相互没见到。 但如果我不回家，老妈又想着回家过年，让她自己一个人回家又有些担心，想到家里爷爷奶奶和老爸，又觉得自己不孝，不知从什么时候起，感情变得越来越淡，明明自己是个感情丰富的人，却像一个破裂的瓶子，渐渐流失掉很多本珍贵的东西。不想自己变得冷漠无情，但又不想自己感情过于丰富导致许多事总受其影响牵绊，大概是受够了深夜的苦酒滋味，突然似乎陷入了两难境地。一方面希望自己无情一些，另一方面又希望自己不丢掉本心，得失之间总徘徊犹豫。 2021-02-01 阴 莫名其妙被拉进呼和浩特庆功宴的群，躺了一顿海底捞，话说今日总觉得吃了一顿饭，开了两趟会就结束了，一天真是嗖的一声就过去了，不知道为何今日突然想起自己二十六七岁了，竟然就要三十了，都说三十而立，然而总觉得自己没有什么成就便将青春送了出去。罢了，大晚上不适合矫情伤神。 2021-03-04 晴 最近着实有些忙过头了，加了两星期的班，动不动就是十点十一点下班，累的要死，每天休息之后也还是没能缓过来，为了支持新机房上线各种问题，算是呕心沥血。天气开始转暖，春天突然就近了，一年年好似越来越快了，前段时间收到消息听说爷爷生病住院，目前还在检查，一时间心里不是滋味，很是复杂，生老病死，任谁都无法躲开。 我们逐渐长大，父母长辈逐渐老去，越感世界的残酷，因为之前躲在长辈身下，总能避过许多风雨，渐渐长大似乎要开始反转，想要将他们护在自己身下，但却背井离乡，根本也没有尽到小辈该有的责任和义务，有时候觉得自己确实是过于自私自利了。 2021-04-08 晴 二十六的生日，没有过多的仪式，下班之后从公司赶去姐姐家一起吃饭，小外甥初次见蜡烛上跳动的火焰居然顿时吓哭。生日，想一想，好似以前还能收到挺多祝福，如今不过尔尔，也是，成年人没那么矫情。 没有过多的感觉，就是觉得，自己好像年纪大了，在抖音上看到一个梗，二十五岁应该拥有多少存款，想了想自己如今二十六，大概十五万的存款，除了吃饭似乎做什么都不足够。有情侣拍摄，男生说自己已经二十五岁了，女生温柔回复，应该是你才二十五岁，未来一切都还有希望。是这样吗？其实内心我也总觉得自己好像还充满希望，但又总觉焦虑，好像年龄越来越大了，父母渐渐老去，但自己似乎还未能挑大梁。 上周老妈牙疼检查，发现两颗蛀牙一颗坏牙，暂时先补了两颗，另外一颗需要拔掉种牙。想着这周末就带她去做了，但老妈听到种牙需要一万多一颗，在餐桌上连连摇头，不拔了，不碍事，等后面自己就掉了。听着很心酸，我也从没想过需要省这些钱，只觉得只要他们好就行了，但认真想起来，刚好差不多可以顶我一个月工资了，也难怪老妈会有这些想法，归根结底还是自己无能。在带老妈去做检查和治疗的时候，老姐也一起去了，那时候她感触颇深，如今的她就是妥妥的上有老下有小。生活总会把我们逼着长大，那些风雨总归需要我们来替长辈们承担，如今呵护我们的那些臂膀渐渐老去，但总觉我们的身体也弱不经风，似乎总担心自己扛不住所谓的生活风雨，担心后背的亲人们淋湿挨冻。 这几天刚好又被组长安排申请了面试官，旁听了浩子大佬和能力不错的候选人神仙打架过程，又深深感觉到自己对于技术理解的程度实在是过浅，今天有幸也作为一实习生一面面试官，面试开始前甚至比候选人还要紧张，本以为简历这么优秀，对方应该对答如流，却不曾想实在有点与期待不符。明天是一个三年工作经验的二面，和自己同年毕业，突然又开始有压力了，还是应该持续学习，保持竞争力，也才有能力去面试别人。总是能在松懈的时候经常获得一些压力和机会，就像被抽了一鞭子，老牛又开始缓缓走一走，还是希望自己后续可以更加主动一些，跟上步伐，达到自己想要的成就。 2021-04-12 晴 老姐突然找我说起了周末老妈哭的原因是因为我们要带她去拔牙，她觉得花我们太多钱，突然心里很不是滋味，也许在老妈心里，可能越发感觉到自己慢慢老去，好像不再是以前那样，能够替我们负重前行遮风挡雨，而是我们长大，她也好像没办法在替我们做些什么，似乎渐渐成为了我们的拖累，也许在她心里，一万块要是换成纸币毕竟是一大杳，光是拿在手上都觉得沉甸甸，没想到竟然只为了自己一颗牙就要全给出去。 发现自己是个很感性的小男生，只要身边的人受委屈，便会觉得很心疼，总想将自己所有都给他，总想着自己能天下无敌，替他们抵住生活的苦，不忍心看到他们伤心难受，那些我爱的人以及爱我的人总是让到感觉到自己的无能，好像自己永远不够努力和优秀，如果可以，很多时候真的愿意替他们扛住这些悲伤和难受，只希望他们可以开开心心的。我不是什么圣人，只是可以希望一直守护自己身边的人，如果可以，真的都给我一人承担吧。 做人好累，有时候真想做个单细胞生物，每日吃喝拉撒就好。 2021-04-13 晴 似乎最近一直提不起兴趣来，各种杂事也搅得我心烦意乱，不知道以何种表情面对这个世界。其实一直以来都在思考，究竟人活着的意义在哪，感觉很久以前我就找不到自己活着的意义，所以总是感到迷惘，不知道该做些什么，也不知道该怎么样才能让自己高兴快乐起来，偶尔短暂的欢笑之后似乎只会更加地难受，总是在深夜听着歌喝着酒，浑浑噩噩睡去，迷迷糊糊一天又一天翻过去。 有时候看看书可以让内心得到一些充足，但书中故事又总让我心情跌宕起伏，总觉自己就是剧中人，好似经历了一生，只得一声长叹才足以舒解心中的烦闷。就像是当初看完云边有个小卖铺，代入感太强，以至于最后外婆离去，球球住进孤儿院，程霜去世之后感觉自己也像是跌落悬崖，心里再没有可牵挂的东西和人，和刘十三一样似乎被这无情的世界抛之脑后，心里异常难受。就像是自己经历了刘十三的一生，内心深处孤独至极，唯有一口灌下啤酒长长叹出一口气之后才能好受一些。 今天回来路上想到了死亡，自始至终死亡对于我来说好像都没那么恐惧，虽然我会恐高，会害怕打针，害怕灵异事件，但不知道从何时起，我好像就不再畏惧死亡。总有难过的时候会想起，要是能够突然发生意外死去，该是一件多好的事，不，我不能死，我还有父母和姐姐，如果我突然去了，他们应该会很难过吧。并且总觉得他们好不容易将我拉扯大，要是我突然离去，他们该怎么度过以后的日子。要是他们能将我遗忘该多好，我也是突然离去，从这世界消失了，但我又希望他们记得我，至少那些我在意的人可以在一段时间内记得我，想起我时会难过一会会，至少让我知道自己还被人惦记着，这样的意义或许我就会觉得很开心了。 生活无非就是生下来活下去，但生下来我们没办法选择，活下去却是必须要坚持的事，至少为了我们在意和在意我们的人也要努力地活下去，但听起来很简单的事，我总觉得对于自己来说好难，归根结底就是目前的自己根本不知道活着的意义，我不清楚日复一日的耗着，又没办法开心快乐，这到底算什么。曾经那么多，那么在乎的人，总觉得可以做一辈子的挚友，但总在莫名其妙中丢掉了，徒留自己一人，恐惧到自己再也无法正视生活的黑暗，好像除了被子外都是黑漆漆一片，不敢冒险，不敢漏出头来。 似乎自己总将快乐寄托在别人身上，精神总需要别人来支撑，只有为了别人才会好好活着，否则就会浑浑噩噩，突然想到一个很恰当的比喻，大概就是小黄人，没有了老大之后什么都提不起兴趣来，以至于最后差点整个族群都灭亡掉，其实自己已经很努力地将重心从别人那转移到自己身上了，但却总是做不到，经常一人时候喝着酒苦笑着，不知道是在嘲笑生活还是自己。 2021-05-10 晴 一转眼已经过完五一了，因为疫情算起来已经一年半没有回老家了，和姐夫一家开车回家，因为二号才走，所以一路通畅，狂飙十一个小时到家不觉累，看到许久未见的堂姐堂妹，感觉异常亲切，家里的院子里长满了杂草和小花，唯一能想到的就是满园春色关不住了。爷爷的背越来越弯，岁月的痕迹在他身上刻的越来越重，一时间心情复杂。 家里的亲戚朋友依旧热情，似乎农村和城市的区别在这一刻之间感觉到异常明显，在城市里即使是合租在隔壁几年下来也不会多说一句话，但农村，只要是一个村，见到了似乎总能瞎扯几句，这次回家对门老奶奶问我是不是带老婆或者带女朋友回来了，回答说没有女朋友，没想到她居然说我又在骗她，过几年孩子都带回来了，吐槽一句之后便转身离去，留下一脸懵逼的我还留在原地不知所措。 在家的几天无非就是蹭吃蹭喝，带着姐姐妹妹到处玩，只是有了小外甥，凡事都要考虑他，回家的第二天去了上杭玩了会，对蓝苟苟谈及上杭与我的意义，大概就是这里埋葬了我的青春，牛兜拌面，依旧是年少时的味道，只是吃面的少年已经老了。一路赶回家去参加朋友结婚的酒席，但已经迟到了，所以心里着急，去接朋友时，直接没注意到还在修的马路牙子，直接从两边高低差在十几公分的中间压过去，轰地一声能够明显感觉到车的底盘被刮到了，估计把朋友和姐姐都吓到了，当时自己猛的突然一惊，心想，完了，这还是姐姐姐夫的新车，害，心累。导致后面晚上一直没心情，晚上老爸来接的回去路上又与别人发生冲突，看着老爸突然解开安全带冲下去和别人吵起来，差点动手，赶紧下车安抚劝开，然后对年纪比较大似乎还喝了点酒的老公公道了歉，安抚他离去之后总算结束，偏偏这两件事发生时学妹都在场，尴尬的我直接抠出三室一厅来，以至于后续非常抱歉和她说，见笑了。她还安慰说是我处理的很好，幸好有我在。 回家总共就两天，但偏偏诸多小意外，停老爸的车的时候又不小心将车头怼到墙，所幸各种意外都是虚惊一场，刮到底盘第二天去修车厂检查之后发现没事儿，但心里还是过意不去，想一想，开车五六年了，第一次出现这么多意外，真是常在河边走，哪能不湿鞋，老司机也会翻车。于是乎，找了一天去仙人岩拜一拜，突然发现仙人岩所在的山虽然不高，但依旧可以看到乡镇的好几个村子，就像是站在高处俯看众生，突然有点理解为什么寺庙总喜欢建在高山之上了，大概就是想跳脱世俗，从另一个角度，用不一样的眼光去看这个世界。 虽然时间很短暂，但每时每刻都是开开心心的，每天小外甥醒的很早，醒来之后蓝素素总会把他抱过来放我床上叫我起床，睁开眼就能看到亲人的时间确实不多，平日在自己的小出租屋里，醒来除了能看到一缕阳光之外，再没有别的东西了，所以醒来第一件事大概就是让天猫精灵开始唱歌，好像这样就不至于自己一个人那么孤单。每日姐姐妹妹们聚在一起，嘻嘻哈哈，开着玩笑逗着乐，大小外甥和外甥女抱不过来。感觉长大以后，长辈们好像的话好像开始减少，以前吃饭时叔叔婶婶伯母他们总能扯出很多话题来聊，但现在好像他们变得沉默了很多，但还是热热闹闹的，所以每次回家总觉得治愈，能够感觉到自己身边还有很多很多人陪着自己，自己不是孤身一人。 参加朋友的结婚酒席，遇到了发小以及初中非常好的基友，发小发胖了，腆着个大肚子，有一股子大老板的感觉，大概是看我一个人坐在那有些尴尬，于是便和我搭话，后面喝了酒大家似乎又开始熟络起来，初中的那个好基友已经陌生很多了，和旁边的人侃侃而谈，但与我似乎已经没有什么话题可谈，大概这就是成年人的悲哀吧，以前好像还说着要一起长大，给你做伴郎看着哪个姑娘那么倒霉嫁给你，一转身，混入职场许久不见，在酒桌上端起酒来，连一句问候都不知道怎么开口，只能抿成一个句话，干了，不知怀着怎么样的心情咽下这杯说苦不苦的酒。后面大家都喝了很多，走路跌跌撞撞，感觉那时的酒再苦也没有生活苦吧，一时的狂欢其实只是压抑许久的爆发，虽然喝了些，但好像没有了酗酒的习惯了，整体还算清醒，摇摇晃晃走回家，难得一次，还未喝醉都没洗澡便倒头睡去。 高中朋友特地驱车过来玩，高中还有联系的女同学大概只有两个了，另一个宁愿在家躺也不肯来，上次问我要新人大礼包优惠券替她买鞋子的时候还说我最好来着，果然，女生的话没一个能信的，讲起来这朋友也是许久未见了，再见无非就是各种扯皮，没想到的居然是这家伙居然带着个蛮有气质的闺蜜，初见时，妹子干净漂亮，颇有气质，我穿个拖鞋，胡子拉碴一脸懵逼。本来是想着带她们去河里摸田螺的，所以便穿了个拖鞋提了个水桶在河边等她们，没料到下午水电站已经开始放水，河水涨的很高，根本没办法下河了，只能作罢，又因为在家无所谓，碰巧前一天刮胡子划伤了就没刮胡子了，很好，月老的钢筋都被我拧断了。 因为姐夫有事，虽然请了一天假，但也只能提前赶回杭州，不知是因为喝酒后遗症还是着凉了，大清早起来便觉得恶心干呕，一直想吐但又因肚里没东西吐不出来，头则晕乎乎的，感觉身心俱疲，一路回杭路上有几段路有些堵，只能缓慢通行，众人状态似乎都不太好，只好和姐夫一两个小时便停下来歇息轮流换着，唯有小外甥兴奋的不行，到杭时已经困累的不要不要了，实在是过于折腾。 害，幸福生活结束，继续开启打工人的悲惨人生吧。 2021-05-18 阴 最近在改造项目架构，各种问题，尤其中间件接入最过于繁琐，踩坑无数，不过也因此对于spring更加熟悉了，并且专注度提高不少，似乎基本上每天都在工作，忘记时间流逝，猛地一看，又错过点饭时间。近来又看完东野圭吾小说，好像感触也不是很深，果然，慢慢地，我的感性也开始减少，不再为了一个故事心情起伏或者激动不已，我也不知道这种改变是好是坏，只怕自己生活变得越来越无趣。 一个人的生活无非就是写写日记，看看书，偶尔听着音乐总会回忆以前读书时快乐时光，那时候拥有自己的独处时光，也拥有众人的狂欢，相互衬托陪我度过一个个日夜，但那时似乎也期待自己未来一个人的时光，可以偷偷做着各种自己喜欢的事，不管是捧着一本书，喝着一杯茶坐着一天还是深夜喝酒买醉，倒头就睡，不需要在意别人的眼光和评论，随意堕落和上进。 认识了不少女生，都还蛮优秀，但却没有太大兴趣去深入了解，总想着孤身一人再过一两年之后再说吧，不清楚是因为成年没有那么单纯了还是因为别的，总觉得和别人相处过程中，大家都在相互试探，并不抱着真诚的心沟通和接触，很多时候只觉得这样的交际还不如不要，多留些时光自己独处不是更开心吗，或许大家都是如此想法，所以在相处过程中相互敷衍了事了。 近来因项目的事，感觉自己专业能力进步不少，很享受这种感觉，专业水平已经许久没有去特地提高，荒废了至少半年起了，虽然偶尔看些专业书，但总是断断续续，原定的一些计划也总是被延期和搁置，还是要重新计划起来，毕竟要想在这个城市好好立足下去，还是要靠自己能打，因为转过头才发现自己身后空无一人，独留在黑暗中，头顶上不知名的东西压着过来，有时经常顶的手脚酸痛，但还是不敢放松，因为害怕一松口，就再也站不起来，好像毕业前大家还踌躇满志，心怀理想，但毕业两三年之后都变得浑浑噩噩，不复当年少年气。相对而言，似乎自己还算比较乐观，对于自己未来还算比较清晰，只是想在选择的路上一直走下去，虽说之前确实考虑过放弃，但似乎我已经无路可退了，既然如此，那还纠结什么呢？那就即使碰个头破血流也要勇往直前了。 希望三年，五年之后，我还能和今天一样，不管现状如何，不管困难几何，都能满怀希望和憧憬，慢慢走，走的越来越远。 2021-06-19 雨 趁着端午去了黄山，天气多变，本来看了天气预报说是会下雨，奈何民宿没办法退，想着即使过去泡茶也算逃离杭州枷锁，权当出去散散心了。周五那天晚上抵达黄山，大口呼吸新鲜空气，司机一路狂飙送至民宿，四人住下就此不谈，感觉条件还不错，三室一厅，和老冯躺在床上讨论了许多事，莫名其妙就到了深夜两点多，第一晚的认床以及枕头过高，导致众人都没有休息好。 六七点就起来了，一晚上翻来覆去无眠，最近有些事是在有些激动了，又加之出来玩，兴奋不已。 一路上山，段子趣事不断，小灰灰和妹子有说有笑，我和老冯在一旁看得清清楚楚，云谷索道比起张家界当初的索道好多了，远没有那么让人觉得恐惧。一路直上，由于梅雨季节，之前一直在下雨导致云雾缭绕，山峰全都隐匿在云海之中，一大团雾气遮住众人视线。 首登始信峰，都觉得风景似乎不如张家界，感觉一般，拍了几张照片继续走着，只觉得迎面吹来的山风吹净了近来的疲惫与烦闷，拿着地图沿着景点一路走去，游走在山间云雾里，身心足够放松，丢掉了一切工作和生活的烦恼，惬意至极，真的需要一段时间去放空放空自己，将所有不快都付与山间清风，丢进谷底消失不见。 一边爬山，一边分享着各种景色给某人，做梦也大概想象不到，过去近七年居然关系还会突然如此这般，曾做过无数次梦，梦到她回来了，醒来之后又是无尽的失落感，后面似是已然知道那是梦境，便不愿醒来，但天总会亮，梦也总会醒，这次居然真实到不像个梦境，整个人还是迷迷糊糊，不敢相信。这些年来，经历的事实在是太多太多了，深夜里的酒，加班，各种情绪崩溃痛哭流涕无人诉说，都付与日记，告诉自己一定要坚强，当太阳升起，整理表情，甩甩喝多了昏沉沉的脑袋继续迎接着混蛋世界。 曾经有一个梦境，梦到她回来寻我，解释当初都是误会，还想和好在一起，并且没想到还能在基友的聊天记录中搜寻到这部分聊天记录，现如今，现实与梦基本无异，真的回来了，难以置信，曾被人问过，你以后会不会和她结婚？她？我内心咯噔，都过去好几年了，为何会有此疑问，别人回答，因为感觉你一直忘不了她。我不知道从哪可以看出这些，但确实如此吧，虽然过去几年，记忆开始模糊，声音也开始渐渐消散，有时候很用力也没办法在脑海中复现出她的样子和声音，但似乎有一些东西就一直刻在心里，挥之不去。忘记自己怎么回答，但是内心想的大概就是，现如今的她早已经不是当初的她了，即使我愿，她也不会想吧，所以不敢想。 一边爬黄山，一边无限感慨，就像这山峰，沧海桑田，人却只活百年，百年之后终归尘土，到底什么才是人生应该追求的东西呢，之前看盗墓笔记电视剧时，传说寻得雷城便可以平复世间一切遗憾，那时候就想，要是真的存在这种地方就好了，平复此生遗憾。 2021-06-29 晴 因为前任的事她觉得我不够坦诚，差点又再次失去她，天堂与地狱来回折腾，但又害怕过于坦诚再次失去她，抉择之间两相为难，最后闹得不快，觉得可笑，不管怎么做，怎么说都是错的，过于害怕失去，患得患失，底牌出尽，像是赤裸站在她面前。我觉得好不容易在一起，本不应该因为任何事再闹不快，但没想到总是一些小事计较。 我以为我们都足够成熟，能够一起面对这世界所有的困难，但似乎总是在小事面前频频受挫，曾经在第一次分手的时候，别人似是嘲讽的对我说，我以为你们感情很坚固，可以走很远，没想到那么脆弱，不堪一击。我很想反驳，但似乎却是事实。患得患失很是难受，我不想再经历曾经失去她的感觉，再也不想经历了。发布上线完便直接回家，经过超市买了些酒，本来一路灌着走回去，刚到小区便觉得好像回家喝酒并没什么意思，想起小区旁的河边微风极好，便转头去了河边，喝着酒听着歌迎面总是吹来河风，好不痛快，什么都不去想，只管大口喝着就好。 眼看着袋子见空，不胜酒力，只好提着垃圾回家，却没想到喝太急，一时涌上喉咙，喷了一地，晃晃晕乎乎的脑袋，扶着墙走回去，没走几步又有些反胃，所幸没人，只好又偷偷吐了一地，还好晚饭没吃什么，只是酒水，不影响市容。好久没有喝吐，真是丢人，只好赶紧迷迷糊糊地溜回家，不过脑袋昏昏导致直接在桌子上趴着睡着了，一个多小时才醒来，总算清醒一些，感觉自己像个小孩子，一有什么事便只会喝酒麻醉自己，不去想那些不快，有时候觉得自己真的好窝囊，很多的事无能为力，只能痛哭流涕看着这一切发生。 小时候我总觉得，不管何事，只要自己付诸努力，就可以实现，即使偶尔失败，也总能坚持到它成功的那一刻，但长大之后发现，很多事并不是努力便会有所结果的，有些事发生时，即使你再怎么痛哭流涕跪下挽留都无济于事。从那之后，似乎我便知道了，自己不是无所不能，也知道了很多事不是光靠努力和自信就可以获得，渐渐开始相信命运，将所有不可得都归结于命运。得之我幸，失之我命或许渐渐成为安慰自己的名言金句，除此之外，也不知道该如何抚慰自己。 也罢，人生不过一死，既如此，有何可畏。 2021-07-20 晴 趁着周末去了趟厦门，周六九点出发，一点半到的高铁，却不曾想一晚没睡好，周六五六点便早早醒来，无心睡眠，只好起来泡茶听歌打发时间，四个半小时的行程后总算见到了她，虽然六年多不见，但似乎没有陌生感，好像一直以来就没有失去过联系一般，因为原定计划兵分两路，我去点咖啡，她去看牙齿，本以为几分钟，没想到可以拆掉牙套，激动的像个小孩子，其结果就是我在咖啡店喝了两个多小时，做的屁股酸痛，不过答应陪她一起再次打卡dirty的计划达成，她很开心，没想到拆牙套这天我刚好在，觉得很神奇。 再次初见她时，很熟悉的感觉，好像时间也没有过去那么久，好像上一次见面还在昨天，但又感觉时间过去很久，久到我都忘记上一次见面的时间地点。这么多年了，和她在一起的时候感觉还是有说不完的话，不管身处何地也感觉很踏实，安心，无所畏惧。去过厦门几次，也待过一些时间，但黄厝确实没有去过，只是感觉快到时路很小，拥挤不堪，似乎面向对象主要还是游客，感觉宾馆订在这失误了，入住宾馆之后已经五点多了，距离回杭倒计时只剩23小时了，time fast，时间真是飞逝，似乎一分一秒都应该珍惜，眨眼睛就过去许久。因为没有午休她觉得有些许困累便在宾馆休息，可两人躺着却谈天说地扯皮，嬉戏打闹许久，直到天黑肚饥才被迫外出觅食。 之前讨论过生蚝，于是她便说起厦门有家生蚝很好吃，下次带我打卡，我表示没吃过蒸的，她却说蒸的比烤的要好吃。由于黄厝位置较偏远，所以外出只能打车过去，两人一天都只吃了一顿早饭，所以早已饥肠辘辘，饿的肚子咕咕叫，一篮子生蚝个大肥美，比烤的更加鲜美，沾点酱汁，味道真是不错，两人玩起骰子，喝着啤酒，偶尔来一两只生蚝和一串烧烤，感觉这才是我真正理想中爱情应该有的样子，一起吃喝玩乐，一起游戏人生。 —— 三个一 —— 开 —— 妈的，你一个居然都没有 好了好了，你要是喝不下就先歇会，别等会吐了（我真没想到第一次和她喝酒就那么拉垮，因为饿过头肚子不舒服，一开始喝了一瓶可乐之后肚子开始胀的不行，喝一点酒就开始有些喝不下去了，真是丢人），她调侃我，就这？这要是换别人，老子一定要他立马喝下去，今天对你宽容点，虽然最后由于不舒服并没吃完生蚝以及烧烤，浪费不少，但开心之情难以言表，从店里出来，两人相互牵手走在昏暗的路灯下，吹着透过城市的海风，继续谈天说地，提及真的很安心，就这样，漫无目的走着就好，消消食，不需要担心什么。 晚上两人躺在床上，打开投影看了会大鱼海棠便开始犯困，她困累偎依在我胸前，那一刻，我真觉得自己似乎拥有了全世界，我曾无数次幻想过再次拥有过她的样子，但即使在梦中，她也从没再次靠我那么近，都是远远的模糊影子，甚至我的记忆都开始慢慢模糊她的样子，一年偶然一两次的相遇也只是隔得老远，不敢靠近，记不清多少次在梦中遇到，泪中惊醒，这次轻手抚摸她的头发，很真实，真的不再是做梦了，不会再有梦醒的失落和遗憾了，我没想到还有一天我们会如此亲密，本来失去她是我这辈子唯一的遗憾，似乎，现在，我已经再无遗憾了，即使明天就是世界末日，我想，我也能安然赴死。 那晚上似乎是在数着时间度过的，没怎么进入睡眠，看着她睡着后翻来覆去，一下转过去抱紧被子，一下子又翻过来挨着自己，真是睡觉都一点不安分，没想到三点多对门房间傻逼情侣各种吵闹，她刚好翻来我身边，赶紧用手捂住她耳朵，生怕吵醒她，刚开始还好，没想到对方声音越来越大，真就把她吵醒，本以为会有起床气，没想到八卦的心直接打破起床气，鞋子都不穿就跑到门口听热闹，我也起来打电话给前台让其处理，隔着两扇门都能听到女生哀嚎，两人的对骂声，真是服气。结果后半夜有些睡不着，两人又聊了许久才睡去。 早早就醒来了，看着她熟睡在身旁，感觉就这样看着也足够满足了，没多久她便醒了，真的好喜欢抱着她，看着她躲在自己怀里的那种感觉了，就此别无他求，早起运动完毕就收拾出门，顶着闷热太阳去海边树荫下呆坐许久，被发现抖音全是大长腿差些丢进海里喂鱼虾，今日份计划是椰子鸡，这么说来，厦门她本想带我吃的东西，都吃上了，尤记得，吃完去付钱时，在前台买券时，她问我，要吃个糖嘛，我回答说完好，她便塞我嘴里一颗，条件反射来了句谢谢，她直接凑过来，朝着低头买券的我来了一句， —— 你说什么？ —— 谢谢 —— 你说什么？ —— 嗯嘛（直接隔空给了个吻，卧槽，老子怎么会突然来这么一出？） 只听见前台收款妹子扑哧一声直接笑出来，她立马低头遁走，尼玛，尴尬一比，老油腻男了，赶紧付完钱逃离现场。你刚刚怎么这样，公共场合呢，我直接羞红脸赶紧跑，我表示潜意识突然就…..情不知所起，一往而深，快逃，反正我们都不在厦门，远离社死现场。 2021-08-05 晴 厦门回来后第二周又在周五赶去龙岩见她，算起来至今已经一周了，美好到竟依旧感觉似乎是一场梦境，周五下午坐车大概九点多到龙岩，第一次去到她的房间，感觉干净整洁，对比之下自己那简直算是狗窝了，炒粉外卖已经就位，还有汤配着，这感觉很不错，就是一路折腾，饿过头，并不是很吃得下，继而又排出小龙虾和生蚝，搭配她最爱的甜口利酒，两人开始胡吃海喝，依旧是摇骰子喝酒大口吃肉的日子，一瓶完毕，两人微醺。 早起带子板加汤真是绝了，老家的味道，一直在外不知道惦记多久了。两个人似乎在一起，即使在家坐着好像也不觉得尴尬，偶尔说说话，偶尔玩会手机，或是打闹抓痒，大热天出门真是需要些许勇气，烈日炎炎出门到万达瞎逛一通自拍结束行程，满头大汗再来一口冰雪碧极致放纵，我果然还是吃不惯泰国菜，只能扒拉两口炒饭嘬一小口汤而已，两个人在一起吃喝玩乐，酒足饭饱之后大保健，情侣最好的相处模式大概就是开灯兄弟，关灯夫妻吧。 和她待在一起的日子很轻松，不需要过多想什么，好像休息时间只需要坐着或者躺着聊聊天就可以了，点外卖或是出去吃，自己做饭都可，出去吃了火锅，酒足饭饱又去公园瞎逛，便找了个快草地，两人一起刷起抖音，听着周董的歌，黑漆漆待着似乎也很好。 2021-09-20 阵雨 中秋假期，亲爱的回老家，我去老姐家，所以腻在手机里的时间少了很多，也比较没办法打电话，又因为一些小事惹的她不快，有点难受，心里一直惦记着，所幸她与朋友出去散心，似乎一扫不快，突然内心又燃起一些恐惧，就像在玩牌时，一直喊着要早点回去了，老姐来了一句，现在有女朋友了，晚上都要早点回去打电话了。 翠翠反驳一句 —— 怕什么，女朋友又不会跑。 蓝素素补上一句 —— 那不一定吧，上一次分开直接过了六七年了，他现在肯定怕的要死。 ….. 回家路上骑车听着歌，想起她经常与朋友一起玩的很开心，如果后面来杭州，身边就会没有朋友，考虑到自己有时候加班比较多，所以可能没办法在本应该陪伴她的下班时间陪在她身边，心里突然很难过，自己以前也是个比较热的人，但经过这些年的各种事之后，不知为何，似乎心冷了不少，对于朋友并没有那么大的依赖感，也并不是很爱热闹，即使一直自己一个人上下班或是出去骑车散心玩耍都习以为常，但感觉她还是更喜欢热闹，感觉似乎将她拉到自己身边来，对她并不公平，好像以前很喜欢一个人总是想把她捆在自己身边，但现在好像想起以后的生活也许会让她感到孤单很心痛。 也许自己成长了很多，没有以前那么自私，真心想着她好似乎就行了，有时总想向上天许愿，这辈子，只要她开开心心，让我付出什么都值了，回想起来，似乎，满满的一个青春都被她占满了，我也想不通她为什么有一股魔力，让我如此着迷，但这次在一起，即使六七年未见，也还是那么奋不顾身，只要她愿意，真的想原地结婚。当初分开真是我这辈子最大也是唯一的遗憾，我以为就此抱憾终身，没想到上天还会再给我一个机会，于是我立下誓，如果这次还没娶到她，那我这辈子不会再娶任何人。 感觉她心里还是不快，还未到家，聊天只是短短回复几个字，突然好似一股冷漠，每次在她心情不快或是不怎么理我的时候，总害怕极了，这些年来，我很清楚明白到一件事，那便是没有我，她也可以过得很好，所以以前那种对于自己重要性的肯定，早就烟消云散，取而代之的是害怕她再次离开，似乎现在的自己，什么都不配，不敢太幻想自己的重要性。 希望她一辈子开心快乐，就算真的最后陪她走下去的人不是我，我也希望如此，如若可以，我愿以一切交换，即使生命。我想，这辈子，爱她真的胜过所有，不知为何，好像她就是我生命中一根支柱，没有她的那些日子，也有过开心，但总觉得浑噩，总是在热闹中感伤，悲伤情绪总是莫名产生，每次提及她的事总是心痛，必须灌醉自己才能片刻治愈，但那样的日子真的很难受，就像一只提线木偶，总在回忆，沉在过去，因为那时候只有过去和梦里还有她。 很奇怪自己，对于任何人，绝情时总能特别狠心，唯独对她，只会越陷越深，好像就在脑海中不断生长，不管什么事都能想起她。 2021-10-22 雨过初晴 // todo 大概是想记录一些国庆等相关内容吧，后续再继续补上 2021-11-23 晴 天气降温地很突然，让人有些猝不及防，其实天气预报等消息早就提醒大家，寒潮来袭，温度骤降。 昨晚因为一些小事与楠楠子争吵，两点多躺在床上睡不着，胡思乱想，明明是她的生日，还要惹得她不快，感觉自己真是失败至极。并且明明是这次在一起之后的第一个生日，我最开始准备写一本书的礼物却还没完成，即使每天中午吃完饭以后都去会议室写，晚上回来一有空就写，现在也只是写到一万多字，当初的时间预估果然还是有误差，本以为自己加加班就可以搞定，没想到工作上最近又出一堆破事，感到焦虑。周末准备的油画也不是很满意，又担心邮寄过程弄坏而未寄出，所以细细想来，好像这次她的生日，我除了意思一下一个小红包之外，什么都没有，既没有陪伴，也没有礼物，甚至还添乱与她争吵，突然很受挫，感觉自己并不能带来什么。 昨晚吵架，今天一整天两人也没有聊几句，晚上她也去了闺蜜家开开心心过了个生日，突感失落，其实我于她而言的意义突然感到迷茫，很多时候感觉自己其实远不如朋友所能够给她快乐，感觉心里好乱，一时之间不知道如何处之。好像这段时间，我们的沟通和陪伴少了很多，她出去玩的时候大概会有几个小时消失不见，想一想又觉得很可笑，每个人都有自己的私人空间，我怎么会有这么强烈的占有欲。但看到很多时候自己发的消息没有回复又确实会感到失落， 晚上快十二点打了电话，一瞬间我也不知道说些什么，又想到前晚和她争吵到一个多小时到两点多，便想着今天还是让她早点休息吧，自己听会歌收拾一些心情便好了，总容易情绪低落，但这些年来，早就习惯了，只要忍住一时，就没什么过不去，第二天醒来依旧笑嘻嘻，有时候厌烦自己的矫揉造作。人生在世，哪有那么多烦恼，还是要保持积极向上的态度，没有谁愿意整天看着自己愁眉苦脸影响心情。 蜜桃味的江小白感觉比原味更好入口，感觉自从上次尝试之后，慢慢就将啤酒换成了白酒，啤酒喝多了之后冷到骨子里那种寒有时候还是很让人痛苦的。总喜欢在有些情绪的时候喝点小酒，然后听着歌写点文字发泄一下，好像就可以立马恢复过来，记得当初还在余杭的时候，被操蛋的工作搞得心情烦躁，加班回去总会去超市提着一袋子啤酒，整点猪耳朵，伴着月光自己独享一夜晚。 其实今晚想着等她回来后和她商量一下这周末或者下周末过去陪她，结果感觉自己情绪不太对，就暂且将这事搁置，后续再说吧，今天这状态实在不宜多说什么，不希望自己烦躁心情影响她开心的一天。就目前疫情来看，似乎这波又已经安全过去，所以想要回去，应该也没什么大问题，只不过估计因为疫情班次并没有像以前那样方便，需要多坐几个小时罢了。 感觉自己得失心太重了，希望以后还是少矫情，多读书，别胡思乱想。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"关于离别","slug":"24-关于离别","date":"2020-07-24T14:11:21.641Z","updated":"2022-08-27T17:26:22.540Z","comments":true,"path":"2020/07/24/24-关于离别/","link":"","permalink":"http://yoursite.com/2020/07/24/24-关于离别/","excerpt":"—— 你说，你不爱种花，因为害怕看见花一片片的凋落，所以，为了避免一切结束，你拒绝了所有的开始。 如果明知最后会离别，你会选择轰轰烈烈还是像顾城的诗那样，干脆直接拒绝所有的开始？","text":"—— 你说，你不爱种花，因为害怕看见花一片片的凋落，所以，为了避免一切结束，你拒绝了所有的开始。 如果明知最后会离别，你会选择轰轰烈烈还是像顾城的诗那样，干脆直接拒绝所有的开始？ 我不喜欢离别，是的，很不喜欢，但好像很多时候却装出一副大义凛然毫不在乎的样子，我不知道这样是不是很酷，但好像确实很多个深夜回忆起来，还是酸了鼻子。 好像从小到大不管何时身边总会有一群志同道合的兄弟姐妹，小学时玩着游戏王卡牌，抽到王牌抑或转败为胜卡牌时候总能激动地在水泥地上爬起来拍拍屁股，转个一圈并霸气且尽全力甩出一张，上天赐的宝牌，抽卡，将场上两个怪物作为祭品，召唤古代机械巨人，对玩家进行直接攻击，赢了，真是场有趣的决斗。输了一方又悄无声息地收起卡牌，唱起跟我走吧，天亮就回家，耍赖就走。 树人小学没有所谓的毕业典礼，好像突然就在几张合影中说了再见，升学考试之后的暑假还说说笑笑，好像突然上了中学，便陌生了。我不知道那些昔日不离不弃的朋友为什么突然好像有了新欢，也许有了新欢的是我，一时间就忘了旧爱。新伙伴都是新面孔，带着其他地方的口音和故事，突然让我的生活又变得丰富多彩。 中学是在烈日球场挥洒着汗水的日子中度过的，当然也有班级趣事损友，我不是一个很主动的人，但只要被约基本上都会出门一起耍。三五好友每天晚上都要约出来散散步，大桥上吹个风，喝奶茶嗑瓜子，这里逛逛那里溜溜圈迎着风消消食。初中时候从老爸手里继承过来一辆摩托车，钥匙正式交到我手上，告诉我，这玩意以后是我的了，从此浪起来更轻松了，真羡慕那时候的自己，年纪轻轻就有了属于自己的摩托车。于是乎，周末和朋友们走过大街小巷，骑车兜过各个村子，爬山游泳钓鱼等等行径无恶不作。那时候有球友、好基友、有趣的表妹和发小，开心的日子多到数不过来。 我曾在那个长大的小镇上，冬天的大早上五六点和舜子两人一起顶着两把伞走着去学校，冻得要死，洗个头还导致头发冻成了冰棍儿，一边早读一边头发冰棍儿融着滴水；曾在晚上八九点放学后与三五好友一同走路回家，讲着乡村鬼事吓的同行妹子哭着喊着奔向奶奶；也曾晚上不吃饭也要去打球，最后顶着满头大汗和辘辘饥肠去小卖铺吃面包；也记得和基友晚上在街上瞎逛活捉一只大蜈蚣准备回家泡酒，结果在家门口打翻瓶子被逃走找了半天未果…… 中学的离别似乎也是突然到临，中考完的那个傍晚，一起在表妹家里为其中一个基友提前庆生。我仍记得考完最后一科之后奔向球场那种如释重负，辉仔总结我的中学生活，吃喝玩乐学习都过于尽兴了，算是赢家。那个晚上有人在为某个算错的数学题而懊恼、也有人嘻嘻哈哈啃着大西瓜、更有人灌着冰啤酒谈笑风生，祝你前程似锦，祝我学业有成，推杯换盏中就作了别离，从那之后一群人就似乎在岔路口分了手，各自遁入小路不见踪迹。 对于高中，感觉自己一直未进入角色，一到放假也总和朋友逛逛街、逛逛公园，但似乎大家都接触了新同学朋友，身边也开始有了更厉害的人物，见面总是吹嘘自己认识了多厉害的人物，对于昔日共患难兄弟的友谊好像变得不再那么不可或缺。也许是我过于敏感，总觉得有一种东西在我们之间开始渐渐诞生，说不清楚，但却又不想就此放弃，就当作什么都没有发生，但确实存在，并且膈应人。学校里，依旧热血，喜欢篮球，过于激情张扬，也因此得罪了一些人，有离别自也有相识，宿舍感情很好，一起看着古惑仔，那段时间顿时拉低了整个班级文明素质水平。 中学还被奉为财神爷的我，怎么也想不到高中开始渐渐落败，月末总要靠朋友接济才能艰难度日，总是厚着脸皮向朋友开口，大概因为关系一直很亲近，所以也就根本不在乎所谓的面子了。也有人说我有了新朋友，就再也没与他们一起过春节放炮竹，细想来确也如此，顾此便失彼，我曾对着他们三四人在除夕夜放着好多漂亮的烟花照片的朋友圈突然鼻子一酸，那个原本属于我的位置黑漆漆，突然发觉那个位置有没有原来都是一样的，他们依旧可以过得很开心，那个除夕夜，他们没有主动叫上我，我也没有主动约过他们，好像就一个除夕夜，大家就分道扬镳了，原来以为天长地久的小团体那么简单就分崩离析了。 人生路上真的很多选择，选择了一部分就得丢掉一部分，我曾在某个夜晚痛哭自己好像一无所有了，仅剩唯一似乎不会离，但毕业后选择离开故乡，似乎好像就这样突然和慢慢就没了一切。记得当初伯母送我坐上去县城的车，大概是从小到大从未远离，伯母突然在窗外对着我的位置红了眼眶，轻轻嘱咐我一句，去了学校好好读书，半年就回来了，很快的，别总想家，几句家常便低头拭泪。我突然不知所措，顿时酸了鼻子，不管如何，家里很多人都一直在乎着你，你不是一无所有，不管何时回去，总能给坐在桌子前的自己热一热饭菜听着在外明明吃的苦头却变成吹嘘的牛逼。 县城与一位朋友告别是在车站，我不知道该怎么表达自己的情绪，坐上车之后将行李装好，车已经开始发动，我不敢对视，害怕又相互红了眼眶，只能透过窗户帘子可以看到人影渐渐远去，我以为半年时间真的很快，后面才发现半年真的很久很久，久到我都记忆模糊，谁能想到许多人就此不再见。刚去外地，家里一切还保持着联系，但也是渐渐地，开始断了，有人中秋那日还向我发来祝福，让我一个人在外地过中秋也要开心，后面却突然就消失在我世界中，再也不见。后续与他朋友聊起，对我说，大概许久不联系，就干脆懒得联系了吧，这个社会，维系关系似乎确实很难。好吧，懂了。我以为我们会很好，没想到只是许久不联系，便生疏到无话可说，甚至不再联系。 也有人在一句保重声中，就此别过，再无交集，江湖很大，不知能否再见。 人生而孤独，赤条条来，赤条条走，没人可以陪你走到最后，还是得学会释怀离别，才能怀抱下一次相聚相识。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"Mybatis","slug":"21-Mybatis","date":"2020-07-08T06:17:45.062Z","updated":"2021-11-19T05:59:43.366Z","comments":true,"path":"2020/07/08/21-Mybatis/","link":"","permalink":"http://yoursite.com/2020/07/08/21-Mybatis/","excerpt":"","text":"一、源码阅读先简单贴一个Mybatis源码中的单元测试： 1234567891011121314151617181920212223242526272829303132333435public class AutoConstructorTest &#123; private static SqlSessionFactory sqlSessionFactory; @BeforeClass public static void setUp() throws Exception &#123; // create a SqlSessionFactory final Reader reader = Resources.getResourceAsReader(\"org/apache/ibatis/autoconstructor/mybatis-config.xml\"); sqlSessionFactory = new SqlSessionFactoryBuilder().build(reader); reader.close(); // 这部分用于创建测试数据，忽略 final SqlSession session = sqlSessionFactory.openSession(); final Connection conn = session.getConnection(); final Reader dbReader = Resources.getResourceAsReader(\"org/apache/ibatis/autoconstructor/CreateDB.sql\"); final ScriptRunner runner = new ScriptRunner(conn); runner.setLogWriter(null); runner.runScript(dbReader); conn.close(); dbReader.close(); session.close(); &#125; @Test public void fullyPopulatedSubject() &#123; final SqlSession sqlSession = sqlSessionFactory.openSession(); try &#123; final AutoConstructorMapper mapper = sqlSession.getMapper(AutoConstructorMapper.class); final Object subject = mapper.getSubject(1); Assert.assertNotNull(subject); &#125; finally &#123; sqlSession.close(); &#125; &#125;&#125; 从上面代码中可以看到，Mybatis的执行流程大概是这几步： 读取mybatis配置文件mybatis-config.xml，其中主要包含了JDBC驱动，账号密码以及Mapper映射接口等； 通过配置文件流构造SqlSessionFactory，解析配置文件，将其中参数用于构造环境配置缓存Configuration等，该类主要用于构建SqlSession会话。 通过SqlSessionFactory构造SqlSession会话，用于执行Sql，此步骤主要用于将配置项构造Transaction（事务相关处理器，包括事务等级，是否自动提交等）以及Executor（执行器，主要用于操作Mapper，其中类型包含三种：SIMPLE, REUSE, BATCH）。 SqlSession会话中拿出Mapper进行执行。","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"},{"name":"数据库","slug":"数据库","permalink":"http://yoursite.com/tags/数据库/"}]},{"title":"Redis","slug":"20-Redis","date":"2020-06-16T07:47:35.940Z","updated":"2020-07-22T03:12:35.785Z","comments":true,"path":"2020/06/16/20-Redis/","link":"","permalink":"http://yoursite.com/2020/06/16/20-Redis/","excerpt":"","text":"一、Redis线程模型Redis内部使用文件事件处理器 file event handler ，这个文件事件处理器是单线程的，所以Redis才叫做单线程的模型。它采用IO多路复用机制同时监听多个socket，根据socket上的事件来选择对应的事件处理器进行处理。 文件事件处理器的结构包含四个部分： 1、多个socket 2、IO多路复用程序 3、文件事件分派器 4、事件处理器（连接应答处理器、命令请求处理器、命令回复处理器） 多个socket可能会并发产生不同的操作，每个操作对应不同的文件事件，但是IO多路复用会监听多个socket，会将socket产生的事件放入队列中排队，事件分派器每次从队列中取出一个事件，把该事件交给对应的事件处理器进行处理。 Redis和Memcached区别1、Redis支持更丰富的数据类型（支持更复杂的应用场景）：Redis不仅仅支持简单的 k/v 类型的数据，同时还提供list、set、zset、hash等数据结构等存储。Memcached支持简单数据类型：string； 2、Redis支持数据的持久化，可以将内存中的数据保存在磁盘中，重启的时候可以再次加载进行使用，而Memcached把数据全部存在内存之中； 3、集群模式：Memcached没有原生的集群模式，需要依靠客户端来实现往集群中分片写入数据；但Redis目前是原生支持集群模式； 4、Memcached是多线程，非阻塞IO复用的网络模型；Redis使用单线程的多路IO复用模型；","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"},{"name":"数据库","slug":"数据库","permalink":"http://yoursite.com/tags/数据库/"}]},{"title":"Mysql","slug":"19-Mysql","date":"2020-06-16T06:10:53.762Z","updated":"2020-08-01T02:11:39.879Z","comments":true,"path":"2020/06/16/19-Mysql/","link":"","permalink":"http://yoursite.com/2020/06/16/19-Mysql/","excerpt":"","text":"一、Mysql基础架构基础架构组件： 1、连接器：身份认证和权限相关（登陆Mysql的时候）； 2、查询缓存：执行查询语句的时候会先查询缓存（Mysql8.0版本后移除，功能不实用）； 3、分析器：没有命中缓存的话，Sql语句就会经过分析器，分析Sql意图以及检查语法； 4、优化器：按照Mysql认为最优的方案去执行； 5、执行器：执行语句，然后从存储引擎返回数据； 简单来说，Mysql主要分为Server层和存储引擎层： 1、Server层：主要包括连接器、、查询缓存、分析器优化器和执行器等，所有跨存储引擎都在这一层实现，比如存储过程、触发器、视图和函数等，还有一个通用的日志模块-binglog日志模块。 2、存储引擎层：主要负责数据的存储和读取，采用可替换的插件式架构，支持InnoDb，MyISAM、Memory等多个存储引擎，其中InnoDb引擎有自带的日志模块，redolog模块。","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"},{"name":"数据库","slug":"数据库","permalink":"http://yoursite.com/tags/数据库/"}]},{"title":"Shell","slug":"18-Shell","date":"2020-06-04T06:45:51.023Z","updated":"2020-07-28T06:13:07.647Z","comments":true,"path":"2020/06/04/18-Shell/","link":"","permalink":"http://yoursite.com/2020/06/04/18-Shell/","excerpt":"记录Shell相关知识点","text":"记录Shell相关知识点 一、Hello word在服务器创建文件：touch helloword.sh，提升脚本文件为可执行程序 chomd +x helloword.sh，使用 vim 命令修改hellowrd.sh文件，vim hellowrd.sh，写入如下代码： 12#!bin/bashecho &quot;helloword&quot;; 说明：shell中#表示注释，shell第一行比较特殊，一般都会以 #! 来指定使用的shell类型。运行直接使用 ./helloword.sh。 二、变量Shell中变量一般分为三种： 自定义变量：仅在当前shell实例中有效，其他shell启动的程序不能访问局部变量。 Linux已内置环境变量：使用 env 可以查询所有的环境变量，而 set 既可以查看环境变量也可以查看自定义变量。 Shell变量：Shell变量由Shell程序设置的特殊变量。","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"编程语言","slug":"编程语言","permalink":"http://yoursite.com/tags/编程语言/"},{"name":"Shell","slug":"Shell","permalink":"http://yoursite.com/tags/Shell/"}]},{"title":"命令人生——Linux、Windows","slug":"17-命令人生——Linux、Windows","date":"2020-06-04T03:06:36.765Z","updated":"2022-04-11T15:34:46.681Z","comments":true,"path":"2020/06/04/17-命令人生——Linux、Windows/","link":"","permalink":"http://yoursite.com/2020/06/04/17-命令人生——Linux、Windows/","excerpt":"记录常用Linux、Windows命令","text":"记录常用Linux、Windows命令 一、Linux基本操作关于linux命令大全：http://www.cnblogs.com/yjd_hycf_space/p/7730690.html 1、文件相关 123456789101112131415161718192021222324252627282930313233343536373839404142（1）文件传输：文件上传：rz文件下载：sz [file] 例：sz test.txt（2）跨服务器文件上传：scp [-P20] local_file remote_username@remote_ip:remote_folder (只指定目录，与原文件同名)scp [-P20] local_file remote_username@remote_ip:remote_file (指定文件名)（3）跨服务器目录上传：scp -r local_folder remote_username@remote_ip:remote_folder (只指定目录，与原目录同名)scp -r local_folder remote_ip:remote_folder (指定目录名)（4）数据同步：rsync -av root@ip:/home/data/ .（5）文件编辑或移动：创建文件：touch [file] 例：touch text.txt文件重命名：mv a b (将a文件重命名为b)拷贝目录：cp -r [source_dir] [dest_dir] 例：cp -r /home /usr删除文件：rm -rf [file] 例：rm -rf text.txt编辑文件：vim [file] 例：vim text.txt（6）文件查找：动态查看日志：tail -900f [log_file] 例：tail -900f test.log滚动查看日志：cat more [log_file] 例：cat more test.log文本匹配关键字查找：cat [log_file] |grep [keyword] 例：cat test.log |grep &apos;error&apos;查找大于500M文件：find [dir] -size +500M 例：find . -size +500M根据文件名查找文件：find [source_dir] [params] 例：find /usr -name &quot;*.txt&quot; 说明：-name 表示文件名 -iname 表示文件名忽略大小写文本匹配：grep [keyword] [file] --color 例：grep &apos;error&apos; run.log --red（7）文件解压缩解压文件：tar -xvf [file] -c [dest_file_path] 例：tar -xvf test.tar.gz /usr解压文件：unzip [file] -c [dest_file_path] 例：unzip test.zip /usr压缩文件：tar -zcvf [dest_file_path] [source_file] 例：tar -zcvf test.tar.gz /usr（8）文件存储情况：查看整体磁盘使用情况：df -h使用根目录下各个文件占用情况：du -ah --max-depth=1查看某个目录文件占用：du -bsh /home/lanxuewei查看当前目录总共占用：du -sh 2、远程服务器登陆指令 1234567（1）服务器登陆ssh [-p22] username@ip 例：ssh root@120.78.170.34例：shh -p22 root@120.78.170.34（2）数据库登陆mysql -uroot -p -h[remote_ip] 例：mysql -uroot -p -h192.16.10.3 3、接口或端口访问 12接口访问：curl -v http://localhost:8080/test/index端口访问：telnet 120.78.170.34 8080 4、服务器配置 123（1）查看防火墙状态service iptables statusservice ufw status 5、python、java相关 1234后台运行python：nohup python2 -u test.py params1 &gt; nohup.out 2&gt;&amp;1 &amp;查看后台python：ps -aux | grep python查看后台java：ps -aux | grep java查看java进程：jps 6、命令编辑 12345678Ctrl + a：将光标移动至命令行首Ctrl + e：将光标移动至命令行尾Ctrl + w：删除光标前一个单词Ctrl + u：删除所有内容Ctrl + y：粘贴上次删除内容Ctrl + f：光标向右移动一个字符Ctrl + b：光标向左移动一个字符Ctrl + r：搜索历史命令 二、Windows相关命令1、基础命令 12查看硬件信息：windows搜索：dxdiag创建软链接【将c盘home目录软连接到Z盘home目录中】：mklink /d Z:\\home C:\\home 2、显卡相关 1每2s打印显卡使用情况：nvidia-smi -l 2 3、查看硬件信息 1windows搜索：dxdiag","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"服务器","slug":"服务器","permalink":"http://yoursite.com/tags/服务器/"},{"name":"Linux","slug":"Linux","permalink":"http://yoursite.com/tags/Linux/"},{"name":"Windows","slug":"Windows","permalink":"http://yoursite.com/tags/Windows/"},{"name":"脚本","slug":"脚本","permalink":"http://yoursite.com/tags/脚本/"}]},{"title":"20年-心路历程","slug":"16-20年-心路历程","date":"2020-05-12T12:18:39.896Z","updated":"2023-02-13T17:30:27.964Z","comments":true,"path":"2020/05/12/16-20年-心路历程/","link":"","permalink":"http://yoursite.com/2020/05/12/16-20年-心路历程/","excerpt":"2020年，肺炎横行，祸事频发，我不知道这世界到底怎么了。","text":"2020年，肺炎横行，祸事频发，我不知道这世界到底怎么了。 2020-05-12 晴空万里 2020年似乎多灾多难，春节期间肺炎横行，导致直接公司停工，学校停学，村庄城市封闭，出入戴口罩，看绿码。从年初到如今五月份了，一直戴着口罩，感觉好久没有好好呼吸呼吸新鲜空气，突然怀念大口呼吸空气的日子。再回过头来看看自己，拿了年终，虽说不多，但总归加上之前工资开始渐渐又了一些存款，但考虑结婚生子，却根本就是杯水车薪。其实想想自己以前好像确实对于结婚，成家立业抱有期待，希望拥有一个属于自己的温暖小窝，但好像想象的过于美好了，如今对于各种压力，我已经再没有这些幻想，没有结婚想法，只想好好努力赚钱，似乎生活将我变成了一个特别俗的人。 现在的自己好像经常感觉到生活越来越无所谓了，没有期待，没有向往，没有情趣，日复一日上班与下班，偶尔看看书玩会游戏获得短暂快乐，但依旧觉得空虚和平淡，好像很久没有什么事让我心绪激动。真不希望自己如此下去，回忆起来，以前自己是个多么乐观开朗的大阳光少年。 比自己大三个月不到的小堂姐昨天生了个儿子，突然感觉自己头懵了，好像昨天她还和我一起光着屁股玩泥巴，不知不觉就结婚生子，回过神来，身边很多同学、朋友都开始结婚、买房买车，但是自己却是一无所有，我不知道自己如今的拼命努力有何意义，有谁会在乎我的努力，反正我自己已经根本不在乎了，我想，更没有别人会在乎吧。 2020-07-01 晴 前几天抽空与好几年未见的高中朋友见了个面，一起吃了顿饭，总有一种陌生感，好似不认识又异常熟悉。就感觉现在的自己处在梦中，好像这是一场很长很长的梦，但偏偏就是熟睡着，一直醒不来，朋友的声音好久没听过了，好像说话中就把我拉回了高中，那个在考场和球场挥洒汗水的自己就近在咫尺。 吃饭期间一起聊着不痛不痒的事，说起高中同学以及趣事，突然满嘴开车，让我一时猝不及防。聊起了走上歧路的同学各种事，突然感慨万千，好像毕业之后，大家都顾着在自己的道路上渐行渐远，朋友每次聊天总是说到谁谁谁又结婚了，谁谁谁生孩子了，你呢，有什么打算，什么时候结婚。对于朋友的提问，只能微微一笑，暂时先不考虑吧，事业为先，但想起上次老爸的电话，也是提及此事，批评我不至于一个家庭都养不起吧，反驳之后还是遭到老爸继续批评，以前的我不是这样，现在怎么变得如此没有斗志。我不知道自己是否丧失斗志，感觉没有，每天晚上加班到九点，即使很累，回去也一定继续学习到半夜，平时出行抽空也一定会保持阅读，虽说回报很慢，但总归会有。成家立业，这些事还没想清楚还是先别下定论，毕竟看着身边的同学虽然一个个结婚了，但好像并没有过的特别幸福，不是为家庭琐事吵吵闹闹，就是平平淡淡日子依旧，甚至有同学已经离婚。 从小到大，身上最好的品质大概要属责任心了吧，所以我希望自己的婚姻也是如此，对自己负责，也对他人负责。不为他人眼光所累，做好自己即可。 值得一提的是上周手上项目基本上完工，没什么事做，便私下接了单子，做了几天，营业额达到一千多，刚好最近基金收益也不错，几千的收益让自己甚是开心。每天晚上回家后洗澡收拾，打开淡黄的台灯，倒上一杯热水，翻开技术书籍看起来，也算是很开心的一件事了，只想好好努力。 2020-07-08 大雨 这几天的情况都比较惨，两个和自己同时期进来的同事离职了，算是很核心员工了，直接导致了我们的活一下子变多不少，最近线上也一直出问题，各种查错导致心情极度郁闷，手上已经拿着两三个需求和改动了，排着队测试上线，不记录下来愣是容易忘记最近跟进的事宜。 所幸最近基金还不错，一直在涨，算是给了自己点开心的事，昨天太累就早走回去了，本想着去万达好好吃顿好的，然后回家洗热水澡，玩会手机就不看书直接睡了，但架不住天气放晴，很久没打球，诱惑极大，于是顶着干瘪的肚子，塞下一个好丽友，灌了几口水变骑着小电驴嘟嘟嘟就过去球场了。刚放晴的天气真是凉风阵阵，炎热的夏季也变得舒服，球场可谓是人潮涌动，男女老少都有，跑步、散步、跳舞、篮球等各色活动都有，然而两个球场早已被占满，搞得全副武装的我只能拿着篮球站在球场边上自己瞎玩。坐在球场边上看着他们打球，突然发现别有一番风味，似乎甚至连观众都好久没坐过了，突然看着他们在上面挥洒汗水，即使看着，似乎也觉得自己的青春好像就这样回来了，近在眼前。 天色渐渐暗下来，大概等了一个小时左右，总算是腾出一个球场位置，立马上去搞起来，虽然地上还很多积水，玩起来有点危险，但就像初高中时候一样，架不住激情，玩开来，一个个还是打的生猛，队友都不错，很给力，算是玩的非常开心了。八点多实在是有些饿了，也差不多该回家做饭吃饭，虽然很饿，但依旧回去自己做饭，外卖和快餐实在是比不上自己做的饭好吃。家庭妇男上线，丢下键盘篮球，抄起锅铲菜刀也是一把好手，刷刷刷几下子，黄瓜炒鸡蛋就出锅了，色味香俱全，简直一流大厨，津津有味，舒适。 持续学习，保持写作阅读习惯，慢慢成长吧，还是希望自己可以有所成就，做出点事业来。 —— Keeping on moving。 2020-07-13 晴空高照 与我同时期进来公司实习到转正，到最后一起打拼到骨干的另外两人已经彻底离职离开了，看着当初很多群都只剩了自己一个人，突然感觉不是滋味，不知道自己是去还是留，今天莫名其妙不知道为何感觉有点不太舒服，大概是加班熬夜多了，所以现在身体是越来越差了，周末又缺乏锻炼。上一周线上各种问题报错，引来外部反馈各种问题，似乎每一天都在担惊受怕提心吊胆。好几个晚上都查问题到比较晚才回去，这周好像身体就有反应了，这样不舒服，那里疼。 今天是老妈生日，准备了一只带点颜色的唇膏，好像长这么大还没送过老妈类似的礼物，送给女生倒是次数不少，想来真是不孝，老妈也是女人，哪有女人不爱美。回想起老妈一生，算是吃过了很多很多苦，如今孩儿都长大，但好像并没有因此享福多少。晚上老爸发来照片才发现老妈头发已基本花白，岁月真是一点不留情，就这样带走了多少黑发，好像留下的沧桑。月底就要来杭州，不过辞掉矿场的清洁工作总归要好一些，但带孩子估计也依旧劳累，好像自己也并无能为力。都说中年男人最无力，可笑自己才二十多岁，却也如此， 即使每天加班到大晚上，好像赚的钱也就如此。 罢了，不舒服，今天就这样吧。 2020-07-31 晴空万里 这个月硬是活生生将大小周人为实现双休，本来这周六应是加班，但老妈和妹妹们来了，便继续请假准备出去玩。最近一直在整理知识点和业务逻辑，希望好好准备换个好工作吧，冯仔和老王又突然不来杭州，感觉还是很失落，但想了想，以后久了还是得分别，现在也许没有聚合或许更好，我已经开始害怕离别，再也没办法像以前那样洒脱。 不念过去，不畏将来。 2020-08-13 晴 前几天接了姐姐出院，现在小外甥也出院了，宝宝很小也很可爱讨喜。突然发觉自己身边的人都好像渐渐结婚生子，堂姐、亲姐和学妹都走上了人生第二阶段，过了转折点，好似人生都不一样了，结婚生子，意味着新家庭、新生命的诞生，以后的生活围绕着财米油盐酱醋转圈圈，生活的乐趣也许会慢慢转变吧，再回过头来看看自己，工作的待遇已经不太满意，准备了许久知识点，总算是还可以，感觉可以开始找新工作了，今年的自己其实对生活渐渐有些绝望，好像不管怎么努力，那种平凡的幸福都很难达到，我不清楚自己以后会怎么样，所以只能埋头继续努力，希望自己可以得到想要的。 最近一件小事就扰乱我平静许久的内心，好像很多时候可以面无表情，但却内心波涛汹涌，不知为何，总觉得有些时候内心好像死掉了一样，好像活着的也只是一只躯壳，脑袋早已没有以前那种灵性，任由外界驱使，有些人十八岁就死了，只是八十岁才埋。 有些事还是继续想不通，基友总说by your heart，却依旧无法做到，好似一直在拖着，期盼早日有些结果，能让自己真正释怀。 理想很美好，现实却很骨感。 真正的理想主义就是在看清生活本质后依旧热爱生活。 2020-08-31 晴 经过了一个多月的复习以及整理，总归是感觉心里有些底气了，于是上上周一便开始投简历，找工作，所幸整理全面，虽说一开始面试觉得发挥得并不好，以为面试就这样挂了，却不曾想居然全过，周五以及上周一便请假去现场面试，越来越顺手，对答如流，直接拿到几家公司offer，很想去酷家乐，运气好，四轮技术全过，斩获offer，虽说工资只是给到预期值，但期权部分却让我意外，并且貌似真的准备上市，所以突然让我燃起了对生活的期待，搞起搞起。 回公司之后就是提了离职，组长算是吃惊，总监走了，我们三个实习转正一路走来的也都走了，以后就剩他自己一个人了。害，不过确实很感谢组长以及总监在这两年多的时间里对我照顾，真的在组长和总监身上学到了非常多，不管是技术、思维还是生活等等。说起这些，突然有些热泪眼眶，终究还是太年轻了，总是容易感动。 其实交接文档基本上也准备地差不多了，现在每天也没什么事做，只是在这呆着，技术副总裁还要找我谈谈，也不知下周能不能放我走，入职时间还是定的太过于紧凑了，应该往后放放的，不过总归是结束一段旅程，开启另一段生活了，应该会很不错吧。 今天金水宝宝官宣领证了，过于吃惊，之前也未曾提及，突然就结婚了。家里从小到大打球玩到大的他们四人都结婚了，只剩我一个，突然有些慌张，虽说还是想先好好赚钱，努力打拼事业，但生活确实也不该落下，总之一言难尽，也不知如何评价自己这生活，反正只能自己骗骗自己，先赚钱吧。 哈哈哈，Sunshine boy。加油，奥利给！ 2020-10-20 晴 入职酷家乐已经一个月了，基本上都在忙碌中度过，大概新环境吧，需要慢慢适应。每天上班时间不多，但却基本上都在忙事，不再有划水的时光，偶尔拿起手机，发现错过好多消息和群聊。总算是在煎熬中熟悉了一两个小项目，也完成了一些小需求，多次对着错误日志debug半小时一小时，全称懵逼到头疼真是难受，就像刚开始做开发一般真是幸苦。 换工作中间休息一周，没想到最后到手工资居然也还可观，国庆去趟哈尔滨部分费用的信用卡居然刚好够还真是人间幸事了。感觉自己真是落为俗人，整日都想着如何赚钱存钱，好像掉进钱眼中，大概遭遇了多次因为钱所掉落的窘境吧，不想再如此。 细想起来，好像确实很久没有看书了，自从准备换工作之后，就一直在准备面试的事，荒废了学业，之后又因为换工作和房子导致生活不稳定，一直落下，实属不该，无论如何还是不应该荒废学业，是时候开始继续学习了，感觉三年内的预期和目标基本上都达到了，该为接下去的目标继续努力和奋斗了，希望自己在下一阶段也不输，能够达到预期。 接下去的生活还是要好好用心去过，没必要太过于在意眼前的事，少生气，少纠结，多学习和看书，一直以来都是一个容易情绪波动的人，希望接下去的日子自己可以更加地沉稳和冷静，降低各种期望值，平淡些对待他人和事，做好自己的事即可。永远不要忘记自己的目标和理想，没人值得你去为之放弃。加油吧，少年。 2020-10-29 晴 人际关系真的是一门很难很难的学问，感觉世人过了一辈子或许还是一知半解，总是将自己最坏的脾气给了最亲近的人，对于陌生人却是彬彬有礼，甚至走路不小心碰到都要点头弯腰来句对不起。 老妈和老姐又闹情绪，上次吵架也在不久前，记得那时候和老妈打电话，她哭的一塌糊涂，委屈地言语都哽咽了，好像二十多年来都没有见过她这样过。突然觉得自己这个儿子做的很不称职，对老妈的事也不够上心，出来杭州那么久了，也没花什么时间去陪陪她。这次她们两又闹情绪，让我异常烦躁，很有挫败感，感觉自己不是个好儿子，好弟弟。和欣欣相处中也不是个好男友，与老冯交谈中，透漏出他在这孤零零，没有归属感，感觉当初把他从贵阳叫来似乎并不是一个特别正确的决定，这么算来，竟然连一个好兄弟也不再是了。突然觉得自己很多时候真的一无是处，身边重要的各种角色都扮演不好，真的有那么几个瞬间觉得干脆不活了，好像也没什么可留恋的，最在意的就是感情，但偏偏所有的感情都经营地一塌糊涂，感觉自己好失败。 又是凌晨一点，罢了，睡吧。 2020-11-12 晴 在抖音刷到一个短视频 —— 后来明白了，回家和读书是世界上最幸福的事儿。 深以为然，伴随着 “还记得你答应过我，不会让我把你找不见，可你跟随那南归的候鸟飞得那么远，爱像风筝断了线…..”，突然酸了鼻子。 2020-12-08 小雨 突然就20年的12月了呀，时光总是匆匆，突然想起朱自清的匆匆，燕子去了，有在来的时候……聪明的，你告诉我，为什么我们的日子一去不复返？这份日记也快要结尾了，很快，真的蛮快的，好像一眨眼，就又要过年了。 这一年，好像没有做太多事情，疫情在家办公，回来之后做了什么事也一点没有印象，然后便是换工作至今，似乎也是一瞬间的事而已。感觉自己成长还是过于缓慢，在新公司好多东西不熟悉，来了快三个月了，虽然基本任务都可以完成，但总是很多时候被困住，弄疼了脑袋也思考不出解决的方法，像是达到瓶颈期，很难突破。回忆起来，好像除了找工作那段时间疯狂学习之外，今年沉淀实在太少了些，得好好继续加油啊。 2020-12-10 阴 感觉这一周什么事好像也没做就过去了，真的快，sprint内活似乎都做完了，新的sprint开启，轻松完成一个需求，但review时又因为不合理而重新实现了一版，想要测试，环境又异常麻烦，感觉好心情突然就被搞糟了，跟踪应用奔溃原因，但似乎并没有什么进展，我感觉应用不奔溃，我已经快被搞奔溃了，fuck，这糟糕的世界。 突然朋友圈一堆关于地震相关消息，台湾地震影响到福建几个城市，好像大学时候也发生过一次，但那时候自己也不在家，好像从好久好久以前，关于家里的消息都只能从朋友圈和热搜收到，就心里很不是滋味，感觉自己离了家乡好远。也没有人会在交际软件中弹出窗口，对我来一句，嘿，你知道吗，今天家里地震了。 真的好累，我该怎么坚持。 2020-12-30 天大寒，砚冰坚，手指不可屈伸也 团建了，学会了德州扑克，赌博真是快乐，就是有点费钱，2020差不多要结束了，希望2021善待我。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"Spring","slug":"15-Spring","date":"2020-04-20T09:44:51.199Z","updated":"2020-07-29T09:23:50.064Z","comments":true,"path":"2020/04/20/15-Spring/","link":"","permalink":"http://yoursite.com/2020/04/20/15-Spring/","excerpt":"","text":"一、Spring#####1、关于注解 @Component：组件，所有的Java Bean都可以认为是一个组件，交托给Spring管理，需要使用的地方使用 @Autowired 注入。 @Service：一般作为业务实现注解，表示业务实现层。 @Repository：表示dao层，并且将数据库相关异常进行了转化和封装，封装为Spring的数据访问异常类型。 @Controller：通常用于控制层，用于处理web端相关请求等。 @Autowired：自动注入，即在容器中查找匹配的Bean，当有且仅有一个匹配的Bean时，Spring会将其注入到@Autowired标注的变量中。 @Async：异步调用，该注解在方法上使用则表示该方法异步调用，如果在类上使用，则表示该类所有方法都异步调用。 @EnableAsync：开启异步调用。 @Schedule：定时任务。 @Qualifier：注入指定子类。 注意：@Schedule和@Async注解不能同时存在于一个类中。 10.@Scope：声明Spring Bean的作用域，使用方式如下： 12345@Bean@Scope(\"singleton\")public Person personSignleton() &#123; return new Person();&#125; 其中包含四种常见作用域： 1、singleton：唯一bean实例，Spring中的bean默认都是单例的； 2、prototype：每次请求都会创建一个新的bean实例； 3、request：每一次Http请求都会产生一个新的bean，该bean仅在当前Http request内有效； 4、session：每一次Http请求都会产生一个新的bean，该bean仅在当前Http session内有效；","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"},{"name":"源码","slug":"源码","permalink":"http://yoursite.com/tags/源码/"}]},{"title":"操作日志-设计与实现","slug":"13-操作日志-设计与实现","date":"2020-01-04T06:03:28.439Z","updated":"2020-01-04T09:35:49.158Z","comments":true,"path":"2020/01/04/13-操作日志-设计与实现/","link":"","permalink":"http://yoursite.com/2020/01/04/13-操作日志-设计与实现/","excerpt":"","text":"一、背景以及需求说明 后台管理端的每次关键操作都需要有日志可追溯，可查询操作情况，即记录操作人在何时进行了某项操作，成功或者失败情况等，类似如下： 蓝小伟删除神奇宝贝机构下王小伟用户 其中主体内容可以分为几个部分，采用表格形式进行展示，具体详情如下： 操作人 操作人角色 操作人手机号 操作类型【新增、修改、删除等】 操作对象【用户、角色、机构等】 操作时间 二、设计（一）、方案设计方案一：采用全局拦截器，通过拦截请求，获取请求接口地址，匹配对应url-接口描述得到操作详情，但是这种方式需要配置url-接口描述字典且没办法获取操作对象详情等。 优点：统一处理，较为方便，如事先配置好接口地址对应的详情即可，如 /zoo/add 对应【新增动物园】； 缺点：缺乏灵活性，且获取接口中详细信息较为困难，需配置对应的接口-详情字典表，且当接口修改更新后需要及时同步，否则会出现记录日志与实际操作有所出入； 方案二：设计注解和切面采集日志，切面采用环绕切面，首先在函数执行前收集参数信息，其次执行函数获取返回值或异常信息，最后整合操作日志信息写入数据库中。 优点：较为灵活，需要的接口直接添加即可，不需要配置字典，可以获取业务中部分细节内容。 缺点：需要添加接口较多时比较繁琐。 注意点： 1、分析参数时需考虑参数对象以及Json对象，过滤掉 HttpServletRequest 以及 HttpServletResponse 等相关参数，需要的参数对象采用反射方式获取参数值，Json对象通过直接获取。 2、操作日记采集应尽量不影响原接口返回时间以及结果等。 3、当方法调用异常时需要记录异常信息等。 通过比较，因为此需求对于操作详情要求较高，方案一比较达不到要求，方案二可以实现，并且更加灵活，所以采用方案二实现；后续将对此进行更加详细设计； （二）、流程设计 注解以及切面设计流程图如下： 采用加注解方式，注解拥有以下参数： 1、接口描述【新增用户、新增角色等】-必选； 2、操作对象类型【用户、机构、角色等】-必选； 3、操作者手机号【一般通过Token获取操作者身份，但是登陆时无缓存，直接通过手机号查找操作人详情】-可选，默认为空； 4、操作对象Id参数名【通过对象Id参数名获取具体参数值】-可选，默认为空； 5、操作对象名【新增时数据库并无操作对象信息，直接通过该字段获取】-可选，默认为空； 6、操作对象所属机构【操作用户、角色等时需记录被操作对象的所属机构】-可选，默认为空； 7、异步记录【默认采用异步方式，可修改为同步方式，如修改、删除等操作，需要提前记录则采用同步方式，否则异步记录，数据已被更改，操作日志不准确】-可选，默认为空； （二）、代码设计 部分代码设计如下： OperationLog ：操作日志注解【在函数头中添加，进行切面拦截以及参数名获取等】 OperationLogAspect： 操作日志切面【切面拦截执行函数，获取函数入参、执行情况等】 OperationLogService： 日志相关业务接口【用于分析参数保存日志等操作】 HandlerFactory： 操作对象处理器工厂【用户根据操作对象类型获取对应的操作对象处理器】 UserHandler 、 OrgHandler、 RoleHandler ：具体操作对象处理器【比如用户处理器，即通过Id查询用户表，获取用户详细信息等，可扩展】","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"日志记录","slug":"日志记录","permalink":"http://yoursite.com/tags/日志记录/"},{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"}]},{"title":"19年-书","slug":"10-19年-书","date":"2019-08-29T13:01:54.000Z","updated":"2021-03-15T15:03:20.114Z","comments":true,"path":"2019/08/29/10-19年-书/","link":"","permalink":"http://yoursite.com/2019/08/29/10-19年-书/","excerpt":"我想人生最终总要归于黄土，却不甘心只在人世走一遭，所以喜欢闲来无事捧着本书细细阅读，体会不一样的人生，既要读万卷书，也要行万里路。身体和灵魂都要一齐上路，才不觉得这辈子苟活于世。","text":"我想人生最终总要归于黄土，却不甘心只在人世走一遭，所以喜欢闲来无事捧着本书细细阅读，体会不一样的人生，既要读万卷书，也要行万里路。身体和灵魂都要一齐上路，才不觉得这辈子苟活于世。 嫌疑人X的献身 貌似最近半年来一直都在读东野圭吾的书，喜欢悬疑那种紧张代入感。关于这本书的剧情其实很早之前就看过了，但却是电影，感觉挺不错的，所以这次有空便顺带看了一遍书，时间已经过去挺久了，所以剧情记得零零散散。也许很多外表看起来不懂爱情的人对待感情最是认真专一，一见钟情有时就这样一辈子了。虽是一个平凡的女人，但对于石神来说，实在是生命中的一束光。 恶意 东野圭吾《恶意》另类的写作模式，以重要角色罪犯和警察的自白书作为篇幅，感觉甚是有趣，本以为猜想到的剧情却又笔锋一转，将所有人都引向另一个方向，难以捉摸的故事发展走向感觉实在是很吸引人。就像是另一本书，嫌疑人x的献身中所说似的，看似是几何题，其实是函数问题。 至于感悟，该怎么说呢，大概就是每个人记忆深处都有一些不敢回忆和触碰的东西，努力想要忘记，以至于你整日担忧而过不好现在的日子。所以，该忘记的东西还是忘记了便罢了，内心实在是不应该背负太多东西，否则在人生路上只会将背在背上的包裹越存越重，最终将自己压垮。 新参者 感觉这本书不太像是男生写出来的书，对于案发地点来说，加贺警官也属于新参者，加贺警官从一个新参者根据自己的一直走访调查，慢慢熟悉这条街道上所有店铺和人。其中因为细心调查发现了许多暖心的家庭小故事，感觉笔法心思细腻得像个小女生。 对于书中的故事，从一开始婆媳关系，整日争吵，到最后发现相互准备着对方喜欢的东西，原来其实彼此都在向对方靠近，但因为不善于表达而在日常生活中经常伤到对方。我们的生活中又何尝不是，总是为了一些鸡毛蒜皮的小事和亲近的人争吵得不可开交，其实很多时候彼此静下心来好好聊一聊，也许很多事儿就迎刃而解了。儿子离家出走，不想成为家庭负担，觉得母亲对于自己并无太大在意，后面却发现母亲为了自己所做的事后只剩下感动和愧疚。树欲止而风不静，子欲养而亲不待。很多事再来后悔已经没用了，所以还是每时每刻都珍惜现在，好好对待身边的人，毕竟没人可以确定他们能再陪你多久。 红手指 今天刚好趁着午休时间看完了东野圭吾的红手指，看完以后深感父母自身品德和教育对孩子成长的重要性，经常反思感觉自己以后也不知道能不能教导出一个好孩子，能不能做好一个父亲的角色，虽然感觉自己还是个孩子，但总能体会到，为人父母，真的很不容易。 一直有这样一个疑惑，是不是当拥有自己家庭后，原来的家庭就该丢弃，既然如此，所谓的成家是不是过于自私了，遇过子女在父母遇到这些问题时都是想着如何避免责任和承担义务，毫无责任可言，真的忘记了吗，是谁伴你成长。论语中提及，今之孝者，是为能养，至于犬马，皆能有养，不敬，何以别乎？可笑如今许多人连基本赡养都做不到。 书中还有一点感触极深，就是当他们面对任何事的时候都抱以鸵鸟心态，只是一味的逃避，掩耳盗铃。但是生活中又有多少人现在也是以这种态度去处理事情的，好像转过头不去看，那件事就没有或者不会发生一样，其实只是为了让自己心安理得，可是，真的能那么心安理得吗？ 兄弟 算是很早之前就知道这本书的存在了，不过一直没看，基本上都是因为这个名字吧，感觉非常普通平凡的一个名字，没有太大吸引力，应该不甚有趣。但是没想到开始看之后便停不下来，从开始到结束，大概三四天吧，还是上班的日子里，竟也直接看完了。 故事采用半倒叙方式开头直接讲了李光头十五六岁偷看女人屁股的事作为开端，结合他父亲引出全文，一开始便提及他父亲也是如此行径，最后因此跌进茅坑淹死。作为妻子的李兰从此便在刘镇抬不起头来，不管什么时候出门都是低着头，靠着墙走。 算是缘分也是造化，李兰对于不顾脏臭直接跳入粪坑背出自己丈夫的宋凡平感激涕零，所以后面也有了两人的姻缘，两人结婚时候遭受大家的嘲笑和讥讽，李兰带着李光头，宋凡平带着宋钢，两个流着鼻涕的小孩都是拖油瓶，但正因为父母的结合，他们也成了名义上的兄弟。对于乡亲们的嘲笑，宋凡平依旧笑脸相迎，即使最后与几个闹事的邻居大打出手为了李兰忍气吞声，吃饭时对于两小孩也是极其温柔体贴，没有因为之前的事有一点消极情绪。 李兰自前一个丈夫因偷看女人屁股跌进粪坑淹死以后，一直都觉得抬不起头来做人，但在宋凡平的温暖和积极影响下，渐渐的又抬起头来，甚至可以说是骄傲地走在刘镇的大街上，宋凡平给了她爱和尊严。李光头和宋钢也成了亲密无间的好兄弟，两个人整日乱跑，一起玩耍，一起挨揍。期间还有李光头与电线杆、板凳搞男女关系的一些小插曲，算是小说中特别欢快的一段了，但就是因为这么美好的东西，一家四口其乐融融，让人总觉得这幸福太过于美好，总会被上天打破，揣着担忧和欢乐只能继续看下去。 故事的转折点大概要算是文革开始，李兰去上海治病，家里只剩下宋凡平和两兄弟，因为宋凡平的地主成分每天要去接受群众的批斗，但是不管在外受到何种的唾弃打骂，当他回到家看到两个儿子时，总是能够脱胎换骨，让人觉得身上真的充斥着一股能量，似乎天就算塌下来，宋凡平也能替他们扛起来，给人一种特别特别踏实的感觉。 但上天大概就喜欢折腾不肯向生活屈服的人，因为李光头一句委屈话导致群众将无须有的罪名扣在宋凡平头上，将他殴打且最后丢进牢里。两个孩子明明才几岁，但是却无人照料可怜兮兮，幸好之前父亲入狱之前担心自己出事没人照料他们，曾向他们示范如何做饭等生活技能。宋钢在父亲的潜移默化下，小小年纪就懂事机灵，那时候每日李光头在外玩累了总能回家吃到他做的夹生饭，虽说是夹生饭，但却让他记了一辈子，以至于最后李光头有钱后吃了多少豪华的饭店都还是怀念。 宋凡平因为了实现去上海接李兰的一个承诺，从牢中逃了出来，但是却在车站被堵截抓获，奋力反抗中被殴打致死，李兰没有等到宋凡平，总预感出了事，所以第二天急急忙忙赶回来，却见到自己丈夫已经悲惨离世，或许就在那瞬间，她重新建立起来的世界又经历了再一次的崩塌。但在替丈夫处理后事过程中，一直表现得很坚强，甚至对于红卫兵的巴掌也面不改色迎了上去，在宋凡平的爱和温暖下，连李兰似乎也变成一个顶天立地的英雄一样勇敢了。 父亲的离去对于这个家庭打击巨大，为了照顾年纪大的爷爷两兄弟只能分开了，但即使这样，似乎路途也隔不开两兄弟的感情，宋钢帮爷爷做事的同事总会给李光头带来大白兔奶糖，每次自己舍不得吃最多只是闻闻，对兄弟却慷慨大方，当时看到这里，感觉宋钢真是懂事得让人心疼。 李兰的身体后面一天天也在变糟，以至于最后也撒手而去，宋钢明明只是大李光头一岁，却应承下要照顾他一辈子的承诺。以至于两兄弟长大后对于林红，宋钢也是不和李光头争抢，但偏偏林红又看上了他，一边是自己很喜欢的人，另一边又是唯一且最亲的兄弟，两项抉择下，宋钢选择了上吊。被李光头救活以后再次因为林红的事两兄弟置气，宋钢也终于决定和林红在一起，两人结婚过上了幸福的日子，李光头却因创业失败收起了破烂。 本来依旧还是好兄弟的一对，却因为林红的相逼最终决裂，其实看到这段的时候莫名心酸，站在每个人角度考虑问题都没错，李光头与宋钢相依为命，彼此都是世上唯一的亲人，虽不是亲兄弟但却早就胜似亲兄弟，一份饭也分着吃，宋钢即使因此经常饿肚子也毫无怨言，甚至觉得开心。但林红角度考虑，李光头偷看她屁股，无耻下流，追求她时又说出下流话来羞辱她引得众人嘲笑，最后又阻挠宋钢追求自己，在他多次向宋钢伸手要钱的时候林红也是忍耐到了极限，逼的宋钢在她和李光头之间做个选择。虽说宋钢最后选择了她，与李光头一刀两断，但心里却是愧疚不安，常常梦到李兰，记起自己对于去世母亲的承诺，默默流泪。没有谁对谁错，只能说，造化弄人。 这样的日子没过太久，宋钢就下岗了，林红也遭受着厂长骚扰和下岗危机，相反的是，李光头这边却因祸得福，将垃圾生意越做越大，如鱼得水。宋钢为了给林红更好的生活，挑起生活担子不小心将身体弄伤，也找不到合适工作，林红受尽委屈却也不好开头和宋钢提及，似乎让人羡慕的一对，也被生活折磨的遍体鳞伤。希望以后自己另一半不管在外受了什么样的委屈，到家了也能向自己诉说，即使自己已经被生活打压的抬不起头来，也能为她做点什么，而不是自己一个人藏在心里，只能默默叹气。 宋钢受伤又做不了什么工作，反观李光头却是风风火火，林红只能让他去找李光头，对他说，他是你兄弟，却不曾想当初要他们一刀两断的时候说的也是类似的话，你们俩又不是亲兄弟。宋钢却绝不肯去，他的心里对于李光头应该是极其愧疚的，他和李光头的感情并不能拿钱衡量，但似乎去找他与之前李光头落魄时决裂对比起来，似乎是用钱在侮辱他们的兄弟情。林红逼迫他不去自己就去，宋钢为了这个女人再一次妥协了。没曾想李光头却还是那样洒脱，你他妈总算来找我了，骂了他好几句，宋钢突然觉得他这兄弟还是他兄弟。 但不想依靠李光头的宋钢为了多赚点钱宋钢离开了那个从小长大的刘镇，为了让林红过上好日子，也随着周游一起骗起了人，做起了一些小买卖。看到他为了赚钱去做假胸的时候，感觉心酸至极，我想象不到一个大男人顶着一个女人一般的胸走在大街上供大家玩笑侮辱的场景。宋钢不知道多少次想钻进地缝中躲起来，但为了林红的幸福似乎又觉得什么都无所谓了，然而就当宋钢在外出卖尊严换取这血汗钱的时候，家里的李光头和林红却搞起来了，我没有想到故事会如此急转而下，我总以为即使李光头再怎么喜欢林红，也绝不会对自己兄弟的女人下手，但或许生活就是这样俗不可耐，林红也因宋钢一直不在心理防线终被突破，两个宋钢最亲最爱的人都一起背叛了他。然而那两个都是他这辈子最爱的人啊，宋钢善良到觉得是自己给不了林红真正的幸福，和她在一起的日子里自己也过得很开心，写下给两人的信后卧轨自杀。看到最后，我的心里也不知道是什么感觉，说不上来，既不是愤怒，也不是遗憾，只是摇了摇头，觉得无奈罢了。 宋钢性格善良，对待身边的人特别温柔，但是并没有特别其他突出的特点，李光头性格突出，一直很了解自己想要什么，这大概就是为什么即使过去几十年，他依旧垂涎林红的原因吧，但为了一己之私，对自己的兄弟做出如此之事，最后导致兄弟卧轨自杀，我觉得再怎么愧疚也弥补不了。看这本书的心情一开始是很激动的，感觉情节引人入胜，对于欲望也毫不掩饰，算是很真实，细节处描写又让人觉得很动情，感人。但是看到最后结局时候却不知道何种感觉了，除了叹一口气外似乎也没有别的感触了。 秘密 一书故事篇幅不长但却是很曲折，体会着男主心情从悲伤绝望到惊喜矛盾到平淡又到最后无限绝望悲伤，最后居然短短几句话看的我也要替他委屈地流下泪来。你获得了重生，你选择抛弃过去一切重新来过，我愿意放开，却没想到为了一己之私你愿意演一出好戏，将我瞒在鼓里，如此也就罢了，让我别忘记你，自己却早已忘得一干二净，却还要将我一辈子绑在你过去的影子里。 幻夜 休息的一天，昨晚喝了点酒睡到大中午，懒洋洋爬起来吃了外卖继续躲在被窝里终于看完了幻夜，结局实在是太出乎意料精彩了，女主新海美冬和男主水原雅的故事真是太过悬疑、惊悚、坎坷以及感人等等等……雅也为了所谓的和美冬虚幻美好的未来，不惜杀人分尸让曾我孝道人间蒸发；强奸女店员栽赃嫁祸给青江，又让美冬出面解决好让青江死心塌地为自己干活；勾引比自己大十来岁的赖江制造把柄好让美冬不被调查；就算最后美冬嫁给别人，也发现从一开始就隐瞒身份欺骗自己，甚至设计勒索圈套让自己杀人，当知道这一切以后，依然设计假装自己气急败坏想要杀掉美冬而引出快调查出真相的警察，一起同归于尽，真是有些出人意料了，你也杀了人，你杀了我！你杀了我的灵魂！没想到即使雅也知道真相后这样充满怨恨，最后也还是决定用自己的生命保护她那面具下的假面。 白夜行 白夜行和幻夜的故事线感觉很相似接近，同样是一个男生为了一个女生不顾一切，宁愿自己一辈子活在黑暗影子里，也要护女生周全。其实有些时候人性还是挺丑陋的，为一己之私不顾一切。 云边有个小卖铺——少年，且惜时珍人 刘十三，很平淡简单的一个名字，大概放在列表中也是最不起眼也没人注意的那个名字，但偏偏这样的角色以及人生，确是大多人最真实的样子。勤奋努力读书，似乎好像也就这样，成绩平平，没有电视剧中那般逆袭考上重本，但过程中似乎壮志凌云的样子偏偏就是大多数人的缩影，至少我也是如此吧。一直以来，其实他都拥有着最为宝贵东西，那便是身边的外婆王莺莺和那种看似不起眼但却平淡的幸福。如果非要用一个词来形容他，大概我会选择呆吧，被动性格，很多事都不主动争取，而选择被动接受，还小就遇见了身患绝症所以异常霸道的程霜，呆呆的接受着各种欺负，好像一切都甘愿受着。 没有电视剧的逆袭，平淡上学，恋爱，生活，简直就像是一杯白开水一样，甚至都不用费脑子去想明天如何度过，因为照着今天的样子，在日期中往后排一天就是明天了。第二次遇见程霜是十几年后，但他忘记了小时候的玩笑，程霜还小走时留下的信条，如果我还能活下来，我就做你女朋友。再见面，正碰上刘十三失恋，一边是冷淡如水弃自己不顾的牡丹，另一边是如火热情的十几年前便在自己心里刻下痕迹的程霜，但他的目光和心思全在牡丹身上，即使她背着自己拥有着另一个男朋友好像也无关紧要。大概电视剧以及书籍告诉我们失恋是件很痛苦的事，所以刘十三似乎不管如何都要表现出很失落的样子来，整个人像是丢掉了灵魂一样，这幅场景，大概和电影六弄咖啡馆男主被女友劈腿，甚至最后一次补考机会也错过，浑浑噩噩的样子那般相似吧。但你说刘十三对于牡丹好像并没有特别深的感情吧，好像又不是，在之后好久好久，每当他想起这段事，总能感觉异常难受心痛，为了她忽略了太多太多身边的人和事了，外人看来，不能理解，也觉得不值。陪刘十三疯过一阵之后，又如十几年前一样，程霜再次不告而别。 以前总说生活很苦，社会难混，其实年轻气盛时谁会以为自己最后也会沦为众多平淡沙丁鱼中的一条，随波逐流，过着日复一日像白开水一样的生活。但偏偏，生活就是不断打压你，让你低下头去，从大学毕业，依旧怀揣梦想的刘十三和同学一起到社会摸爬滚打，抱着破吉他的同学希望有机会可以唱出自己的歌，但在现实生活面前，吃不饱饭的时候，除了打着散工，低头丢掉尊严只为赚点生活费外似乎任何一项爱好或者梦想都成了罪恶，最后实在混不下去，只能离开，我很庆幸，他离开的时候，依旧没有忘记自己的梦想，我觉得，其实，人只要有信念和坚持，就永远不会输，最怕将自己初心都丢弃。 真正击败一个人的很多时候都不是一件大事，反而是一件很小很小的事，刘十三亦是如此，牡丹的离开和背叛对于他来说似乎扛住了，工作上受尽委屈和小人侮辱也罢了，但不知如何就突然情绪爆发，哭得一塌涂地，很感同身受，很多时候甚至听一首歌好像就突然酸了鼻子，刘十三独自一人畅饮，喝完大吐，但似乎这样才过瘾，喝多后好像隐隐约约看到最疼自己的外婆来到自己身边，他忍不住大哭和质问，为什么妈妈在他还小时候就抛弃他，为什么牡丹也抛弃他，为什么那么努力的自己还是一事无成……很多人喜欢喝酒，原因大概也是如此吧，好像从小接受的教育就是让我们要坚强，忍住眼泪，但有些时候明明就是想哭出来，但碍于面子只能在心里想一想，只有喝多了，感性战胜理性，才敢用力哭喊出来，质问这一切不公的事，将自己所受的所有委屈都宣泄出来。即使被再多人看到，第二天也是以喝多了搪塞过去。 感觉人生就像是买股票，起起落落，可能每当你绝望要死的时候，突然又让你幸福感爆棚，被外婆王莺莺从城里用拖拉机像货物一样运了回去，似是一场梦。梦醒时分，又见程霜，依旧俏皮和霸道模样，我寻思着，这次刘十三总能把握住机会了吧，在云边镇的日子，缓慢而又静谧，刘十三总是想逃离，好像大城市的跌倒，让他更想在那站起来，既为自己，也为牡丹。但程霜却觉得这样幸福的日子她愿意过上一辈子，但身患绝症，不知道哪天就再也醒不过来了，所以对于每天，她都倍感珍惜。为了帮刘十三一起卖保险，程霜费尽心思，莫名其妙又多个球球这个女儿，与外婆王莺莺打成一片，好像突然就变一家人其乐融融了，刘十三这种被动性格和呆呆的情况，遇见开明乐观活泼的外婆王莺莺、霸道主动的程霜以及古灵精怪聪明伶俐的球球真算是三生有幸了，生活好像突然变了颜色，不再灰白单调。但偏偏，他的眼里好像只有与情敌的赌约，忽略了太多。 莫名其妙好像突然就多了层球球爸爸的身份，程霜成了自己媳妇儿，一起出去玩，倒真像是幸福的一家三口，像是过家家，美好的那么不真实，感觉像是一场泡沫般的美梦，轻易触碰就会破碎。因村名与警察冲突，一家三口分开，刘十三接到程霜的电话第一句话就是，哪有你这样的爸爸，丢下老婆孩子自己去打架，对娘两不管不顾的没责任心的爸爸。好像程霜已经真把自己代入刘十三妻子的角色了，很喜欢程霜的性格，大概因为自己不知道还能活多久，所以对于想做的事便要立马去做，主动积极，绝不拖延，大胆而有激进。在船上不顾船漏水要沉入水库，也要先让刘十三在牡丹和她之间做出选择，俗话说得好，小孩子才做选择，大人全都要。但正常人大概率都会选择程霜吧，偏偏刘十三这个傻子，三次机会两次都选了牡丹，看的当时就差点钻进书里把刘十三丢到水库喂鱼。 人啊，一双眼睛总是看不到身边的人而看向别处，外婆王莺莺的去世、球球被送进孤儿院导致原来的美梦似是变成一枕黄粱，程霜不敢离开他半步，好像只要一离开，刘十三就也要永远离开。好不容易将程霜哄回家，自己一个人冒着封山大雪将送王莺莺的灯挂上了山顶，累得缓缓睡去，猜想后续应该是程霜会赶来救他一命吧，否则山顶一夜必然丧命于此，没想到当刘十三睁开眼时真的看到程霜，裹着羽绒服瑟瑟发抖，对他说，我就知道你一定会来，所以我特地穿了厚厚外套才出门来陪你，一路上大雪好滑，我走了好几个小时才到这山顶，你果然在这。有时候感动人的就是莫名其妙的几句话，似乎就像是不管前路多坎坷，只要知道你在那，风雪再大，我也会来。感觉刘十三真的是个很平凡但却很幸福的人，但上天也足够残忍，程霜又一次要走了，原来后两次相见都不是偶然和缘分，只是因为打听了他的地址，才有了所谓的缘分和偶遇，但这次她决定回去做手术，生死参半，但却说的平淡，如果这次我还能回来，我们就结婚吧，如果我没回来，你不要再来找我，只要我能活下来，我就一定会回来找你。许久没有被什么事感动过，但这本书，尤其这段确实让我心头一热，原来有些承诺真的让人很感动。 对于未来总是抱着期待和向往，我以为生活不至于如此残酷，但偏偏，程霜还是离开了，没有再出现过，有些东西就是如此，稍不留神，它便永远离去，少年且惜时珍人。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"书籍","slug":"书籍","permalink":"http://yoursite.com/tags/书籍/"}]},{"title":"大学游记","slug":"12-大学游记","date":"2019-08-29T13:01:54.000Z","updated":"2021-02-23T16:23:25.187Z","comments":true,"path":"2019/08/29/12-大学游记/","link":"","permalink":"http://yoursite.com/2019/08/29/12-大学游记/","excerpt":"算是一场梦的旅行","text":"算是一场梦的旅行 离开 —— 我以为只是短暂离开，却没曾想许多人都好像就此告别你的人生，不再参与，再见时已形如陌路。 说起来对于上大学这件事好像来得很突然，前事不提，只记得当时收到通知书的时候并没有特别大感觉，只是觉得也就这样，换个地方继续上学罢了，并无特别大期待，因为要离开家很远，丢掉家里所有的朋友，离开这个熟悉的地方，甚至有些担忧，没有旧友的日子，又该重新混熟一堆伙伴，也不知道能不能遇到与自己一拍即合的挚友。 高考完后的三个月一晃而过，拿到录取通知书到开学也是紧接而至，日子好像突然就近了，老爸已经提前安排买好车票了，衣服什么的也伴随着老妈的唠叨嘱咐一件件被塞进了行李箱中，看着塞得满满的行李才真真切切感觉到自己这次是离家很远并且会很久不会回来。虽然什么都不需要做，只是默默看着被收拾好的一切，似乎终究要离开了。 去的时候是老爸陪着去的，湖南株洲，记得离开的时候发了个朋友圈，很洒脱地说了句，今晚就要走了，此去一别就是半年，小伙伴们保重，想念该想念的人。半年，在当时起早贪黑的高中来说算是很快了吧，所以我想着也许就像是在自习室做个习题一样，轻轻松松就是一晃而过了。随着火车哐叽哐叽几声，我发现任由我怎么在窗口远眺也看不到家里的兄弟姐妹了。再坐下来的时候看着周围都是陌生的面孔，感到不安，其实自己算是个很念家很念家的小孩儿，以前高中每每放假总要回家，即使家里只有自己一个人，但总似乎感觉很暖。 中午的时候大概就到了，老爸总是风风火火，提着行李匆匆走着。一出了车站就见到了印着校徽标志的旗子和大巴车。宿舍以及班级里基本上人员都到了，所以我来的时候似乎他们已经熟络起来了，三言两句问着，大概就是叫什么，来自哪里，然后一一自我介绍。当时算是有些受宠若惊了吧，突然围过来的几人把我问懵了，本来已经做了快接近二十个小时的火车，人都还是晕晕的，名字又那么多，都是生面孔哪记得住，但为表礼貌还是嗯呢嗯呢一直点头，心想，后面总会记得住。中午和老爸用学校发的券去食堂吃，似乎每个新生都有一个鸡腿，大学食堂饭菜感觉比高中的略丰盛了些。天色还没暗下来，老爸就说准备走了，去市中心逛逛，然后在校门口让我帮忙拍完照就头也不回打车去市中心逛街去了，说是难得出来一趟要去看看。等等，这就直接把我丢在这了？有那么一刻，我感觉我不是亲生的，再回想起在家伯母和老妈送我离开了时突然红了眼眶，对比一下我洒脱的老爸，罢了，习惯了，从小到大对我散养以及严厉惯了，真要煽情我还真难想象。 望着远去的老爸，行吧，那就回宿舍吧，等等，这在哪？我宿舍在哪？妈蛋，坑儿子啊，天知道那天晚上我问了多少人才从学校东门找到我躲在北门角落里的宿舍。 回去宿舍以后记得半夜饿了，刚好也有其他同学也是如此，便一起出门觅食。那时候的一食堂还没有这么繁华，店并没有很多。绕了一大圈似乎并没有什么好吃的东西，总算找见一家店，抬头只见上面写着洋洋洒洒仨个大字，螺狮粉。众人不解这是啥玩意，我一个胡建人都不知道的柳州螺狮粉，何况那些西南或者大北方来的小伙伴了。抱着尝试的态度众人坐下来各要了一碗，当老板把碗端上来后，那股味儿我至今未曾忘记。这玩意真的能吃？大家你看着我我看着你的，没人愿意下一口，也不知道是谁带头尝了第一口，我只记得反正这小子绝不厚道，欺骗我们和臭豆腐一样闻着臭吃着香。反正在这小子鼓舞下，大家都尝了人生中第一口螺狮粉，后面细节我已不记得太清楚，应该是大家不约而同来了句，要不不吃了吧，我们买点零食吃吧，意见立马达成一致，众人立马起身赶紧离开。 后面这家店每次我经过时总是快步经过，避开那股味道，记得大二还是大三的时候回来路上遇到一个最惨的哥们，听到他对女朋友说，我们今天中午吃什么啊，女朋友丝毫不用思考回答了一句，螺狮粉，没看到男生的表情，但我觉得应该很惊恐，挤出一句，又吃螺狮粉，我们都吃了几天了，要不吃点别的吧？女朋友顿时来了句，反正我就要吃，你要想吃别的就自己去吃吧，说完头也不回就朝前走去了，但见男生快步追上，好好好，那就吃螺狮粉。兄弟，我敬你是条汉子，姑娘，有一个愿意陪你经常吃螺狮粉的男生就嫁了吧，这样的男生真的不多了。 吃了点零食，肚子还是有点咕咕叫，但似乎脑子活跃起来后也并不是那么饿了，宿舍灯一关，大家都安安静静地躺在床上似乎与白天的喧闹形成了巨大的反差。大概心里都想着家里的人和事，突然感觉周围一切都特别陌生，陌生的城市，陌生的舍友，大家有一言没一句地搭着话，不知不觉就到深夜了。 初识与跌倒 —— 人生若只如初见，何事秋风悲画扇。一路走来都太过于顺风顺水，所以这次跌倒磕得可谓是头破血流，倒也成长不少。 刚开始最早熟络的起来的大概又算是打篮球那伙人吧，因为爱好聚在一起，大一新生赛，打得热火朝天，鲜红色球衣，胸前印着计本1401的一群人奔跑着，一边军训一边也打着比赛。记得那时候每天还未亮就爬起来洗漱穿好衣服就得去操场，五食堂的田径场周围空空荡荡荒凉的一比，一路上阿猪的手机总是放着平凡之路，徘徊着的，在路上的，你要走吗，via via……但似乎除了这头精力旺盛的猪外，大家都低着头眯着眼还在睡梦中般步履艰难地走着，像极了生化危机中的行尸走肉，了无生机。我不知道别人怎么样，反正我知道我每天困得要死，早上起来还是冷水洗脸，整个人都处于懵逼状态。当时每次快到操场时候总会抄近道，走一片小树林，大家伙似乎总要前后呼应几声生怕谁掉了队，声称这是一次挑大龙打野，激动万分似乎当了真，哇，反正一群傻屌男生一起玩的感觉太爽了，傻出境界。 在那期间小小的团队也开始慢慢形成，爱吃胡建人但舍不得吃我且吃不得辣又来湖南上学的操着一口标准普通发的广东阿成；臭美且臭屁多才多艺光金猪，所以我当时给这比冠名亲切外号猪哥、阿猪，军训期间活动主持人以及歌唱家，靠着一首华哥的“都怪我，太执著…..”红遍大江南北的一句；凭借一股子拼劲和我一起连续断了几个关键球反超比分拿下决赛名额的贵州隐藏富豪老冯，记得当时军训完后我们两还有个合影，像极了越南战争回来的难兄难弟；自称社会小人渣、台北张根硕、采辣椒小阿姨绰号一堆，整天顶着圆圆的一休哥似的小寸头外表人畜无害老实人模样实则情场高手鹏……暂时先出场一小部分吧，其他老哥们且在后台准备着，他们唱罢你们登场，排名不分先后在我心里一样重要。 教官没心思教导我们去走方阵，天天带着我们做体能训练，高强度俯卧撑导致当时手臂受伤，结果疼的不行去了校医院拿了药，于是后续几天都和几个女生搬了几块砖头坐在旁边看别人训练，这大概是我大学抹不去的污点了。后面才知道老冯在我旁边做俯卧撑的时候总是趁着教官没看到的时候直接趴在地上偷偷懒，起伏全靠屁股，当时就给我整懵逼了。靠，还可以这样操作的？我他妈竟然是个老实人？不过也因祸得福，手臂一两个星期好了以后居然粗了一圈，特此声明，我的麒麟臂是一条正经的麒麟臂。 记得当时有次军训完回宿舍时老冯在旁边走着走着，两人有一句没一句扯着皮，突然一转过头发现这比居然没了，再一低头，地上的下水道盖直接被踩翻开，这笔一只脚直接踩空踏了进去，可惜架不住这比求生欲极强，两只手死死抓抓我的右手就不放，好像在哭喊着，先生，救我？看着他的胶鞋掉落下几米深的下水道中被冲走。卧槽，你小子求生欲真他妈强啊，把我手都抓红了，这他吗要是两只脚踩进去，我一定也被你拉进去了，明天就得一起上工大新闻，小子，下次再有这种事，你他妈千万别抓我，你掉下去我还能找人捞你，不然咱们一起冲走了怕是要流浪湘江了。算起来，竟是认识之初便一起共患难了，不过这小子又因祸得福，接下去的军训期间天天穿着自己的鞋，我再看看自己脚上硌脚的鞋，靠，好处都让你占了。 军训时印象较为深刻的要数翔仔受尽教官宠爱，任命为小队长的故事了，长相憨厚的翔仔成了教官的小弟和我们的指挥官，人送外号大佐，大佐是个新化人操一口新化发总引得大家捧腹大笑，似乎那时候的快乐全靠大佐整日卖力的表演了。腰间的皮带已束不住他那肚子，总感觉要撑开，每每军训前后总是解开皮带在手中甩着，像极了抗日期间的翻译官。记得那时候同一个营的除了计算机专业的同学们外，还有一群通信专业的妹子们，本来院系里大概就只有通信专业妹子质量和数量最优了，偏偏被分到我们营。刚上大学的大伙都似脱缰野马，到处散发着荷尔蒙的味道，似乎男生中最多的话题便是谈论哪个妹子最好看，当时有几个妹子确实长得还挺漂亮，皮肤也白的不像样，当时看呆众人。记得来之前就有好友对我提及，湘妹子都很漂亮，皮肤也很好之类的话，似乎在这得到了验证。许多男生为此争先恐后表现出自己的优秀，堪比春秋战国的诸子百家争鸣。 记得当时偶尔还被教官拉到食堂旁边树荫下休息，妹子们被教官以及大家起哄说跳个舞，啧啧啧，真是腐败的生活啊，大概率当时大部分男生都要流鼻血了。记得当时隔着老远通信男生们冲我们喊道，把妹子还给他们，他们舍不得。不曾料到我们这群虎狼之师回应道，不还，我们也舍不得。后面我才知道，基本上大部分男生都加了几个漂亮的妹子QQ，这样那样的借口都聊上混得还挺熟的，就连班里最老实的几个男生也是如此，别问我为什么没有加，老实人的我又背锅了？大概一眼就知道自己搞不定，这种妹子远远欣赏就好，高攀不起，不应该自讨无趣。但我也喜欢凑热闹，尤其喜欢起哄，反正吹口哨鼓掌拍手叫好之类的事大概是我最喜欢的了，像极了看古代街头卖艺表演的吃瓜群众A，别问为什么不是BCD，因为BCD是老冯小灰灰他们。 也就是军训时，挺多原因吧，对于前女友关心太少，一条短信通知我分手，当时也没多想，就回了个好的，男生大概一般都是决策理智型的吧，既然别人已经决定了，再去挽留也没有意义，想离开我生活的人那也别再挽留了，迟早也会走，于是她就彻底离开了我的生活，详情不再提。当时周围人还没完全熟络起来，离家也挺远，每天五六点爬起来困的不行直接趁着还没开始训练也能在操场上睡会，手臂受伤受够了整日活络油的味道。新生赛虽说一路挺进总决赛，但也是坎坷不断，又受了一些小伤。家里又因为一些事又让我很着急却又无能为力，许多烦心事没几个人可诉说，所以整天没事便躲在宿舍喝着酒，喝多了就好好睡一觉，浑浑噩噩算是熬过了一段挺艰难的时刻。所以几个基友对于我大一时印象便是，一打开我宿舍门便见我坐在那听着歌对着电脑发呆，听见声响转过头第一句就是，要不要来一杯？ 记得大学刚开学时候和阿成天天没事跑去自习，上完课立马去吃饭，回宿舍休息一小会就又去教室自习了，将前辈们的敦敦教诲铭记在心，大学了还是要好好学习为重，学好专业知识，将来为社会主义建设贡献自己的一份力量。看了一个多小时书左右，同学们大概也就陆陆续续来上晚自习，喜欢那时努力的自己，让内心充满了信心和期待，感觉未来一切都可期，但那之后似乎丧失斗志，每天都躲在宿舍对着电脑听歌发呆，习题也不做了，书也不看了。每晚快到点总被舍友叫去上课，浑浑噩噩，像是丢了魂一般，不想回忆自己当时多惨，只记得在众人面前丢尽了脸，喝酒吐的一塌糊涂，被舍友搀扶去睡觉却又偏爱干净非得去洗澡。把自己一人关在卫生间，开着水龙头冲了半天导致舍友担心直接敲门问我是不是睡着了，我寻思着当时门要不是拴着估计要被阿猪这比踹开，那老子的清白岂不是全都毁了，怎么说当时老子还是个黄花大闺仔。记得阿猪当时扶着烂泥一般的我上了床，细心替我盖好被子，脑袋昏昏沉沉记不清其他细节，只记得做好一切后他嘟囔了一句，哎，不识货啊，明明挺好一男生。大概就是当时他的这些行为让我对这头猪还算比较有好感，以至于后面每每破事傻事总找我帮忙，老子也拉下老脸来帮他，亦或者总在宿舍打游戏摔键盘骂人吵我睡觉，几次百般忍无可忍想下去锤他猪头的时候还是按耐住了怒火。 第二天醒来后整个宿舍酒气弥漫，感觉挺不好意思的，赶紧收拾了一下，为了不吵到舍友睡觉就出门了。那时候已没有什么心思去做别的事，一有空就自己一人溜到后山坐着听歌。人总归是该成长的，就像当时受伤的手臂一样，从那之后我的心似乎也强大了一圈。 那就开始疯狂吧 —— 既然这样，那就开始疯狂吧。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"从小小少年到油腻大叔","slug":"11-从小小少年到油腻大叔","date":"2019-08-29T13:01:54.000Z","updated":"2020-07-29T09:23:33.815Z","comments":true,"path":"2019/08/29/11-从小小少年到油腻大叔/","link":"","permalink":"http://yoursite.com/2019/08/29/11-从小小少年到油腻大叔/","excerpt":"愿你出走半生，归来仍是少年。","text":"愿你出走半生，归来仍是少年。 掐指一算，竟然也快毕业一年了，从去年三月份开始实习工作至今，996的节奏，如今搞的身心俱疲，以前那个健壮如牛的我也变得弱不经风了，动不动偶感风寒就得去掉半条命，苟延残喘度日。 去年初，刚过春节就跟着老姐来了杭州，拿着不值一提的简历四处奔波，面试过程坎坷艰辛，从杭州这头倒腾到那头，公交车地铁自行车等各项交通工具都换乘个遍。面试中有提前让我写两页题，而后又出几个现场写，随后集群、分布式、中间件各种高难度提问的，哥，您是准备找一个五年工作经验二十四岁的大四实习生吗？记得当时那面试官双手交叉，一脸傲娇，一副高高在上的样子，老子心想，妈蛋，给老子offer，老子也不来了，谁知道这比最后居然真给我offer了。相对于这高冷面试官不同的是。而我后面入职的那家公司面试经历却截然相反，记得刚去的时候前台小姐姐帮我倒了杯水，让我坐在那稍等一会，态度极其温和，当时第一印象就变得很好，面试官也是如此，平易近人，后面在代码注释中看到面试官给自己的名字为Steve，后文便以这个名字来称呼吧。两人聊了一会简历基本内容，Steve便出了一道简单简单的二叉树查找，直接接过纸笔取了个巧，递归三行代码搞定，想着是不是考我非递归，算了，先给他看看吧。他看着我写的题有些吃惊，哎，还是想简单了吗。 – 哎？你是来面试Java的吗？我看你用c++写的。内心一惊（我勒个去，平时在网上刷题有时候习惯了用c和c++，刚刚一时顺手直接给写上去了）。 – 那个，我是来面Java的，不好意思，平时刷题习惯了，Java的话直接把指针号改成点就好了。 – 嗯嗯， 那行，那我再给你出一题，关于链表的，balabala… 当时接过题目一看，嗯？感觉也挺简单的啊，稍加思考就把大概解法代码写上去，交给他后刚好一个电话接入，于是他便出去接电话了。趁着这个空闲时间，我赶紧再好好想想题目是否还有别的解法，不然这么简单的题怎么能证明自己，所幸等了几分钟他接完电话回来的时候我又想到了另一种解法，便说了出来。似是满意笑了笑便没有再问我技术类问题，聊了聊一些别的便让我走了。嗯？你怎么不按套路出牌，也不问问我集合底层实现、框架技术以及虚拟机之类的，我准备得很充分的。当时心想，什么鬼，面试这么简单，给我offer我也得考虑要不要来，于是乎内心一脸傲娇地离开了。 傲娇归傲娇，总不能太挑三拣四的，感觉创始人以及未来趋势都很不错，于是乎就选择去了后一家公司，嗯，真香。于是乎我就成了那种回家亲戚问我做什么的，遂回答，IT，计算机相关的，亲戚如有所思地来一句，哦，那就是修电脑的啊。嗯，差不多吧。 算起来如今已经工作一年了，在这一年就业时间内，大概最忙的时候就属我实习期了。拿着微薄工资，从早到晚，踏着晨曦出门，夜半三更回家，尽心尽力，还整日自得其乐。刚开始倒并不是如此，记得刚开始上班前几天，貌似是第一个周四，晚上回到家把书包一丢，累得瘫在椅子上，开始抱怨我不想做这行了，我想辞职，这钱我不要了，反正也没几块钱，好累啊，赚不动，赚不动。老姐端出一碗热面，先吃点东西吧，立马又来了劲，一阵狼吞虎咽，吃完以后一觉醒来第二天感觉自己又是个好汉，背着书包开开心心去上学去了，啊呸，上班，现在想想我这叼毛真是耐操。 当时因为总公司在北京，杭州这是新成立的研发中心，所以掐指一算，开发除了总监外，跟我一起当天入职的还有一个实习生以及一个五年工作经验的大佬，当时钉钉一投影，云平台架构出来，总监指点江山，我们要做这个东西，我转过头掰掰手指头一一算，就我们三愣头青？行吧，别把实习生不当干粮，于是乎总监写起了任务分配调度系统，五年大佬写起了工作流系统，我和另一个叼毛写起了存储以及任务推送系统，刚开始时候发现另一个叼毛连基本简单代码都不会写，帮他把单元测试模版写好，结果这比也看不懂，我也渐渐开始怀疑人生了，这样下去真的行吗。所幸后面慢慢开始步入正轨，虽然累了点，但总算是把雏形打出来了。 记得那时候向学校申请了在外做联合毕业设计，就是基本上属于在答辩之前可以不用回学校，几个玩的比较好的基友基本上都是如此，只剩老冯几人天天在学校无所事事，据说小鸡巴这笔害人不浅，白天便是陪女朋友出去逛街或是呆图书馆，晚上回来后又拉着几人躲在宿舍，玩着吃鸡，每天直到深夜总是会暖心煮点粥或者鸡蛋，大家分而食之，吃完又他妈继续嗨。老冯大概每天早上醒来想起在外实习的我们，再看看睡到大中午的自己，总会感觉自己挺颓废，但是玩起游戏来立马又抛却所有烦恼，我是谁，我在哪？大概是所有人都逃不过真香定律。 那时候与学校的联系全靠老冯了，与指导导师的沟通的也全靠这快递员，老冯时常跟我抱怨自己就是早不忙晚慌张，毕业答辩越来越近，这家伙也不再关心别的，对我说的最多大概就是突然弹出一个，先生，救我。我立马又知道这笔肯定又是代码跑不通了，遂回一句，你他妈截图啊，balabala，老冯总会来一句，真他吗神奇？ 终于等到了回学校的日子，感觉异常亲切，就像是回家一样，实习工作真的感觉好累啊，怀念以前那个悠闲自在的学校时光啊，所以一路七八小时的高铁也异常快就过去了，记得给二狗子们准备了一堆吃的，其中记忆深刻的要属于狗屎糖了，但却也忘记味道如何了，终究一切都被时间淡化在风中。 毕业的过程算是有趣又心累，从五月初回学校开始写毕业设计以及论文，到五月底基本上结束，总是担心毕设以及论文做不完，只能每天上午早起背着小书包去图书馆，趁着思路清晰时写写前界面，到了饭点总被老冯叫赶紧回来吃饭，被训斥又在图书馆偷偷努力学习？毕业设计以及论文来来回回修改烦心之极，然而担心的答辩也顺利地过去了，以及后面几行人张家界之旅，嘻嘻哈哈又累的要死要活算是对大学生活画上了完美的句号。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"19年-心路历程","slug":"09-19年-心路历程","date":"2019-08-21T12:56:52.000Z","updated":"2024-03-17T14:23:45.448Z","comments":true,"path":"2019/08/21/09-19年-心路历程/","link":"","permalink":"http://yoursite.com/2019/08/21/09-19年-心路历程/","excerpt":"毕业做程序员的第二年，没日没夜996加班的第二年，有时候我会觉得很丧，有时候又觉得好像对未来充满希望，但是平均下来，感到绝望的日子好像确实更多一些。","text":"毕业做程序员的第二年，没日没夜996加班的第二年，有时候我会觉得很丧，有时候又觉得好像对未来充满希望，但是平均下来，感到绝望的日子好像确实更多一些。 2019-08-14 晴空万里 想一想从学校毕业已经整整一年了，在这家公司每天加班到9点的日子也已经过了一年半了。感觉自己依旧没什么成就，感觉特别丧。且先来说说近况吧，碰巧那段时间新接了一个项目，预期三个星期，从零开始的一个项目，三个后端开发，我被分配到任务并不是很难，但是内容却不少，都是一些繁琐的工作。 但是着手开始做以后我发现并没有那么简单，所以导致当时一个月不到的时间，经常加班到十点十一点，所以上一个月时间，我设计新增了十几张数据表，编写了二十几个接口，七八个跟业务相关的微信消息通知，两个微信消息模板，累出屎来。 最近一个新需求，只是版本迭代，并没有多少活，噼里啪啦一天就写完代码，还能划水两三天，突然闲下来，什么也不想做，感觉异常丧，不知为何，对于生活的一切都感觉很绝望。虽然才24岁，但总觉得自己一辈子好像也就这样了，没有多大出息，特别平凡的一生，就像那种一点不起眼的沙丁鱼。 前两天家里一个挺好的基友兄弟突然走了，工作时不小心触电身亡，真希望这是个噩梦，明明才28岁，正值年少，说没就没了。以前的日子好像也才过去没多久，每次在家总会一起喝酒，摇骰子很厉害，喝酒也是如此。我们几个总被喝到吐了才罢休，但记得有那么一两次，我们也是手感好到不行，每每针对我们几个的你也被喝到怀疑人生。我想不通，明明这些记忆还这么清晰，怎么突然就发生这种意外。我甚至觉得这是一个巨大的玩笑和捉弄人的把戏，等我几个月后春节一回家，你又骑着那轰轰轰的摩托车赶过来，坐在旁边抽着烟摇着一副骰子，气势汹汹地跟我喊道三个六，等我说出你出意外的疑问，你骂骂咧咧吼道，谁他妈说的，老子不锤死他。 可是，好像这不是噩梦，你真的就这样离开了。对此，我好像也只能说一句，兄弟，一路走好，来世有机会一定把以前没喝的酒补上。 2019-08-19 天气渐凉转秋 头晕头晕，昨晚喝太多酒又两点多才睡，搞得今天全程头晕看不进任何东西，几行代码反复几遍也愣是没弄懂啥意思。组长又让我指导那实习生修改一个bug，哎，这小子做事实在是太糙了，生怕他搞出什么大问题来。昨天打球浑身酸痛的感觉还未褪去，很舒服，喜欢这种疼痛感，让我觉得自己还是个有血有肉的人，而不是整天浑浑噩噩像个行尸走肉。 2019-08-21 晴 最近工作还是比较忙的，感觉有些疲惫，可生活不就是这样，起起落落落落落落……，天气有些转凉，好像突然间就有些小感冒了，咽喉炎又有些严重起来。 不过感觉秋天就要来了，感觉还是开心的。秋高气爽，中秋也快到了，不用独自赏月，算起来，好像孤孤单单过中秋已经很多很多年了，以前初高中时就自己一个人在家，每每望着月亮发呆也不错。 2019-08-25 晴 突然就秋天了啊，一年四季，春去秋来，感觉眨眼之间，日复一日，年复一年。除了天气变凉爽之外，感觉心情也变得很复杂，说也说不清楚，自己也不了解到底在想什么，但总是觉得颇有感触。伤春悲秋不知道是不是大家都有的情绪，但貌似刚入秋，我的心情就一落千丈，总是抱着一些奇奇怪怪的想法，说不上来是什么，但心里总是空落落的，就像是丢失了什么东西似的。 有些事好像突然就过去五年七年了，和朋友提及，感觉就像是在诉说别人的经历，那时候的自己感觉异常陌生，就像不是自己经历的，记忆说淡又很淡，说深好像又很深。似乎长这么大以来，许多的大事都发生在秋天，那些改变累加在一起形成了现在的我。 过去的每一个秋天似乎是悲喜交加，大喜大悲到最后的平淡孤独，像是把人生都过完了一般。虽说最近工作还是蛮忙的，但是刚刚还是忙里偷闲下楼买了个糖果，一阵阵微风袭来，突然感觉好治愈，像是特别自由的味道，要是我也可以张开翅膀，一定立马迎着这阵风飞出这杭城去看看。 从高考完以后去湖南上学，整个人就像被困在湖南，很少回家，对于自己的理由总是距离远，其实大概原因还是因为意懒吧，很习惯待在某个地方，长久以往便不愿意动了，如今来了杭州工作以后也是如此，一年回家一两次，不管是人或者事，都越发变得陌生了，而在这我也并找不到自己的归属，好像慢慢的自己变成了没有归属的流浪儿，这种心情不清楚别人是否也会有，就像是自己似乎都不属于两地。 很多时候夜里都喜欢靠在窗户边看着天空，虽然什么都没有，但就这样静静听着歌，心里也是莫大安慰，既然觉得孤单，那就用自己喜欢的方式陪陪自己。无需多言，安安静静待一会也许就好多了。虽说有些时候总是感到委屈，容易酸鼻子，似乎不太像个男生，倒像是个爱哭鼻子的小女生，但在眼泪流出时总能将其逼回，似是什么都未曾发生。也不想再和别人诉说，每个人都有自己的难处，管好自己的事就好了，无需再与别人徒添烦恼。 2019-10-09 晴 感觉自己是个容易胡思乱想的人，感觉毕业后大家各奔东西，本来当时和最好的兄弟老冯一起来了杭州，想着两个人一起在杭州好好奋斗，有空还可以约着一起玩。却不曾想后面突然有一天他对我说，改天请你吃个饭吧，我买了回贵阳的车票，准备周一回去。一时间挺突然的，也不知道说什么，便回答了句行，那个周末一起出去吃了顿火锅，喝了些酒。好像接下去又该自己一个人了呢，小灰灰离得不远不近，但在一起时间也并不多，偶尔约着打打球，但却总嫌太远倒也算在杭州。可前不久似乎也准备离开杭州去深圳发展，本来几个玩得很好的前同事年初也离职去了成都深圳，人生真是在不断分别中草草度过了，回过头来，前两年、前一年在自己身边的很多人如今都不在了，依旧孤身一身，所以又回归为一个人吃饭上下班，基本上没有什么业余生活，有的只是坐在电脑面前敲着键盘回复着哈哈哈，一切的嬉戏玩笑都成了键盘噼里啪啦的敲击声。 自己似是又变了一个人，又从以前积极阳光的态度变为伤春悲秋的多愁善感少年了，其实真没必要太过在意聚合离散，本就是人生常态，还是要以平常心处之。 2019-10-10 晴 19年突然到了最后一个季度，最后三个月过完就又是新的一年了，今年貌似并没有达到自己想要的目标，虽然在公司感觉确实成为了骨干，工资也涨到超出期待，可似乎好像也就这样了，孤孤单单地又度过一年，没有什么特别值得怀念的回忆时刻，掐着指头算算，好像也就只有几个和姐姐在一起欢乐的时光片刻。 时间随着长大也跑的越来越快了，好像还不等我努力达到各个目标，只是埋头朝前飞快赶去。以前的同学以及朋友一个个开始订婚结婚，感觉就像是同一场考试快结束，大家开始陆陆续续交卷了，但我呢，还在犹犹豫豫，还有几道题，似乎确定了答案，但总觉得不太对劲，坐在位置上既不能想出别的解法说不上哪里不对劲，又不敢交卷，监考老师却总是绕着我来来回回反复念叨，做完了的同学就早点交卷啊。真的做完了吗，总是翻来覆去这里看看，那里瞅瞅，总觉得有些不够满意，但是却好像也束手无策了，看着窗外交卷的同学们一个个喜笑颜开，应该都考的不错吧，或者说不管考的如何，总算是考完了松了一口气了，便不再去想这些事了。 2019-10-17 其实今早心情和现在反差极大，原因也是简单，一梦一天堂，一句一地狱。地狱的事暂且不提，没人喜欢消极人生，再好的朋友也会厌倦你的烦恼和抱怨，愿自己永远只对外人展现出自己阳光积极的一面，毫无阴暗寒冷，沮丧失落。 今早做梦，梦到了大学时候的一群好基友，很全面，差不多都在梦境中了。有搂着女朋友甜甜腻腻的渣男鹏，并肩走着面无表情的高冷蒋和笑嘻嘻的少儿龙，有让我带衣服给渣男鹏的操心祥，有请我喝饮料的沙雕猪，有刚从食堂出来的穿着拖鞋短裤屌丝段子冯、啰嗦灰以及二人转组合的杰伦殷和长腿宁，躲藏在最后的是长沙富二代的低调王和205工作室游戏直播达人的正经季。打开冰箱发现老冯塞满了一冰箱的衣服，一脸懵逼，是要把衣服保鲜的骚操作？貌似我是从别处过去，一到的第一个问题便是问我有没有爬泰山？沉思良久，我也不知道为什么会有这个问题，毕竟我们以前爬山爬到后面好像明明开玩笑计划约的是珠峰，还说要团购氧气瓶，记得突然有一天，低调王慌里慌张地闯入我们宿舍，不安对我说新闻说以后珠峰要开始收费了，神经兮兮搞得有那么一瞬间我也担心收费了买不起这么贵的门票咋整，其实245工作室或者基友大队队员们个性鲜明，说起来错过了今年国庆的会晤倒有点小可惜了。 醒来后感觉似乎一切又是那么充满希望，整个人活蹦乱跳又像是个孩子，一路飞奔下楼，即使生活再狗屎不济，只要活着，就一定要永远积极阳光。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"电影小感","slug":"06-电影小感","date":"2019-08-19T12:13:34.000Z","updated":"2020-08-01T02:12:51.330Z","comments":true,"path":"2019/08/19/06-电影小感/","link":"","permalink":"http://yoursite.com/2019/08/19/06-电影小感/","excerpt":"生活如戏，我想陪你走到江湖散场。","text":"生活如戏，我想陪你走到江湖散场。 我也不知道为什么一上来就是一部动漫，其实我以前的想法和老爹很相似，动漫＝动画片＝小孩子，所以一直感觉不屑一顾。但是突然就被带偏了，虽然教会我看动漫的那个人早就不在身边了，但好像我也就因此喜欢上了这些简单的小东西，大概是看动漫的时候我也感觉自己像个小孩子，所以感到无穷开心。 龙猫 宫崎骏的动漫总是略带一些成长和感触的味道，不知道看过几遍龙猫，整体的感觉是给人欢乐和愉快的。草壁皋月是一个虽然年龄不大但却懂事并让人心疼的姐姐，母亲住院期间，操持家中事务并照顾妹妹草壁米，坚强并且乐观积极向上。 而妹妹草壁米也是个性格活泼，善于观察周遭有趣事物的小女生，但常因冒失的举动让姐姐担心。彼此成长过程中总是难免遇到挫折和矛盾，但却都怀着一颗善待世界的心，所以也被世界温柔回待。 萤火之森 我有多渴望拥抱你，就有多害怕失去你。 千与千寻 人生如逆旅，你总要自己一个人朝前走去，不管是谁都不可能永远陪在你身边，所有人都只是你生命旅途中的过客罢了，到站了也就下车了，来来往往，该淡忘便淡忘了吧，不要回头，一直走下去。 悬崖上的金鱼姬 喜欢是件很单纯简单的事\b儿，我喜欢你，\b所以去找你的时候都是跑着去的。 起风了 起风了，唯有努力飞翔才能生存。","categories":[{"name":"情感","slug":"情感","permalink":"http://yoursite.com/categories/情感/"}],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"电影","slug":"电影","permalink":"http://yoursite.com/tags/电影/"}]},{"title":"有待提高","slug":"04-有待提高","date":"2019-08-14T11:45:24.000Z","updated":"2024-04-02T17:14:55.330Z","comments":true,"path":"2019/08/14/04-有待提高/","link":"","permalink":"http://yoursite.com/2019/08/14/04-有待提高/","excerpt":"本文主要记录一些作者想做或者要做的事，其中包括技术，也包括生活等。生活总要满怀期待和目标，才能尽自己所能向着未来冲去，一步步收齐经验值总会升级最后一刀砍死大boss。","text":"本文主要记录一些作者想做或者要做的事，其中包括技术，也包括生活等。生活总要满怀期待和目标，才能尽自己所能向着未来冲去，一步步收齐经验值总会升级最后一刀砍死大boss。 技术 Java Netty Jetty Gradle NIO 以及 NIO中文乱码相关问题 消息队列 跳跃表 Kafka 研究Dubbo源码 Python 熟悉 python2 语法，基本编码无障碍 学习 Python3 语法，学会使用图表分析相关库 实现爬虫抓取图片网站 项目经验 总结Redis 总结微信消息等 LocalDataTime等相关博客 总结登记工作站，其中包括数据库设计、分诊、排队号生成和ris、weixin、qa系统间调用逻辑等 Mybatis二级缓存 生活 重拾日记习惯 持续旅行 爬一次黄山 去一次乌镇，走一遍夜晚的江南水乡 [ ] 书籍 技术 Java8实战 Redis设计与实现 深入解析Spring源码 Netty实战 [ ] 文学 阿Q正传 我不 老子传 秘密 白夜行 嫌疑人X的献身 恶意 新参者 白鹿原 孝经 红手指 堂吉柯德 兄弟 [ ] loading…","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"待办事项","slug":"待办事项","permalink":"http://yoursite.com/tags/待办事项/"},{"name":"规划","slug":"规划","permalink":"http://yoursite.com/tags/规划/"}]},{"title":"那些让我静下心来和静不下心来的声音","slug":"07-那些让我静下心来和静不下心来的声音","date":"2019-08-13T12:42:02.000Z","updated":"2022-05-11T11:46:31.795Z","comments":true,"path":"2019/08/13/07-那些让我静下心来和静不下心来的声音/","link":"","permalink":"http://yoursite.com/2019/08/13/07-那些让我静下心来和静不下心来的声音/","excerpt":"我喜欢听歌，从很久很久以前，陪着我一起长大的老歌都和我的记忆绑在了一起，偶然间听到熟悉的旋律记忆也就被同时唤醒了，某段时光、某段记忆、某段旋律交织，总会让我心从各种情绪中变换。","text":"我喜欢听歌，从很久很久以前，陪着我一起长大的老歌都和我的记忆绑在了一起，偶然间听到熟悉的旋律记忆也就被同时唤醒了，某段时光、某段记忆、某段旋律交织，总会让我心从各种情绪中变换。 梦中的婚礼以及雪之梦对于我的经历来说很是复杂，梦中的婚礼应该是有人对我说过很喜欢这首钢琴曲，未接触纯音乐，当时听了感觉也是一般。但却忘记后面不知道怎么就越听越多，倒也就喜欢上了。雪之梦倒是初听便喜欢上了，每当听到这首歌，就像雨过天晴的周日下午，身心愉悦地走在一个满眼绿色的森林公园，即使是炎热的夏天，也能感到阵阵凉快的清风，没有一丝烦恼，只是与一好友慢慢散着步，谈天说地，幻想未来，别走那么快，等等我。 但是这两首歌听着听着情绪总会越来越复杂，原因并不在音乐本身，大概是因为自己记忆被这首歌拉回来的时候并不是太过于美好，但记忆毕竟太过于久远了，一股陈旧的味道总在慢慢散开去，大多数事情已经变味了。 新版的笑傲江湖热播的时间大概是在我高三并且接近高考那段时间里，记得那时候即使是临近高考了，依旧用手机追着这部剧，喜欢东方姑娘的干脆洒脱，对待感情认真专一，可以为令狐冲舞剑、陪他喝酒、替他打架出头、杀雪狼取胆，俘获观众心无数。然而令狐冲渣渣，结局没办法接受。 如若此生能得一人似东方姑娘，愿抛弃一切，就这样笑傲江湖。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"音乐","slug":"音乐","permalink":"http://yoursite.com/tags/音乐/"}]},{"title":"Git使用心得","slug":"08-Git使用心得","date":"2019-08-13T06:13:58.000Z","updated":"2020-07-29T09:23:07.658Z","comments":true,"path":"2019/08/13/08-Git使用心得/","link":"","permalink":"http://yoursite.com/2019/08/13/08-Git使用心得/","excerpt":"本文主要记录一些Git使用过程中心得。","text":"本文主要记录一些Git使用过程中心得。 初始化仓库：git init 新建远程仓库：git remote add origin url 添加全部文件：git add . 推送至远程仓库：git push origin master 强制推送至远程仓库（慎用）：git push -f origin master 从远程仓库拉取同步：git pull origin master 场景： —— 当存在多个分支时，本地提交的代码推送到另一个分支dev1中，但应该推送为dev2中 处理：先将代码分支切换到dev2，使用cherry pick，将需要的提交拣取过来；","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"Git","slug":"Git","permalink":"http://yoursite.com/tags/Git/"}]},{"title":"人生如逆旅","slug":"02-人生如逆旅","date":"2019-07-30T12:27:58.000Z","updated":"2021-06-15T16:27:50.665Z","comments":true,"path":"2019/07/30/02-人生如逆旅/","link":"","permalink":"http://yoursite.com/2019/07/30/02-人生如逆旅/","excerpt":"","text":"其实一直以来，或者说从小到大我便一直是个恋家的小屁孩。但是感觉人生从高中毕业开始就一直处于奔波状态，就像是一叶扁舟流入江流，随波逐流毫无目的地飘着。高考后看着电脑屏幕前刺眼的分数，行，这下玩完了，脑子里快速想过一百种该有的态度和感觉，但很难表达出来，说不出多难受，就是脑袋顿时有点懵，就像是很早起床冲刺跑了几百米似的，脑袋有些嗡嗡嗡不清醒。 记得那些年电影中沈佳宜在高考后哭的一塌糊涂，她说自己从小到大都只会念书，其他什么都不会，以后不知道怎么办了。大概那时候我的心态也是如此吧，虽说念书也一般，其他会些乱七八糟的奇淫技巧，但是总觉得都不是什么正经途径，还是读个好大学才能光宗耀祖、衣锦还乡。所以从看到成绩那时候我便一直呆坐在那，老姐看我像个傻子似的一时间也不知道说什么安慰我，所以晚饭便没有在家吃，就带我出去撸串了。大概情况是想灌我点酒发泄一下，别愣是憋坏了。 记不得点了多少串串，只记得那晚天刚开始黑。一开始我也是没啥胃口，但也并不是因为不饿，说不饿是假的，但是想一想，我这个情况好像确实应该很难受，要是还能嘻嘻哈哈好像还真的有点不太好意思，总要做做样子体现出自己很难受的感觉把。 不过想想好像也没得办法了，算了，该吃吃，该喝喝吧，于是就抓起串串倒上小酒开始吃了。 期间吃饭途中聊些不痛不痒的问题，没啥大碍，但突然被安慰到这件事，哇，忍不住了，眼泪跟夏天的雷阵雨一下，完全挡不住地哗哗往下流啊，人这种行为大概就像是小孩子摔倒了，如果周围没人也许他就自己默默爬起来拍拍土走了，但是如果父母一安慰，大概就是哭天抢地委屈地投入其怀抱。总之，不管外表异或性格多么坚强，内心总有一块柔弱似水。但我不一样，虽然早已泪痕满面，但依旧不吭一声，强忍着哽咽继续喝着酒嚼着串。老姐说了很多，但大多不太记得，不过唯有一句倒还是一直刻着——虽然你现在可能感觉很难受，但当你几年以后，或者也许就一年以后回过头来，你会发现，其实这些都是小事。 罢了，现在木已成舟，该怎么样还得咋样，日子还是得过。","categories":[{"name":"情感","slug":"情感","permalink":"http://yoursite.com/categories/情感/"}],"tags":[{"name":"散文","slug":"散文","permalink":"http://yoursite.com/tags/散文/"},{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"关于 Hexo+Gitub 搭建静态博客相关问题","slug":"03-关于 Hexo+Gitub 搭建静态博客相关问题","date":"2019-07-26T09:08:16.000Z","updated":"2024-05-22T17:47:11.482Z","comments":true,"path":"2019/07/26/03-关于 Hexo+Gitub 搭建静态博客相关问题/","link":"","permalink":"http://yoursite.com/2019/07/26/03-关于 Hexo+Gitub 搭建静态博客相关问题/","excerpt":"本文主要介绍如何搭建一个简单静态的个人博客网站，也不知道从什么时候开始非常喜欢写点东西，不管是一开始的各种乱七八糟心情，还是后面的乱七八糟技术点，感觉都是自己人生中挺不错的宝贵经验，所以喜欢记录下来，夜半无人时总是翻开看看自己成长历程。","text":"本文主要介绍如何搭建一个简单静态的个人博客网站，也不知道从什么时候开始非常喜欢写点东西，不管是一开始的各种乱七八糟心情，还是后面的乱七八糟技术点，感觉都是自己人生中挺不错的宝贵经验，所以喜欢记录下来，夜半无人时总是翻开看看自己成长历程。 搭建静态博客我们可以使用 Hexo+码云或者Gitub，两者都可以，但是作者选择的是码云，首先支持国产，其次Gitub有时候访问速度实在是不敢恭维。关于介绍如何搭建博客问题，这篇博客说的非常详细： 使用Hexo+Gitub搭建静态博客 因为作者也是照着这篇博客进行搭建的，所以这里就不把文章copy过来，这里说几个遇到的问题以及如何解决的就好了。 问题1：在本地启动后一切正常，但是部署到Gitub或者码云之后，css样式丢失。 通过 F12 发现所有获取 css 的路径错误，我的码云项目名为 static_blog ，但是 css 都少了这一层路径，例：https://lanxuewei.gitee.io/css/style.css，加上项目路径后为：https://lanxuewei.gitee.io/static_blog/css/style.css。访问正常，ok，说明起始路径有问题，找到项目根目录的 _config.yml 配置文件，其中： url: http://yoursite.com root: /static_blog 将 root 修改为你项目名称，重新部署就可以了。 问题2：使用 gittalk 作为评论系统，怎么配置，之前配置一直出现出初始化错误，或者加载错误之类的，总之就是配置项没弄好。 首先在 gitub 上申请账号，地址： https://github.com/settings/developers 申请过程中需要填写以下几项： Application name（这里我填写的项目名称，即 static_blog） Homepage URL（项目访问路径，例如：http://lanxuewei.gitee.io/static_blog/） Authorization callback URL（我也是填上面项目访问路径） 然后填写 gittalk 配置项 gitalk: # gitub用户名 owner: lanxuewei # 存放评论的项目名，可以使用你的项目（gitub上的），也可以在gitub上新建一个 repo: blog_comment # 在上面申请完成后会有 client_id 和 client_secret，用于认证 client_id: cb2v50e33bb2ds26bxxx client_secret: 8e3e3a79247b2c809c7152308xxxxxxxxxxxxxx 其中 owner 以及 repo 我之前一直弄错，所以导致一直没办法加载成功，最后加载成功以后，需要使用自己的账号登录初始化。 问题3：一切都完成以后，使用了一个新主题，不知道怎么定义标签以及将标签和文章进行关联？ 这个问题当时很头疼，但其实是自己不认真，在之前那篇搭建博客文章中说的很清楚，在写博客过程中，需要在博客头加上： 12345678910---title: #文章标题date: #文章日期tags: #文章标签categories: #文章分类--- 这里填写之后，自动会生成标签以及分类，我擦，这么简单，当时搞死老子了。 还可以添加摘要，只要在博客头加上： 摘要：一帆风顺的自己，还是要多摔几跤才会好好走路，不然总以为上天总在眷顾。&lt;!-- more --&gt; 问题4：如何将文章置顶？ 1、修改支持置顶的仓库，卸载重新安装，命令如下： npm uninstall hexo-generator-index –save npm install hexo-generator-index-pin-top –save 2、在文章头中添加 top: true -– title: Hexo + GitHub 搭建静态博客 date: 2019-06-12 12:00:25 categories: 技术 top: true -– 目前为止，置顶功能已经完成了，但是文章只是被置顶了，没有置顶标志，可以通过修改主题中源码进行添加。这里作者使用的是 indigo-card 主题，修改主题目录下 /layout/_partial/index-item.ejs 和 post.ejs 文件，将 … 修改为如下内容： 1234567891011&lt;div class=\"post-meta\"&gt; &lt;!-- 置顶 --&gt; &lt;% if(post.top)&#123; %&gt; &lt;i class=\"fa fa-thumb-tack\"&gt;&lt;/i&gt; &lt;font color=7D26CD&gt;置顶&lt;/font&gt; &lt;span class=\"post-meta-divider\"&gt;|&lt;/span&gt; &lt;% &#125; %&gt; &lt;%- partial('post/date', &#123;date_format: config.date_format&#125;) %&gt; &lt;%- partial('post/category') %&gt; &lt;%- partial('plugins/page-visit') %&gt;&lt;/div&gt;","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://yoursite.com/tags/Hexo/"},{"name":"博客","slug":"博客","permalink":"http://yoursite.com/tags/博客/"}]},{"title":"Hello World","slug":"01-hello-world","date":"2019-07-26T08:26:36.000Z","updated":"2019-07-26T08:26:36.000Z","comments":true,"path":"2019/07/26/01-hello-world/","link":"","permalink":"http://yoursite.com/2019/07/26/01-hello-world/","excerpt":"摘要：一帆风顺的自己，还是要多摔几跤才会好好走路，不然总以为上天有所眷顾。","text":"摘要：一帆风顺的自己，还是要多摔几跤才会好好走路，不然总以为上天有所眷顾。 Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"情感","slug":"情感","permalink":"http://yoursite.com/categories/情感/"}],"tags":[{"name":"散文","slug":"散文","permalink":"http://yoursite.com/tags/散文/"},{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]}]}