{"meta":{"title":"空谷小屋","subtitle":"空山新雨后，天气晚来秋","description":"一步步记录自己走过的路罢了","author":"lanxuewei","url":"http://yoursite.com","root":"/static_blog/"},"pages":[{"title":"","date":"2019-09-09T10:56:43.876Z","updated":"2019-05-28T15:58:00.000Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"","date":"2019-09-09T10:56:43.876Z","updated":"2019-05-28T15:56:56.000Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"操作日志-设计与实现","slug":"13-操作日志-设计与实现","date":"2020-01-04T06:03:28.439Z","updated":"2020-01-04T09:35:49.158Z","comments":true,"path":"2020/01/04/13-操作日志-设计与实现/","link":"","permalink":"http://yoursite.com/2020/01/04/13-操作日志-设计与实现/","excerpt":"","text":"一、背景以及需求说明 后台管理端的每次关键操作都需要有日志可追溯，可查询操作情况，即记录操作人在何时进行了某项操作，成功或者失败情况等，类似如下： 蓝小伟删除神奇宝贝机构下王小伟用户 其中主体内容可以分为几个部分，采用表格形式进行展示，具体详情如下： 操作人 操作人角色 操作人手机号 操作类型【新增、修改、删除等】 操作对象【用户、角色、机构等】 操作时间 二、设计（一）、方案设计方案一：采用全局拦截器，通过拦截请求，获取请求接口地址，匹配对应url-接口描述得到操作详情，但是这种方式需要配置url-接口描述字典且没办法获取操作对象详情等。 优点：统一处理，较为方便，如事先配置好接口地址对应的详情即可，如 /zoo/add 对应【新增动物园】； 缺点：缺乏灵活性，且获取接口中详细信息较为困难，需配置对应的接口-详情字典表，且当接口修改更新后需要及时同步，否则会出现记录日志与实际操作有所出入； 方案二：设计注解和切面采集日志，切面采用环绕切面，首先在函数执行前收集参数信息，其次执行函数获取返回值或异常信息，最后整合操作日志信息写入数据库中。 优点：较为灵活，需要的接口直接添加即可，不需要配置字典，可以获取业务中部分细节内容。 缺点：需要添加接口较多时比较繁琐。 注意点： 1、分析参数时需考虑参数对象以及Json对象，过滤掉 HttpServletRequest 以及 HttpServletResponse 等相关参数，需要的参数对象采用反射方式获取参数值，Json对象通过直接获取。 2、操作日记采集应尽量不影响原接口返回时间以及结果等。 3、当方法调用异常时需要记录异常信息等。 通过比较，因为此需求对于操作详情要求较高，方案一比较达不到要求，方案二可以实现，并且更加灵活，所以采用方案二实现；后续将对此进行更加详细设计； （二）、流程设计 注解以及切面设计流程图如下： 采用加注解方式，注解拥有以下参数： 1、接口描述【新增用户、新增角色等】-必选； 2、操作对象类型【用户、机构、角色等】-必选； 3、操作者手机号【一般通过Token获取操作者身份，但是登陆时无缓存，直接通过手机号查找操作人详情】-可选，默认为空； 4、操作对象Id参数名【通过对象Id参数名获取具体参数值】-可选，默认为空； 5、操作对象名【新增时数据库并无操作对象信息，直接通过该字段获取】-可选，默认为空； 6、操作对象所属机构【操作用户、角色等时需记录被操作对象的所属机构】-可选，默认为空； 7、异步记录【默认采用异步方式，可修改为同步方式，如修改、删除等操作，需要提前记录则采用同步方式，否则异步记录，数据已被更改，操作日志不准确】-可选，默认为空； （二）、代码设计 部分代码设计如下： OperationLog ：操作日志注解【在函数头中添加，进行切面拦截以及参数名获取等】 OperationLogAspect： 操作日志切面【切面拦截执行函数，获取函数入参、执行情况等】 OperationLogService： 日志相关业务接口【用于分析参数保存日志等操作】 HandlerFactory： 操作对象处理器工厂【用户根据操作对象类型获取对应的操作对象处理器】 UserHandler 、 OrgHandler、 RoleHandler ：具体操作对象处理器【比如用户处理器，即通过Id查询用户表，获取用户详细信息等，可扩展】","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"日志记录","slug":"日志记录","permalink":"http://yoursite.com/tags/日志记录/"},{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"}]},{"title":"从小小少年到油腻大叔","slug":"11-从小小少年到油腻大叔","date":"2019-08-29T13:01:54.000Z","updated":"2019-11-07T14:11:46.080Z","comments":true,"path":"2019/08/29/11-从小小少年到油腻大叔/","link":"","permalink":"http://yoursite.com/2019/08/29/11-从小小少年到油腻大叔/","excerpt":"愿你走过半生，归来仍是少年。","text":"愿你走过半生，归来仍是少年。 掐指一算，竟然也快毕业一年了，从去年三月份开始实习工作至今，996的节奏，如今搞的身心俱疲，以前那个健壮如牛的我也变得弱不经风了，动不动偶感风寒就得去掉半条命，苟延残喘度日。 去年初，刚过春节就跟着老姐来了杭州，拿着不值一提的简历四处奔波，面试过程坎坷艰辛，从杭州这头倒腾到那头，公交车地铁自行车等各项交通工具都换乘个遍。面试中有提前让我写两页题，而后又出几个现场写，随后集群、分布式、中间件各种高难度提问的，哥，您是准备找一个五年工作经验二十四岁的大四实习生吗？记得当时那面试官双手交叉，一脸傲娇，一副高高在上的样子，老子心想，妈蛋，给老子offer，老子也不来了，谁知道这比最后居然真给我offer了。相对于这高冷面试官不同的是。而我后面入职的那家公司面试经历却截然相反，记得刚去的时候前台小姐姐帮我倒了杯水，让我坐在那稍等一会，态度极其温和，当时第一印象就变得很好，面试官也是如此，平易近人，后面在代码注释中看到面试官给自己的名字为Steve，后文便以这个名字来称呼吧。两人聊了一会简历基本内容，Steve便出了一道简单简单的二叉树查找，直接接过纸笔取了个巧，递归三行代码搞定，想着是不是考我非递归，算了，先给他看看吧。他看着我写的题有些吃惊，哎，还是想简单了吗。 – 哎？你是来面试Java的吗？我看你用c++写的。内心一惊（我勒个去，平时在网上刷题有时候习惯了用c和c++，刚刚一时顺手直接给写上去了）。 – 那个，我是来面Java的，不好意思，平时刷题习惯了，Java的话直接把指针号改成点就好了。 – 嗯嗯， 那行，那我再给你出一题，关于链表的，balabala… 当时接过题目一看，嗯？感觉也挺简单的啊，稍加思考就把大概解法代码写上去，交给他后刚好一个电话接入，于是他便出去接电话了。趁着这个空闲时间，我赶紧再好好想想题目是否还有别的解法，不然这么简单的题怎么能证明自己，所幸等了几分钟他接完电话回来的时候我又想到了另一种解法，便说了出来。似是满意笑了笑便没有再问我技术类问题，聊了聊一些别的便让我走了。嗯？你怎么不按套路出牌，也不问问我集合底层实现、框架技术以及虚拟机之类的，我准备得很充分的。当时心想，什么鬼，面试这么简单，给我offer我也得考虑要不要来，于是乎内心一脸傲娇地离开了。 傲娇归傲娇，总不能太挑三拣四的，感觉创始人以及未来趋势都很不错，于是乎就选择去了后一家公司，嗯，真香。于是乎我就成了那种回家亲戚问我做什么的，遂回答，IT，计算机相关的，亲戚如有所思地来一句，哦，那就是修电脑的啊。嗯，差不多吧。 算起来如今已经工作一年了，在这一年就业时间内，大概最忙的时候就属我实习期了。拿着微薄工资，从早到晚，踏着晨曦出门，夜半三更回家，尽心尽力，还整日自得其乐。刚开始倒并不是如此，记得刚开始上班前几天，貌似是第一个周四，晚上回到家把书包一丢，累得瘫在椅子上，开始抱怨我不想做这行了，我想辞职，这钱我不要了，反正也没几块钱，好累啊，赚不动，赚不动。老姐端出一碗热面，先吃点东西吧，立马又来了劲，一阵狼吞虎咽，吃完以后一觉醒来第二天感觉自己又是个好汉，背着书包开开心心去上学去了，啊呸，上班，现在想想我这叼毛真是耐操。 当时因为总公司在北京，杭州这是新成立的研发中心，所以掐指一算，开发除了总监外，跟我一起当天入职的还有一个实习生以及一个五年工作经验的大佬，当时钉钉一投影，云平台架构出来，总监指点江山，我们要做这个东西，我转过头掰掰手指头一一算，就我们三愣头青？行吧，别把实习生不当干粮，于是乎总监写起了任务分配调度系统，五年大佬写起了工作流系统，我和另一个叼毛写起了存储以及任务推送系统，刚开始时候发现另一个叼毛连基本简单代码都不会写，帮他把单元测试模版写好，结果这比也看不懂，我也渐渐开始怀疑人生了，这样下去真的行吗。所幸后面慢慢开始步入正轨，虽然累了点，但总算是把雏形打出来了。 记得那时候向学校申请了在外做联合毕业设计，就是基本上属于在答辩之前可以不用回学校，几个玩的比较好的基友基本上都是如此，只剩老冯几人天天在学校无所事事，据说小鸡巴这笔害人不浅，白天便是陪女朋友出去逛街或是呆图书馆，晚上回来后又拉着几人躲在宿舍，玩着吃鸡，每天直到深夜总是会暖心煮点粥或者鸡蛋，大家分而食之，吃完又他妈继续嗨。老冯大概每天早上醒来想起在外实习的我们，再看看睡到大中午的自己，总会感觉自己挺颓废，但是玩起游戏来立马又抛却所有烦恼，我是谁，我在哪？大概是所有人都逃不过真香定律。 那时候与学校的联系全靠老冯了，与指导导师的沟通的也全靠这快递员，老冯时常跟我抱怨自己就是早不忙晚慌张，毕业答辩越来越近，这家伙也不再关心别的，对我说的最多大概就是突然弹出一个，先生，救我。我立马又知道这笔肯定又是代码跑不通了，遂回一句，你他妈截图啊，balabala，老冯总会来一句，真他吗神奇？ 终于等到了回学校的日子，感觉异常亲切，就像是回家一样，实习工作真的感觉好累啊，怀念以前那个悠闲自在的学校时光啊，所以一路七八小时的高铁也异常快就过去了，记得给二狗子们准备了一堆吃的，其中记忆深刻的要属于狗屎糖了，但却也忘记味道如何了，终究一切都被时间淡化在风中。 毕业的过程算是有趣又心累，从五月初回学校开始写毕业设计以及论文，到五月底基本上结束，总是担心毕设以及论文做不完，只能每天上午早起背着小书包去图书馆，趁着思路清晰时写写前界面，到了饭点总被老冯叫赶紧回来吃饭，被训斥又在图书馆偷偷努力学习？毕业设计以及论文来来回回修改烦心之极，然而担心的答辩也顺利地过去了，以及后面几行人张家界之旅，嘻嘻哈哈又累的要死要活算是对大学生活画上了完美的句号。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"大学游记","slug":"12-大学游记","date":"2019-08-29T13:01:54.000Z","updated":"2020-02-25T06:56:53.659Z","comments":true,"path":"2019/08/29/12-大学游记/","link":"","permalink":"http://yoursite.com/2019/08/29/12-大学游记/","excerpt":"算是一场梦的旅行","text":"算是一场梦的旅行 离开 —— 我以为只是短暂离开，却没曾想许多人都好像就此告别你的人生，不再参与，再见时已形如陌路。 说起来对于上大学这件事好像来得很突然，前事不提，只记得当时收到通知书的时候并没有特别大感觉，只是觉得也就这样，换个地方继续上学罢了，并无特别大期待，因为要离开家很远，丢掉家里所有的朋友，离开这个熟悉的地方，甚至有些担忧，没有旧友的日子，又该重新混熟一堆伙伴，也不知道能不能遇到与自己一拍即合的挚友。 高考完后的三个月一晃而过，拿到录取通知书到开学也是紧接而至，日子好像突然就近了，老爸已经提前安排买好车票了，衣服什么的也伴随着老妈的唠叨嘱咐一件件被塞进了行李箱中，看着塞得满满的行李才真真切切感觉到自己这次是离家很远并且会很久不会回来。虽然什么都不需要做，只是默默看着被收拾好的一切，似乎终究要离开了。 去的时候是老爸陪着去的，湖南株洲，记得离开的时候发了个朋友圈，很洒脱地说了句，今晚就要走了，此去一别就是半年，小伙伴们保重，想念该想念的人。半年，在当时起早贪黑的高中来说算是很快了吧，所以我想着也许就像是在自习室做个习题一样，轻轻松松就是一晃而过了。随着火车哐叽哐叽几声，我发现任由我怎么在窗口远眺也看不到家里的兄弟姐妹了。再坐下来的时候看着周围都是陌生的面孔，感到不安，其实自己算是个很念家很念家的小孩儿，以前高中每每放假总要回家，即使家里只有自己一个人，但总似乎感觉很暖。 中午的时候大概就到了，老爸总是风风火火，提着行李匆匆走着。一出了车站就见到了印着校徽标志的旗子和大巴车。宿舍以及班级里基本上人员都到了，所以我来的时候似乎他们已经熟络起来了，三言两句问着，大概就是叫什么，来自哪里，然后一一自我介绍。当时算是有些受宠若惊了吧，突然围过来的几人把我问懵了，本来已经做了快接近二十个小时的火车，人都还是晕晕的，名字又那么多，都是生面孔哪记得住，但为表礼貌还是嗯呢嗯呢一直点头，心想，后面总会记得住。中午和老爸用学校发的券去食堂吃，似乎每个新生都有一个鸡腿，大学食堂饭菜感觉比高中的略丰盛了些。天色还没暗下来，老爸就说准备走了，去市中心逛逛，然后在校门口让我帮忙拍完照就头也不回打车去市中心逛街去了，说是难得出来一趟要去看看。等等，这就直接把我丢在这了？有那么一刻，我感觉我不是亲生的，再回想起在家伯母和老妈送我离开了时突然红了眼眶，对比一下我洒脱的老爸，罢了，习惯了，从小到大对我散养以及严厉惯了，真要煽情我还真难想象。 望着远去的老爸，行吧，那就回宿舍吧，等等，这在哪？我宿舍在哪？妈蛋，坑儿子啊，天知道那天晚上我问了多少人才从学校东门找到我躲在北门角落里的宿舍。 回去宿舍以后记得半夜饿了，刚好也有其他同学也是如此，便一起出门觅食。那时候的一食堂还没有这么繁华，店并没有很多。绕了一大圈似乎并没有什么好吃的东西，总算找见一家店，抬头只见上面写着洋洋洒洒仨个大字，螺狮粉。众人不解这是啥玩意，我一个胡建人都不知道的柳州螺狮粉，何况那些西南或者大北方来的小伙伴了。抱着尝试的态度众人坐下来各要了一碗，当老板把碗端上来后，那股味儿我至今未曾忘记。这玩意真的能吃？大家你看着我我看着你的，没人愿意下一口，也不知道是谁带头尝了第一口，我只记得反正这小子绝不厚道，欺骗我们和臭豆腐一样闻着臭吃着香。反正在这小子鼓舞下，大家都尝了人生中第一口螺狮粉，后面细节我已不记得太清楚，应该是大家不约而同来了句，要不不吃了吧，我们买点零食吃吧，意见立马达成一致，众人立马起身赶紧离开。 后面这家店每次我经过时总是快步经过，避开那股味道，记得大二还是大三的时候回来路上遇到一个最惨的哥们，听到他对女朋友说，我们今天中午吃什么啊，女朋友丝毫不用思考回答了一句，螺狮粉，没看到男生的表情，但我觉得应该很惊恐，挤出一句，又吃螺狮粉，我们都吃了几天了，要不吃点别的吧？女朋友顿时来了句，反正我就要吃，你要想吃别的就自己去吃吧，说完头也不回就朝前走去了，但见男生快步追上，好好好，那就吃螺狮粉。兄弟，我敬你是条汉子，姑娘，有一个愿意陪你经常吃螺狮粉的男生就嫁了吧，这样的男生真的不多了。 吃了点零食，肚子还是有点咕咕叫，但似乎脑子活跃起来后也并不是那么饿了，宿舍灯一关，大家都安安静静地躺在床上似乎与白天的喧闹形成了巨大的反差。大概心里都想着家里的人和事，突然感觉周围一切都特别陌生，陌生的城市，陌生的舍友，大家有一言没一句地搭着话，不知不觉就到深夜了。 初识与跌倒 ——人生若只如初见，何事秋风悲画扇。一路走来都太过于顺风顺水，所以这次跌倒磕得可谓是头破血流，倒也成长不少。 刚开始最早熟络的起来的大概又算是打篮球那伙人吧，因为爱好聚在一起，大一新生赛，打得热火朝天，鲜红色球衣，胸前印着计本1401的一群人奔跑着，一边军训一边也打着比赛。记得那时候每天还未亮就爬起来洗漱穿好衣服就得去操场，五食堂的田径场周围空空荡荡荒凉的一比，一路上阿猪的手机总是放着平凡之路，徘徊着的，在路上的，你要走吗，via via……但似乎除了这头精力旺盛的猪外，大家都低着头眯着眼还在睡梦中般步履艰难地走着，像极了生化危机中的行尸走肉，了无生机。我不知道别人怎么样，反正我知道我每天困得要死，早上起来还是冷水洗脸，整个人都处于懵逼状态。当时每次快到操场时候总会抄近道，走一片小树林，大家伙似乎总要前后呼应几声生怕谁掉了队，声称这是一次挑大龙打野，激动万分似乎当了真，哇，反正一群傻屌男生一起玩的感觉太爽了，傻出境界。 在那期间小小的团队也开始慢慢形成，爱吃胡建人但舍不得吃我且吃不得辣又来湖南上学的操着一口标准普通发的广东阿成；臭美且臭屁多才多艺光金猪，所以我当时给这比冠名亲切外号猪哥、阿猪，军训期间活动主持人以及歌唱家，靠着一首华哥的“都怪我，太执著…..”红遍大江南北的一句；凭借一股子拼劲和我一起连续断了几个关键球反超比分拿下决赛名额的贵州隐藏富豪老冯，记得当时军训完后我们两还有个合影，像极了越南战争回来的难兄难弟；自称社会小人渣、台北张根硕、采辣椒小阿姨绰号一堆，整天顶着圆圆的一休哥似的小寸头外表人畜无害老实人模样实则情场高手鹏……暂时先出场一小部分吧，其他老哥们且在后台准备着，他们唱罢你们登场，排名不分先后在我心里一样重要。 教官没心思教导我们去走方阵，天天带着我们做体能训练，高强度俯卧撑导致当时手臂受伤，结果疼的不行去了校医院拿了药，于是后续几天都和几个女生搬了几块砖头坐在旁边看别人训练，这大概是我大学抹不去的污点了。后面才知道老冯在我旁边做俯卧撑的时候总是趁着教官没看到的时候直接趴在地上偷偷懒，起伏全靠屁股，当时就给我整懵逼了。靠，还可以这样操作的？我他妈竟然是个老实人？不过也因祸得福，手臂一两个星期好了以后居然粗了一圈，特此声明，我的麒麟臂是一条正经的麒麟臂。 记得当时有次军训完回宿舍时老冯在旁边走着走着，两人有一句没一句扯着皮，突然一转过头发现这比居然没了，再一低头，地上的下水道盖直接被踩翻开，这笔一只脚直接踩空踏了进去，可惜架不住这比求生欲极强，两只手死死抓抓我的右手就不放，好像在哭喊着，先生，救我？看着他的胶鞋掉落下几米深的下水道中被冲走。卧槽，你小子求生欲真他妈强啊，把我手都抓红了，这他吗要是两只脚踩进去，我一定也被你拉进去了，明天就得一起上工大新闻，小子，下次再有这种事，你他妈千万别抓我，你掉下去我还能找人捞你，不然咱们一起冲走了怕是要流浪湘江了。算起来，竟是认识之初便一起共患难了，不过这小子又因祸得福，接下去的军训期间天天穿着自己的鞋，我再看看自己脚上硌脚的鞋，靠，好处都让你占了。 军训时印象较为深刻的要数翔仔受尽教官宠爱，任命为小队长的故事了，长相憨厚的翔仔成了教官的小弟和我们的指挥官，人送外号大佐，大佐是个新化人操一口新化发总引得大家捧腹大笑，似乎那时候的快乐全靠大佐整日卖力的表演了。腰间的皮带已束不住他那肚子，总感觉要撑开，每每军训前后总是解开皮带在手中甩着，像极了抗日期间的翻译官。记得那时候同一个营的除了计算机专业的同学们外，还有一群通信专业的妹子们，本来院系里大概就只有通信专业妹子质量和数量最优了，偏偏被分到我们营。刚上大学的大伙都似脱缰野马，到处散发着荷尔蒙的味道，似乎男生中最多的话题便是谈论哪个妹子最好看，当时有几个妹子确实长得还挺漂亮，皮肤也白的不像样，当时看呆众人。记得来之前就有好友对我提及，湘妹子都很漂亮，皮肤也很好之类的话，似乎在这得到了验证。许多男生为此争先恐后表现出自己的优秀，堪比春秋战国的诸子百家争鸣。 记得当时偶尔还被教官拉到食堂旁边树荫下休息，妹子们被教官以及大家起哄说跳个舞，啧啧啧，真是腐败的生活啊，大概率当时大部分男生都要流鼻血了。记得当时隔着老远通信男生们冲我们喊道，把妹子还给他们，他们舍不得。不曾料到我们这群虎狼之师回应道，不还，我们也舍不得。后面我才知道，基本上大部分男生都加了几个漂亮的妹子QQ，这样那样的借口都聊上混得还挺熟的，就连班里最老实的几个男生也是如此，别问我为什么没有加，老实人的我又背锅了？大概一眼就知道自己搞不定，这种妹子远远欣赏就好，高攀不起，不应该自讨无趣。但我也喜欢凑热闹，尤其喜欢起哄，反正吹口哨鼓掌拍手叫好之类的事大概是我最喜欢的了，像极了看古代街头卖艺表演的吃瓜群众A，别问为什么不是BCD，因为BCD是老冯小灰灰他们。 也就是军训时，挺多原因吧，对于前女友关心太少，一条短信通知我分手，当时也没多想，就回了个好的，男生大概一般都是决策理智型的吧，既然别人已经决定了，再去挽留也没有意义，想离开我生活的人那也别再挽留了，迟早也会走，于是她就彻底离开了我的生活，详情不再提。当时周围人还没完全熟络起来，离家也挺远，每天五六点爬起来困的不行直接趁着还没开始训练也能在操场上睡会，手臂受伤受够了整日活络油的味道。新生赛虽说一路挺进总决赛，但也是坎坷不断，又受了一些小伤。家里又因为一些事又让我很着急却又无能为力，许多烦心事没几个人可诉说，所以整天没事便躲在宿舍喝着酒，喝多了就好好睡一觉，浑浑噩噩算是熬过了一段挺艰难的时刻。所以几个基友对于我大一时印象便是，一打开我宿舍门便见我坐在那听着歌对着电脑发呆，听见声响转过头第一句就是，要不要来一杯？ 记得大学刚开学时候和阿成天天没事跑去自习，上完课立马去吃饭，回宿舍休息一小会就又去教室自习了，将前辈们的敦敦教诲铭记在心，大学了还是要好好学习为重，学好专业知识，将来为社会主义建设贡献自己的一份力量。看了一个多小时书左右，同学们大概也就陆陆续续来上晚自习，喜欢那时努力的自己，让内心充满了信心和期待，感觉未来一切都可期，但那之后似乎丧失斗志，每天都躲在宿舍对着电脑听歌发呆，习题也不做了，书也不看了。每晚快到点总被舍友叫去上课，浑浑噩噩，像是丢了魂一般，不想回忆自己当时多惨，只记得在众人面前丢尽了脸，喝酒吐的一塌糊涂，被舍友搀扶去睡觉却又偏爱干净非得去洗澡。把自己一人关在卫生间，开着水龙头冲了半天导致舍友担心直接敲门问我是不是睡着了，我寻思着当时门要不是拴着估计要被阿猪这比踹开，那老子的清白估计就毁了，怎么说当时老子还是个黄花大闺仔。记得阿猪当时扶着烂泥一般的我上了床，细心替我盖好被子，脑袋昏昏沉沉记不清其他细节，只记得做好一切后他嘟囔了一句，哎，不识货啊，明明挺好一男生。大概就是当时他的这些行为让我对这头猪还算比较有好感，以至于后面每每破事傻事总找我帮忙，老子也拉下老脸来帮他，亦或者总在宿舍打游戏摔键盘骂人吵我睡觉，几次百般忍无可忍想下去锤他猪头的时候还是按耐住了怒火。 第二天醒来后整个宿舍酒气弥漫，感觉挺不好意思的，赶紧收拾了一下，为了不吵到舍友睡觉就出门了。那时候已没有什么心思去做别的事，一有空就自己一人溜到后山坐着听歌。人总归是该成长的，就像当时受伤的手臂一样，从那之后我的心似乎也强大了一圈。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"书","slug":"10-书","date":"2019-08-29T13:01:54.000Z","updated":"2019-12-08T13:44:57.586Z","comments":true,"path":"2019/08/29/10-书/","link":"","permalink":"http://yoursite.com/2019/08/29/10-书/","excerpt":"我想人生最终总要归于黄土，却不甘心只在人世走一遭，所以喜欢闲来无事捧着本书细细阅读，体会不一样的人生，既要读万卷书，也要行万里路。身体和灵魂都要一齐上路，才不觉得这辈子苟活于世。","text":"我想人生最终总要归于黄土，却不甘心只在人世走一遭，所以喜欢闲来无事捧着本书细细阅读，体会不一样的人生，既要读万卷书，也要行万里路。身体和灵魂都要一齐上路，才不觉得这辈子苟活于世。 嫌疑人X的献身 貌似最近半年来一直都在读东野圭吾的书，喜欢悬疑那种紧张代入感。关于这本书的剧情其实很早之前就看过了，但却是电影，感觉挺不错的，所以这次有空便顺带看了一遍书，时间已经过去挺久了，所以剧情记得零零散散。也许很多外表看起来不懂爱情的人对待感情最是认真专一，一见钟情有时就这样一辈子了。虽是一个平凡的女人，但对于石神来说，实在是生命中的一束光。 恶意 东野圭吾《恶意》另类的写作模式，以重要角色罪犯和警察的自白书作为篇幅，感觉甚是有趣，本以为猜想到的剧情却又笔锋一转，将所有人都引向另一个方向，难以捉摸的故事发展走向感觉实在是很吸引人。就像是另一本书，嫌疑人x的献身中所说似的，看似是几何题，其实是函数问题。 至于感悟，该怎么说呢，大概就是每个人记忆深处都有一些不敢回忆和触碰的东西，努力想要忘记，以至于你整日担忧而过不好现在的日子。所以，该忘记的东西还是忘记了便罢了，内心实在是不应该背负太多东西，否则在人生路上只会将背在背上的包裹越存越重，最终将自己压垮。 新参者 感觉这本书不太像是男生写出来的书，对于案发地点来说，加贺警官也属于新参者，加贺警官从一个新参者根据自己的一直走访调查，慢慢熟悉这条街道上所有店铺和人。其中因为细心调查发现了许多暖心的家庭小故事，感觉笔法心思细腻得像个小女生。 对于书中的故事，从一开始婆媳关系，整日争吵，到最后发现相互准备着对方喜欢的东西，原来其实彼此都在向对方靠近，但因为不善于表达而在日常生活中经常伤到对方。我们的生活中又何尝不是，总是为了一些鸡毛蒜皮的小事和亲近的人争吵得不可开交，其实很多时候彼此静下心来好好聊一聊，也许很多事儿就迎刃而解了。儿子离家出走，不想成为家庭负担，觉得母亲对于自己并无太大在意，后面却发现母亲为了自己所做的事后只剩下感动和愧疚。树欲止而风不静，子欲养而亲不待。很多事再来后悔已经没用了，所以还是每时每刻都珍惜现在，好好对待身边的人，毕竟没人可以确定他们能再陪你多久。 红手指 今天刚好趁着午休时间看完了东野圭吾的红手指，看完以后深感父母自身品德和教育对孩子成长的重要性，经常反思感觉自己以后也不知道能不能教导出一个好孩子，能不能做好一个父亲的角色，虽然感觉自己还是个孩子，但总能体会到，为人父母，真的很不容易。 一直有这样一个疑惑，是不是当拥有自己家庭后，原来的家庭就该丢弃，既然如此，所谓的成家是不是过于自私了，遇过子女在父母遇到这些问题时都是想着如何避免责任和承担义务，毫无责任可言，真的忘记了吗，是谁伴你成长。论语中提及，今之孝者，是为能养，至于犬马，皆能有养，不敬，何以别乎？可笑如今许多人连基本赡养都做不到。 书中还有一点感触极深，就是当他们面对任何事的时候都抱以鸵鸟心态，只是一味的逃避，掩耳盗铃。但是生活中又有多少人现在也是以这种态度去处理事情的，好像转过头不去看，那件事就没有或者不会发生一样，其实只是为了让自己心安理得，可是，真的能那么心安理得吗？ 兄弟 算是很早之前就知道这本书的存在了，不过一直没看，基本上都是因为这个名字吧，感觉非常普通平凡的一个名字，没有太大吸引力，应该不甚有趣。但是没想到开始看之后便停不下来，从开始到结束，大概三四天吧，还是上班的日子里，竟也直接看完了。 故事采用半倒叙方式开头直接讲了李光头十五六岁偷看女人屁股的事作为开端，结合他父亲引出全文，一开始便提及他父亲也是如此行径，最后因此跌进茅坑淹死。作为妻子的李兰从此便在刘镇抬不起头来，不管什么时候出门都是低着头，靠着墙走。 算是缘分也是造化，李兰对于不顾脏臭直接跳入粪坑背出自己丈夫的宋凡平感激涕零，所以后面也有了两人的姻缘，两人结婚时候遭受大家的嘲笑和讥讽，李兰带着李光头，宋凡平带着宋钢，两个流着鼻涕的小孩都是拖油瓶，但正因为父母的结合，他们也成了名义上的兄弟。对于乡亲们的嘲笑，宋凡平依旧笑脸相迎，即使最后与几个闹事的邻居大打出手为了李兰忍气吞声，吃饭时对于两小孩也是极其温柔体贴，没有因为之前的事有一点消极情绪。 李兰自前一个丈夫因偷看女人屁股跌进粪坑淹死以后，一直都觉得抬不起头来做人，但在宋凡平的温暖和积极影响下，渐渐的又抬起头来，甚至可以说是骄傲地走在刘镇的大街上，宋凡平给了她爱和尊严。李光头和宋钢也成了亲密无间的好兄弟，两个人整日乱跑，一起玩耍，一起挨揍。期间还有李光头与电线杆、板凳搞男女关系的一些小插曲，算是小说中特别欢快的一段了，但就是因为这么美好的东西，一家四口其乐融融，让人总觉得这幸福太过于美好，总会被上天打破，揣着担忧和欢乐只能继续看下去。 故事的转折点大概要算是文革开始，李兰去上海治病，家里只剩下宋凡平和两兄弟，因为宋凡平的地主成分每天要去接受群众的批斗，但是不管在外受到何种的唾弃打骂，当他回到家看到两个儿子时，总是能够脱胎换骨，让人觉得身上真的充斥着一股能量，似乎天就算塌下来，宋凡平也能替他们扛起来，给人一种特别特别踏实的感觉。 但上天大概就喜欢折腾不肯向生活屈服的人，因为李光头一句委屈话导致群众将无须有的罪名扣在宋凡平头上，将他殴打且最后丢进牢里。两个孩子明明才几岁，但是却无人照料可怜兮兮，幸好之前父亲入狱之前担心自己出事没人照料他们，曾向他们示范如何做饭等生活技能。宋钢在父亲的潜移默化下，小小年纪就懂事机灵，那时候每日李光头在外玩累了总能回家吃到他做的夹生饭，虽说是夹生饭，但却让他记了一辈子，以至于最后李光头有钱后吃了多少豪华的饭店都还是怀念。 宋凡平因为了实现去上海接李兰的一个承诺，从牢中逃了出来，但是却在车站被堵截抓获，奋力反抗中被殴打致死，李兰没有等到宋凡平，总预感出了事，所以第二天急急忙忙赶回来，却见到自己丈夫已经悲惨离世，或许就在那瞬间，她重新建立起来的世界又经历了再一次的崩塌。但在替丈夫处理后事过程中，一直表现得很坚强，甚至对于红卫兵的巴掌也面不改色迎了上去，在宋凡平的爱和温暖下，连李兰似乎也变成一个顶天立地的英雄一样勇敢了。 父亲的离去对于这个家庭打击巨大，为了照顾年纪大的爷爷两兄弟只能分开了，但即使这样，似乎路途也隔不开两兄弟的感情，宋钢帮爷爷做事的同事总会给李光头带来大白兔奶糖，每次自己舍不得吃最多只是闻闻，对兄弟却慷慨大方，当时看到这里，感觉宋钢真是懂事得让人心疼。 李兰的身体后面一天天也在变糟，以至于最后也撒手而去，宋钢明明只是大李光头一岁，却应承下要照顾他一辈子的承诺。以至于两兄弟长大后对于林红，宋钢也是不和李光头争抢，但偏偏林红又看上了他，一边是自己很喜欢的人，另一边又是唯一且最亲的兄弟，两项抉择下，宋钢选择了上吊。被李光头救活以后再次因为林红的事两兄弟置气，宋钢也终于决定和林红在一起，两人结婚过上了幸福的日子，李光头却因创业失败收起了破烂。 本来依旧还是好兄弟的一对，却因为林红的相逼最终决裂，其实看到这段的时候莫名心酸，站在每个人角度考虑问题都没错，李光头与宋钢相依为命，彼此都是世上唯一的亲人，虽不是亲兄弟但却早就胜似亲兄弟，一份饭也分着吃，宋钢即使因此经常饿肚子也毫无怨言，甚至觉得开心。但林红角度考虑，李光头偷看她屁股，无耻下流，追求她时又说出下流话来羞辱她引得众人嘲笑，最后又阻挠宋钢追求自己，在他多次向宋钢伸手要钱的时候林红也是忍耐到了极限，逼的宋钢在她和李光头之间做个选择。虽说宋钢最后选择了她，与李光头一刀两断，但心里却是愧疚不安，常常梦到李兰，记起自己对于去世母亲的承诺，默默流泪。没有谁对谁错，只能说，造化弄人。 这样的日子没过太久，宋钢就下岗了，林红也遭受着厂长骚扰和下岗危机，相反的是，李光头这边却因祸得福，将垃圾生意越做越大，如鱼得水。宋钢为了给林红更好的生活，挑起生活担子不小心将身体弄伤，也找不到合适工作，林红受尽委屈却也不好开头和宋钢提及，似乎让人羡慕的一对，也被生活折磨的遍体鳞伤。希望以后自己另一半不管在外受了什么样的委屈，到家了也能向自己诉说，即使自己已经被生活打压的抬不起头来，也能为她做点什么，而不是自己一个人藏在心里，只能默默叹气。 宋钢受伤又做不了什么工作，反观李光头却是风风火火，林红只能让他去找李光头，对他说，他是你兄弟，却不曾想当初要他们一刀两断的时候说的也是类似的话，你们俩又不是亲兄弟。宋钢却绝不肯去，他的心里对于李光头应该是极其愧疚的，他和李光头的感情并不能拿钱衡量，但似乎去找他与之前李光头落魄时决裂对比起来，似乎是用钱在侮辱他们的兄弟情。林红逼迫他不去自己就去，宋钢为了这个女人再一次妥协了。没曾想李光头却还是那样洒脱，你他妈总算来找我了，骂了他好几句，宋钢突然觉得他这兄弟还是他兄弟。 但不想依靠李光头的宋钢为了多赚点钱宋钢离开了那个从小长大的刘镇，为了让林红过上好日子，也随着周游一起骗起了人，做起了一些小买卖。看到他为了赚钱去做假胸的时候，感觉心酸至极，我想象不到一个大男人顶着一个女人一般的胸走在大街上供大家玩笑侮辱的场景。宋钢不知道多少次想钻进地缝中躲起来，但为了林红的幸福似乎又觉得什么都无所谓了，然而就当宋钢在外出卖尊严换取这血汗钱的时候，家里的李光头和林红却搞起来了，我没有想到故事会如此急转而下，我总以为即使李光头再怎么喜欢林红，也绝不会对自己兄弟的女人下手，但或许生活就是这样俗不可耐，林红也因宋钢一直不在心理防线终被突破，两个宋钢最亲最爱的人都一起背叛了他。然而那两个都是他这辈子最爱的人啊，宋钢善良到觉得是自己给不了林红真正的幸福，和她在一起的日子里自己也过得很开心，写下给两人的信后卧轨自杀。看到最后，我的心里也不知道是什么感觉，说不上来，既不是愤怒，也不是遗憾，只是摇了摇头，觉得无奈罢了。 宋钢性格善良，对待身边的人特别温柔，但是并没有特别其他突出的特点，李光头性格突出，一直很了解自己想要什么，这大概就是为什么即使过去几十年，他依旧垂涎林红的原因吧，但为了一己之私，对自己的兄弟做出如此之事，最后导致兄弟卧轨自杀，我觉得再怎么愧疚也弥补不了。看这本书的心情一开始是很激动的，感觉情节引人入胜，对于欲望也毫不掩饰，算是很真实，细节处描写又让人觉得很动情，感人。但是看到最后结局时候却不知道何种感觉了，除了叹一口气外似乎也没有别的感触了。 秘密 一书故事篇幅不长但却是很曲折，体会着男主心情从悲伤绝望到惊喜矛盾到平淡又到最后无限绝望悲伤，最后居然短短几句话看的我也要替他委屈地流下泪来。你获得了重生，你选择抛弃过去一切重新来过，我愿意放开，却没想到为了一己之私你愿意演一出好戏，将我瞒在鼓里，如此也就罢了，让我别忘记你，自己却早已忘得一干二净，却还要将我一辈子绑在你过去的影子里。 幻夜 休息的一天，昨晚喝了点酒睡到大中午，懒洋洋爬起来吃了外卖继续躲在被窝里终于看完了幻夜，结局实在是太出乎意料精彩了，女主新海美冬和男主水原雅的故事真是太过悬疑、惊悚、坎坷以及感人等等等……雅也为了所谓的和美冬虚幻美好的未来，不惜杀人分尸让曾我孝道人间蒸发；强奸女店员栽赃嫁祸给青江，又让美冬出面解决好让青江死心塌地为自己干活；勾引比自己大十来岁的赖江制造把柄好让美冬不被调查；就算最后美冬嫁给别人，也发现从一开始就隐瞒身份欺骗自己，甚至设计勒索圈套让自己杀人，当知道这一切以后，依然设计假装自己气急败坏想要杀掉美冬而引出快调查出真相的警察，一起同归于尽，真是有些出人意料了，你也杀了人，你杀了我！你杀了我的灵魂！没想到即使雅也知道真相后这样充满怨恨，最后也还是决定用自己的生命保护她那面具下的假面。 白夜行 白夜行和幻夜的故事线感觉很相似接近，同样是一个男生为了一个女生不顾一切，宁愿自己一辈子活在黑暗影子里，也要护女生周全。其实有些时候人性还是挺丑陋的，为一己之私不顾一切。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"书籍","slug":"书籍","permalink":"http://yoursite.com/tags/书籍/"}]},{"title":"19年心路历程","slug":"09-19年心路历程","date":"2019-08-21T12:56:52.000Z","updated":"2019-10-17T14:52:50.665Z","comments":true,"path":"2019/08/21/09-19年心路历程/","link":"","permalink":"http://yoursite.com/2019/08/21/09-19年心路历程/","excerpt":"毕业做程序员的第二年，没日没夜996加班的第二年，有时候我会觉得很丧，有时候又觉得好像对未来充满希望，但是平均下来，感到绝望的日子好像确实更多一些。","text":"毕业做程序员的第二年，没日没夜996加班的第二年，有时候我会觉得很丧，有时候又觉得好像对未来充满希望，但是平均下来，感到绝望的日子好像确实更多一些。 2019-08-14 晴空万里 想一想从学校毕业已经整整一年了，在这家公司每天加班到9点的日子也已经过了一年半了。感觉自己依旧没什么成就，感觉特别丧。且先来说说近况吧，前一个多月女朋友辞了南京的工作搬来杭州，碰巧那段时间新接了一个项目，预期三个星期，从零开始的一个项目，三个后端开发，我被分配到任务并不是很难，但是内容却不少，都是一些繁琐的工作。 但是着手开始做以后我发现并没有那么简单，所以导致当时一个月不到的时间，经常加班到十点十一点，女朋友那段时间忙着找工作，每晚等我回到家的时候不是要睡了就是已经睡了。只好蹑手蹑脚轻轻地洗漱收拾，然后上床休息。所以上一个月时间，我设计新增了十几张数据表，编写了二十几个接口，七八个跟业务相关的微信消息通知，两个微信消息模板，但是生活上对于女朋友的陪伴确实太少了，等我差不多忙完了，项目上线的时候她也确定工作，准备搬到公司附近去了。人生总是这样，急急忙忙的，不会给你时间和机会准备好。于是那天晚上早走，第二天请假准备帮她搬家，送走后突然自己一个人回到房间感觉空空荡荡，好像丢了什么东西，又说不上来，生活又回到以前。 最近一个新需求，只是版本迭代，并没有多少活，噼里啪啦一天就写完代码，还能划水两三天，突然闲下来，什么也不想做，感觉异常丧，不知为何，对于生活的一切都感觉很绝望。虽然才24岁，但总觉得自己一辈子好像也就这样了，没有多大出息，特别平凡的一生，就像那种一点不起眼的沙丁鱼。 前两天家里一个挺好的基友兄弟突然走了，工作时不小心触电身亡，真希望这是个噩梦，明明才28岁，正值年少，说没就没了。以前的日子好像也才过去没多久，每次在家总会一起喝酒，摇骰子很厉害，喝酒也是如此。我们几个总被喝到吐了才罢休，但记得有那么一两次，我们也是手感好到不行，每每针对我们几个的你也被喝到怀疑人生。我想不通，明明这些记忆还这么清晰，怎么突然就发生这种意外。我甚至觉得这是一个巨大的玩笑和捉弄人的把戏，等我几个月后春节一回家，你又骑着那轰轰轰的摩托车赶过来，坐在旁边抽着烟摇着一副骰子，气势汹汹地跟我喊道三个六，等我说出你出意外的疑问，你骂骂咧咧吼道，谁他妈说的，老子不锤死他。 可是，好像这不是噩梦，你真的就这样离开了。对此，我好像也只能说一句，兄弟，一路走好，来世有机会一定把以前没喝的酒补上。 2019-08-19 天气渐凉转秋 头晕头晕，昨晚喝太多酒又两点多才睡，搞得今天全程头晕看不进任何东西，几行代码反复几遍也愣是没弄懂啥意思。组长又让我指导那实习生修改一个bug，哎，这小子做事实在是太糙了，生怕他搞出什么大问题来。昨天打球浑身酸痛的感觉还未褪去，很舒服，喜欢这种疼痛感，让我觉得自己还是个有血有肉的人，而不是整天浑浑噩噩像个行尸走肉。 和女朋友的事有些矛盾，一直没解决，每次想起都很烦躁，感觉自己真不适合做男朋友。朋友都觉得我们俩有时候根本不在恋爱中，没有谈恋爱该有的样子，就像两个关系还可以的朋友一样，什么事都保持着距离，小心翼翼相处，生怕亏欠。 2019-08-21 晴 最近工作还是比较忙的，感觉有些疲惫，可生活不就是这样，起起落落落落落落……，天气有些转凉，好像突然间就有些小感冒了，咽喉炎又有些严重起来。 不过感觉秋天就要来了，感觉还是开心的。秋高气爽，中秋也快到了，不用独自赏月，算起来，好像孤孤单单过中秋已经很多很多年了，以前初高中时就自己一个人在家，每每望着月亮发呆，可惜今年不必了，可以带着小女朋友一起吃月饼赏月了。 2019-08-25 晴 突然就秋天了啊，一年四季，春去秋来，感觉眨眼之间，日复一日，年复一年。除了天气变凉爽之外，感觉心情也变得很复杂，说也说不清楚，自己也不了解到底在想什么，但总是觉得颇有感触。伤春悲秋不知道是不是大家都有的情绪，但貌似刚入秋，我的心情就一落千丈，总是抱着一些奇奇怪怪的想法，说不上来是什么，但心里总是空落落的，就像是丢失了什么东西似的。 有些事好像突然就过去五年七年了，和朋友提及，感觉就像是在诉说别人的经历，那时候的自己感觉异常陌生，就像不是自己经历的，记忆说淡又很淡，说深好像又很深。似乎长这么大以来，许多的大事都发生在秋天，那些改变累加在一起形成了现在的我。 过去的每一个秋天似乎是悲喜交加，大喜大悲到最后的平淡孤独，像是把人生都过完了一般。虽说最近工作还是蛮忙的，但是刚刚还是忙里偷闲下楼买了个糖果，一阵阵微风袭来，突然感觉好治愈，像是特别自由的味道，要是我也可以张开翅膀，一定立马迎着这阵风飞出这杭城去看看。 从高考完以后去湖南上学，整个人就像被困在湖南，很少回家，对于自己的理由总是距离远，其实大概原因还是因为意懒吧，很习惯待在某个地方，长久以往便不愿意动了，如今来了杭州工作以后也是如此，一年回家一两次，不管是人或者事，都越发变得陌生了，而在这我也并找不到自己的归属，好像慢慢的自己变成了没有归属的流浪儿，这种心情不清楚别人是否也会有，就像是自己似乎都不属于两地。 很多时候夜里都喜欢靠在窗户边看着天空，虽然什么都没有，但就这样静静听着歌，心里也是莫大安慰，既然觉得孤单，那就用自己喜欢的方式陪陪自己。无需多言，安安静静待一会也许就好多了。虽说有些时候总是感到委屈，容易酸鼻子，似乎不太像个男生，倒像是个爱哭鼻子的小女生，但在眼泪流出时总能将其逼回，似是什么都未曾发生。也不想再和别人诉说，每个人都有自己的难处，管好自己的事就好了，无需再与别人徒添烦恼。 2019-08-28 晴 思考了很久很久，终于还是下了决定，做回自己吧，一切都结束了。 2019-10-09 晴 感觉自己是个容易胡思乱想的人，感觉毕业后大家各奔东西，本来当时和最好的兄弟老冯一起来了杭州，想着两个人一起在杭州好好奋斗，有空还可以约着一起玩。却不曾想后面突然有一天他对我说，改天请你吃个饭吧，我买了回贵阳的车票，准备周一回去。一时间挺突然的，也不知道说什么，便回答了句行，那个周末一起出去吃了顿火锅，喝了些酒。好像接下去又该自己一个人了呢，小灰灰离得不远不近，但在一起时间也并不多，偶尔约着打打球，但却总嫌太远倒也算在杭州。可前不久似乎也准备离开杭州去深圳发展，本来几个玩得很好的前同事年初也离职去了成都深圳，人生真是在不断分别中草草度过了，回过头来，前两年、前一年在自己身边的很多人如今都不在了，依旧孤身一身，所以又回归为一个人吃饭上下班，基本上没有什么业余生活，有的只是坐在电脑面前敲着键盘回复着哈哈哈，一切的嬉戏玩笑都成了键盘噼里啪啦的敲击声。 自己似是又变了一个人，又从以前积极阳光的态度变为伤春悲秋的多愁善感少年了，其实真没必要太过在意聚合离散，本就是人生常态，还是要以平常心处之。 2019-10-10 晴 19年突然到了最后一个季度，最后三个月过完就又是新的一年了，今年貌似并没有达到自己想要的目标，虽然在公司感觉确实成为了骨干，工资也涨到超出期待，可似乎好像也就这样了，孤孤单单地又度过一年，没有什么特别值得怀念的回忆时刻，掐着指头算算，好像也就只有几个和女朋友以及姐姐在一起欢乐的时光片刻。 时间随着长大也跑的越来越快了，好像还不等我努力达到各个目标，只是埋头朝前飞快赶去。以前的同学以及朋友一个个开始订婚结婚，感觉就像是同一场考试快结束，大家开始陆陆续续交卷了，但我呢，还在犹犹豫豫，还有几道题，本确定了答案，但总觉得不太对劲，坐在位置上既不能想出别的解法说不上哪里不对劲，又不敢交卷，监考老师却总是绕着我来来回回反复念叨，做完了的同学就早点交卷啊。真的做完了吗，总是翻来覆去这里看看，那里瞅瞅，总觉得有些不够满意，但是却好像也束手无策了，看着窗外交卷的同学们一个个喜笑颜开，应该都考的不错吧，或者说不管考的如何，总算是考完了松了一口气了，便不再去想这些事了。 2019-10-17 对某些事开始越来越过于无所谓了，大概是越来越失望了吧，感觉其实这样也挺好的，慢慢将关注的重心重新拉回到自己身上来。也变得越来越不像自己了，收起自己不愿被看到的这一块那一块，这样就看不到完整的自己了吧，在自己在意的人面前也不能完全做自己，或者说对方只愿看到自己好的一面，对于其他方面则是一脸鄙夷。像是被脱光衣服的小孩站在灯光下被人拿着相机各种拍摄，害怕又惊恐，索性闭上眼睛，似乎什么都不存在一般，大概也只有这样欺骗自己获得一丝片刻的安宁。 其实今早心情和现在反差极大，原因也是简单，一梦一天堂，一句一地狱。地狱的事暂且不提，没人喜欢消极人生，再好的朋友也会厌倦你的烦恼和抱怨，愿自己永远只对外人展现出自己阳光积极的一面，毫无阴暗寒冷，沮丧失落。 今早做梦，梦到了大学时候的一群好基友，很全面，差不多都在梦境中了。有搂着女朋友甜甜腻腻的渣男鹏，并肩走着面无表情的高冷蒋和笑嘻嘻的少儿龙，有让我带衣服给渣男鹏的操心祥，有请我喝饮料的沙雕猪，有刚从食堂出来的穿着拖鞋短裤屌丝段子冯、啰嗦灰以及二人转组合的杰伦殷和长腿宁，躲藏在最后的是长沙富二代的低调王和205工作室游戏直播达人的正经季。打开冰箱发现老冯塞满了一冰箱的衣服，一脸懵逼，是要把衣服保鲜的骚操作？貌似我是从别处过去，一到的第一个问题便是问我有没有爬泰山？沉思良久，我也不知道为什么会有这个问题，毕竟我们以前爬山爬到后面好像明明开玩笑计划约的是珠峰，还说要团购氧气瓶，记得突然有一天，低调王慌里慌张地闯入我们宿舍，不安对我说新闻说以后珠峰要开始收费了，神经兮兮搞得有那么一瞬间我也担心收费了买不起这么贵的门票咋整，其实245工作室或者基友大队队员们个性鲜明，说起来错过了今年国庆的会晤倒有点小可惜了。 醒来后感觉似乎一切又是那么充满希望，整个人活蹦乱跳又像是个孩子，一路飞奔下楼，即使生活再狗屎不济，只要活着，就一定要永远积极阳光。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"}]},{"title":"电影小感","slug":"06-电影小感","date":"2019-08-19T12:13:34.000Z","updated":"2020-02-29T09:21:15.935Z","comments":true,"path":"2019/08/19/06-电影小感/","link":"","permalink":"http://yoursite.com/2019/08/19/06-电影小感/","excerpt":"生活如戏，我想陪你走到江湖散场。","text":"生活如戏，我想陪你走到江湖散场。 我也不知道为什么一上来就是一部动漫，其实我以前的想法和老爹很相似，动漫＝动画片＝小孩子，所以一直感觉不屑一顾。但是突然就被带偏了，虽然教会我看动漫的那个人早就不在身边了，但好像我也就因此喜欢上了这些简单的小东西，大概是看动漫的时候我也感觉自己像个小孩子，所以感到无穷开心。 龙猫 宫崎骏的动漫总是略带一些成长和感触的味道，不知道看过几遍龙猫，整体的感觉是给人欢乐和愉快的。草壁皋月是一个虽然年龄不大但却懂事并让人心疼的姐姐，母亲住院期间，操持家中事务并照顾妹妹草壁米，坚强并且乐观积极向上。 而妹妹草壁米也是个性格活泼，善于观察周遭有趣事物的小女生，但常因冒失的举动让姐姐担心。彼此成长过程中总是难免遇到挫折和矛盾，但却都怀着一颗善待世界的心，所以也被世界温柔回待。 萤火之森 我有多渴望拥抱你，就有多害怕失去你。 千与千寻 人生如逆旅，你总要自己一个人朝前走去，不管是谁都不可能永远陪在你身边，所有人都只是你生命旅途中的过客罢了，到站了也就下车了，来来往往，该淡忘便淡忘了吧，不要回头，一直走下去。 悬崖上的金鱼姬 喜欢是件很单纯简单的事\b儿，我喜欢你，\b所以去找你的时候都是跑着去的。 起风了 起风了，唯有努力飞翔才能生存。","categories":[{"name":"情感","slug":"情感","permalink":"http://yoursite.com/categories/情感/"}],"tags":[{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"电影","slug":"电影","permalink":"http://yoursite.com/tags/电影/"}]},{"title":"有待提高","slug":"04-有待提高","date":"2019-08-14T11:45:24.000Z","updated":"2019-11-20T15:09:51.260Z","comments":true,"path":"2019/08/14/04-有待提高/","link":"","permalink":"http://yoursite.com/2019/08/14/04-有待提高/","excerpt":"本文主要记录一些作者想做或者要做的事，其中包括技术，也包括生活等。生活总要满怀期待和目标，才能尽自己所能向着未来冲去，一步步收齐经验值总会升级最后一刀砍死大boss。","text":"本文主要记录一些作者想做或者要做的事，其中包括技术，也包括生活等。生活总要满怀期待和目标，才能尽自己所能向着未来冲去，一步步收齐经验值总会升级最后一刀砍死大boss。 技术 Java Netty Jetty Gradle NIO 以及 NIO中文乱码相关问题 消息队列 跳跃表 Kafka 研究Dubbo源码 Python 熟悉 python2 语法，基本编码无障碍 学习 Python3 语法，学会使用图表分析相关库 实现爬虫抓取图片网站 项目经验 总结Redis 总结微信消息等 LocalDataTime等相关博客 总结登记工作站，其中包括数据库设计、分诊、排队号生成和ris、weixin、qa系统间调用逻辑等 Mybatis二级缓存 生活 重拾日记习惯 持续旅行 爬一次黄山 去一次乌镇，走一遍夜晚的江南水乡 带欣欣去看海 [ ] 书籍 技术 Java8实战 Redis设计与实现 深入解析Spring源码 Netty实战 [ ] 文学 阿Q正传 我不 老子传 秘密 白夜行 嫌疑人X的献身 恶意 新参者 白鹿原 孝经 红手指 堂吉柯德 兄弟 [ ] loading…","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"待办事项","slug":"待办事项","permalink":"http://yoursite.com/tags/待办事项/"},{"name":"规划","slug":"规划","permalink":"http://yoursite.com/tags/规划/"}]},{"title":"那些让我静下心来和静不下心来的声音","slug":"07-那些让我静下心来和静不下心来的声音","date":"2019-08-13T12:42:02.000Z","updated":"2019-08-13T12:42:02.000Z","comments":true,"path":"2019/08/13/07-那些让我静下心来和静不下心来的声音/","link":"","permalink":"http://yoursite.com/2019/08/13/07-那些让我静下心来和静不下心来的声音/","excerpt":"我喜欢听歌，从很久很久以前，陪着我一起长大的老歌都和我的记忆绑在了一起，偶然间听到熟悉的旋律记忆也就被同时唤醒了，某段时光、某段记忆、某段旋律交织，总会让我心从各种情绪中变换。","text":"我喜欢听歌，从很久很久以前，陪着我一起长大的老歌都和我的记忆绑在了一起，偶然间听到熟悉的旋律记忆也就被同时唤醒了，某段时光、某段记忆、某段旋律交织，总会让我心从各种情绪中变换。 梦中的婚礼以及雪之梦对于我的经历来说很是复杂，梦中的婚礼应该是有人对我说过很喜欢这首钢琴曲，未接触纯音乐，当时听了感觉也是一般。但却忘记后面不知道怎么就越听越多，倒也就喜欢上了。雪之梦倒是初听便喜欢上了，每当听到这首歌，就像雨过天晴的周日下午，身心愉悦地走在一个满眼绿色的森林公园，即使是炎热的夏天，也能感到阵阵凉快的清风，没有一丝烦恼，只是与一好友慢慢散着步，谈天说地，幻想未来，别走那么快，等等我。 但是这两首歌听着听着情绪总会越来越复杂，原因并不在音乐本身，大概是因为自己记忆被这首歌拉回来的时候并不是太过于美好，但记忆毕竟太过于久远了，一股陈旧的味道总在慢慢散开去，大多数事情已经变味了。 新版的笑傲江湖热播的时间大概是在我高三并且接近高考那段时间里，记得那时候即使是临近高考了，依旧用手机追着这部剧，喜欢东方姑娘的干脆洒脱，对待感情认真专一，可以为令狐冲舞剑、陪他喝酒、替他打架出头、杀雪狼取胆，俘获观众心无数。然而令狐冲渣渣，结局没办法接受。 如若此生能得一人似东方姑娘，愿抛弃一切，就这样笑傲江湖。","categories":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/categories/生活/"}],"tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"},{"name":"感悟","slug":"感悟","permalink":"http://yoursite.com/tags/感悟/"},{"name":"音乐","slug":"音乐","permalink":"http://yoursite.com/tags/音乐/"}]},{"title":"Git使用心得","slug":"08-Git使用心得","date":"2019-08-13T06:13:58.000Z","updated":"2019-08-13T06:13:58.000Z","comments":true,"path":"2019/08/13/08-Git使用心得/","link":"","permalink":"http://yoursite.com/2019/08/13/08-Git使用心得/","excerpt":"本文主要记录一些Git使用过程中心得。","text":"本文主要记录一些Git使用过程中心得。 初始化仓库：git init 新建远程仓库：git remote add origin url 添加全部文件：git add . 推送至远程仓库：git push origin master 强制推送至远程仓库（慎用）：git push -f origin master 从远程仓库拉取同步：git pull origin master","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"Git","slug":"Git","permalink":"http://yoursite.com/tags/Git/"}]},{"title":"人生如逆旅","slug":"02-人生如逆旅","date":"2019-07-30T12:27:58.000Z","updated":"2019-07-30T12:27:58.000Z","comments":true,"path":"2019/07/30/02-人生如逆旅/","link":"","permalink":"http://yoursite.com/2019/07/30/02-人生如逆旅/","excerpt":"","text":"其实一直以来，或者说从小到大我便一直是个恋家的小屁孩。但是感觉人生从高中毕业开始就一直处于奔波状态，就像是一叶扁舟流入江流，随波逐流毫无目的地飘着。高考后看着电脑屏幕前刺眼的分数，行，这下玩完了，脑子里快速想过一百种该有的态度和感觉，但很难表达出来，说不出多难受，就是脑袋顿时有点懵，就像是很早起床冲刺跑了几百米似的，脑袋有些嗡嗡嗡不清醒。 记得那些年电影中沈佳宜在高考后哭的一塌糊涂，她说自己从小到大都只会念书，其他什么都不会，以后不知道怎么办了。大概那时候我的心态也是如此吧，虽说念书也一般，其他会些乱七八糟的奇淫技巧，但是总觉得都不是什么正经途径，还是读个好大学才能光宗耀祖、衣锦返乡。所以从看到成绩那时候我便一直呆坐在那，老姐看我像个傻子似的一时间也不知道说什么安慰我，所以晚饭便没有在家吃，就带我出去撸串了。大概情况是想灌我点酒发泄一下，别愣是憋坏了。 记不得点了多少串串，只记得那晚天刚开始黑。一开始我也是没啥胃口，但也并不是因为不饿，说不饿是假的，但是想一想，我这个情况好像确实应该很难受，要是还能嘻嘻哈哈好像还真的有点不太好意思，总要做做样子体现出自己很难受的感觉把。 不过想想好像也没得办法了，算了，该吃吃，该喝喝吧，于是就抓起串串倒上小酒开始吃了。 期间吃饭途中聊些不痛不痒的问题，没啥大碍，但突然被安慰到这件事，哇，忍不住了，眼泪跟夏天的雷阵雨一下，完全挡不住地哗哗往下流啊，人这种行为大概就像是小孩子摔倒了，如果周围没人也许他就自己默默爬起来拍拍土走了，但是如果父母一安慰，大概就是哭天抢地委屈地投入其怀抱。总之，不管外表异或性格多么坚强，内心总有一块柔弱似水。但我不一样，虽然早已泪痕满面，但依旧不吭一声，强忍着哽咽继续喝着酒嚼着串。老姐说了很多，但大多不太记得，不过唯有一句倒还是一直刻着——虽然你现在可能感觉很难受，但当你几年以后，或者也许就一年以后回过头来，你会发现，其实这些都是小事。 罢了，现在木已成舟，该怎么样还得咋样，日子还是得过。","categories":[{"name":"情感","slug":"情感","permalink":"http://yoursite.com/categories/情感/"}],"tags":[{"name":"散文","slug":"散文","permalink":"http://yoursite.com/tags/散文/"},{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"关于 Hexo+Gitub 搭建静态博客相关问题","slug":"03-关于 Hexo+Gitub 搭建静态博客相关问题","date":"2019-07-26T09:08:16.000Z","updated":"2019-07-26T09:08:16.000Z","comments":true,"path":"2019/07/26/03-关于 Hexo+Gitub 搭建静态博客相关问题/","link":"","permalink":"http://yoursite.com/2019/07/26/03-关于 Hexo+Gitub 搭建静态博客相关问题/","excerpt":"本文主要介绍如何搭建一个简单静态的个人博客网站，也不知道从什么时候开始非常喜欢写点东西，不管是一开始的各种乱七八糟心情，还是后面的乱七八糟技术点，感觉都是自己人生中挺不错的宝贵经验，所以喜欢记录下来，夜半无人时总是翻开看看自己成长历程。","text":"本文主要介绍如何搭建一个简单静态的个人博客网站，也不知道从什么时候开始非常喜欢写点东西，不管是一开始的各种乱七八糟心情，还是后面的乱七八糟技术点，感觉都是自己人生中挺不错的宝贵经验，所以喜欢记录下来，夜半无人时总是翻开看看自己成长历程。 搭建静态博客我们可以使用 Hexo+码云或者Gitub，两者都可以，但是作者选择的是码云，首先支持国产，其次Gitub有时候访问速度实在是不敢恭维。关于介绍如何搭建博客问题，这篇博客说的非常详细： 使用Hexo+Gitub搭建静态博客 因为作者也是照着这篇博客进行搭建的，所以这里就不把文章copy过来，这里说几个遇到的问题以及如何解决的就好了。 问题1：在本地启动后一切正常，但是部署到Gitub或者码云之后，css样式丢失。 通过 F12 发现所有获取 css 的路径错误，我的码云项目名为 static_blog ，但是 css 都少了这一层路径，例：https://lanxuewei.gitee.io/css/style.css，加上项目路径后为：https://lanxuewei.gitee.io/static_blog/css/style.css。访问正常，ok，说明起始路径有问题，找到项目根目录的 _config.yml 配置文件，其中： url: http://yoursite.com root: /static_blog 将 root 修改为你项目名称，重新部署就可以了。 问题2：使用 gittalk 作为评论系统，怎么配置，之前配置一直出现出初始化错误，或者加载错误之类的，总之就是配置项没弄好。 首先在 gitub 上申请账号，地址： https://github.com/settings/developers 申请过程中需要填写以下几项： Application name（这里我填写的项目名称，即 static_blog） Homepage URL（项目访问路径，例如：http://lanxuewei.gitee.io/static_blog/） Authorization callback URL（我也是填上面项目访问路径） 然后填写 gittalk 配置项 gitalk: # gitub用户名 owner: lanxuewei # 存放评论的项目名，可以使用你的项目（gitub上的），也可以在gitub上新建一个 repo: blog_comment # 在上面申请完成后会有 client_id 和 client_secret，用于认证 client_id: cb2v50e33bb2ds26bxxx client_secret: 8e3e3a79247b2c809c7152308xxxxxxxxxxxxxx 其中 owner 以及 repo 我之前一直弄错，所以导致一直没办法加载成功，最后加载成功以后，需要使用自己的账号登录初始化。 问题3：一切都完成以后，使用了一个新主题，不知道怎么定义标签以及将标签和文章进行关联？ 这个问题当时很头疼，但其实是自己不认真，在之前那篇搭建博客文章中说的很清楚，在写博客过程中，需要在博客头加上： title: #文章标题 date: #文章日期 tags: #文章标签 categories: #文章分类 -– 这里填写之后，自动会生成标签以及分类，我擦，这么简单，当时搞死老子了。 还可以添加摘要，只要在博客头加上： 摘要：一帆风顺的自己，还是要多摔几跤才会好好走路，不然总以为上天总在眷顾。&lt;!-- more --&gt; 问题4：如何将文章置顶？ 1、修改支持置顶的仓库，卸载重新安装，命令如下： npm uninstall hexo-generator-index –save npm install hexo-generator-index-pin-top –save 2、在文章头中添加 top: true -– title: Hexo + GitHub 搭建静态博客 date: 2019-06-12 12:00:25 categories: 技术 top: true -– 目前为止，置顶功能已经完成了，但是文章只是被置顶了，没有置顶标志，可以通过修改主题中源码进行添加。这里作者使用的是 indigo-card 主题，修改主题目录下 /layout/_partial/index-item.ejs 和 post.ejs 文件，将 … 修改为如下内容： 1234567891011&lt;div class=&quot;post-meta&quot;&gt; &lt;!-- 置顶 --&gt; &lt;% if(post.top)&#123; %&gt; &lt;i class=&quot;fa fa-thumb-tack&quot;&gt;&lt;/i&gt; &lt;font color=7D26CD&gt;置顶&lt;/font&gt; &lt;span class=&quot;post-meta-divider&quot;&gt;|&lt;/span&gt; &lt;% &#125; %&gt; &lt;%- partial(&apos;post/date&apos;, &#123;date_format: config.date_format&#125;) %&gt; &lt;%- partial(&apos;post/category&apos;) %&gt; &lt;%- partial(&apos;plugins/page-visit&apos;) %&gt;&lt;/div&gt;","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"http://yoursite.com/tags/Hexo/"},{"name":"博客","slug":"博客","permalink":"http://yoursite.com/tags/博客/"}]},{"title":"Master任务调度分配Slave集群整体设计","slug":"05-Master任务调度分配Slave集群整体设计","date":"2019-07-26T08:38:28.000Z","updated":"2019-07-26T08:38:28.000Z","comments":true,"path":"2019/07/26/05-Master任务调度分配Slave集群整体设计/","link":"","permalink":"http://yoursite.com/2019/07/26/05-Master任务调度分配Slave集群整体设计/","excerpt":"","text":"这里首先简单介绍一下本文介绍的两个系统： Master 和 Slave ，任务源为多个，对 Master 进行任务推送。其中 Master 为任务计算调度分配中心（一台机器），Slave 为各个任务计算节点（多台机器），Slave 将 Master 分配来的任务进行计算，最后将结果返回。 系统整体之间调用如下图： 功能模块概要任务流入：其中任务源为产生任务的地方，每一个任务产生时便会将任务推送给 Master，其中推送的任务包含未计算与不可计算任务，未计算表示任务可计算但是未计算，所以该任务会经过 Master 分配给 Slave 进行计算；不可计算任务表示任务缺少关键内容，不可计算，无需分配给 Slave 计算。 任务分配：Master 为任务分配调度中心，一台机器搭配 Mysql ，数据库主要记录信息为： 1、任务基本信息（业务主键、类型、状态、结果、失败原因、来源、分配机器计算节点Slave Ip 、计算尝试次数、任务分配尝试次数、创建以及分配完成各项时间等） 2、计算节点 Slave 基本信息（业务主键、计算节点 Ip 、上次以及下次心跳时间、Gpu 个数 [因为计算节点使用 ai 进行图片分析，所以 Gpu 个数作为任务分配时负载均衡的一个权衡因子]、运行任务个数、等待任务个数、繁忙程度、可处理任务类型） 3、消息队列信息（业务主键、消息主题、推送内容、附加信息、推送状态） 任务计算以及结果返回：当任务分配过来计算完成以后会将结果同步回 Master 。 任务流转过程—— 待更","categories":[{"name":"技术","slug":"技术","permalink":"http://yoursite.com/categories/技术/"}],"tags":[{"name":"Java","slug":"Java","permalink":"http://yoursite.com/tags/Java/"},{"name":"分布式","slug":"分布式","permalink":"http://yoursite.com/tags/分布式/"},{"name":"集群","slug":"集群","permalink":"http://yoursite.com/tags/集群/"}]},{"title":"Hello World","slug":"01-hello-world","date":"2019-07-26T08:26:36.000Z","updated":"2019-07-26T08:26:36.000Z","comments":true,"path":"2019/07/26/01-hello-world/","link":"","permalink":"http://yoursite.com/2019/07/26/01-hello-world/","excerpt":"摘要：一帆风顺的自己，还是要多摔几跤才会好好走路，不然总以为上天有所眷顾。","text":"摘要：一帆风顺的自己，还是要多摔几跤才会好好走路，不然总以为上天有所眷顾。 Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"情感","slug":"情感","permalink":"http://yoursite.com/categories/情感/"}],"tags":[{"name":"散文","slug":"散文","permalink":"http://yoursite.com/tags/散文/"},{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]}]}